import React from 'react';

const Answers_40_80: React.FC = (): JSX.Element => {
  return (
    <>
      <div id="40">
        <h3>
          Форматування диска. Призначення. Збереження інформації про формат .
        </h3>
        <p>
          Форматува́ння (formatting) — процедура створення структур порожньої
          файлової системи вказаного типу — розподіл доріжок магнітного диска
          (дискети, твердого диска) чи іншого носія інформації (наприклад, SSD
          чи флеш-накопичувача) на фізичні чи логічні записи, що виконується
          перед першим використанням диска. Форматування, при цьому
          супроводжується втратою даних, що зберігаються на розділі, який
          форматується.
        </p>
        <p>
          Суть форматування — створення (формування) структур доступу до даних,
          наприклад, структур файлової системи. Після цього можливість прямого
          доступу до інформації, попередньо записаної на носії, втрачається,
          частина її безповоротно знищується. Деякі програмні утиліти дають
          можливість відновити деяку (зазвичай, більшу) частину інформації з
          відформатованих носіїв. В процесі форматування також може перевірятися
          й виправлятися цілісність носія.
        </p>
        <p>
          Форматувати HDD потрібно з кількох причин: Створення базової розмітки
          для подальшої роботи з вінчестером Виконується після першого
          підключення нового HDD до ПК, інакше його просто не буде видно серед
          локальних дисків. Очищення від всіх збережених файлів За роки роботи
          комп'ютера або ноутбука на вінчестері скупчується величезна кількість
          непотрібних даних. Це не тільки призначені для користувача, але і
          системні файли, які вже не потрібні, але при цьому не видаляються
          самостійно. В результаті може виникнути переповнення накопичувача,
          нестабільна і повільна робота. Найпростіший варіант позбавлення від
          сміття - зберегти потрібні файли в хмарне сховище або на флешку і
          відформатувати вінчестер. Це в якомусь роді є радикальним методом
          оптимізації роботи HDD. Повна перевстановлення операційної системи Для
          більш якісної і чистої установки ОС правильніше за все використовувати
          чистий диск. Виправлення помилок Непереборні віруси і шкідливе
          програмне забезпечення, пошкоджені блоки і сектора і інші проблеми з
          вінчестером нерідко виправляються створенням нової розмітки.
        </p>
      </div>
      <div id="41">
        <h3>
          Електронна пошта та пришити її функціонування. Поштові стандарти.
          Електронна адреса. Основні можливості використання поштових програм.
          Правила й етикет електронного листування.
        </h3>
        <p>
          Електронна пошта (E-mail) ¾ одна з найбільш популярних служб Internet.
          Популярність електронної пошти пояснюється її оперативністю,
          дешевизною, доступністю. Перша поштова програма була створена в 1971
          р. Реєм Томлісоном, американським професором, співробітником компанії
          DDN, яка розробила мережу ARPANET. До переваг електронної пошти
          належать : швидкість і надійність доставки кореспонденції; відносно
          низька вартість послуг; можливість швидко ознайомити широке коло
          кореспондентів з повідомленням; пересилання не тільки текстових
          повідомлень, але й програм, графіків, аудіофайлів; економія паперу і
          т.д. Час одержання листа складається з двох частин : часу, необхідного
          мережі для доставки листа на поштовий сервер, і часу, необхідного для
          доставки адресатові.
        </p>
        <p>
          Робота E-mail ґрунтується на протоколах POP3 і SMTP, а також на
          взаємодії двох поштових програм ¾ поштового сервера і поштового
          клієнта.
        </p>
        <p>
          POP3 (Post Office Protocol 3, поштовий протокол 3) ¾ протокол для
          одержання і зберігання повідомлень.
        </p>
        <p>
          SMTP (Simple Mail Transport Protocol, простий протокол передачі пошти)
          ¾ протокол для передавання повідомлень.
        </p>
        <p>
          Стандарт MIME (Multipurpose Internet Mail Extensions ─ багатоцільові
          розширення поштового стандарту мережі Internet) описує, яким чином
          пересилати електронною поштою дані. Типове застосування MIME ─
          пересилання графічних зображень, аудіо, документів Word, програм і
          навіть просто текстових файлів, коли важливо, щоб під час пересилання
          не відбувалося ніяких перетворень даних. MIME також дозволяє
          розподіляти лист на частини різних типів таким чином, щоб отримувач
          (поштова програма) міг визначити, що робити з кожною частиною листа.
        </p>
        <p>
          Загальна схема роботи з електронною поштою така : користувач
          звертається до провайдера, реєструється й одержує адресу електронної
          пошти. На сервері провайдер створює поштову скриньку користувача, в
          якій будуть накопичуватися повідомлення користувача. Також можна
          відкрити поштову скриньку самостійно на безкоштовному сервері. Для
          відкриття безкоштовної поштової скриньки необхідно пройти реєстрацію
          на даному сервері та прийняти деякі умови.
        </p>
        <p>
          При використанні електронної пошти кожній поштовій скриньці
          користувача присвоюється унікальна поштова адреса, яка зазвичай
          утворюється приєднанням імені користувача до імені самого комп’ютера.
          Ім’я користувача й ім’я комп’ютера розділяє спеціальний символ @ , що
          називається «ет комерційне». Регістр букв в адресі значення не має,
          допускається використання букв латинського алфавіту, цифр і знаків «-»
          і «_». Пробіли, розділові знаки й символи кирилиці не
          використовуються. Наприклад, якщо користувач має вхідне ім’я emsworth
          на комп’ютері blandings.com , то його електронна адреса буде мати
          вигляд emsworth@blandings.com .
        </p>
        <p>
          Будь-яка система електронної пошти складається з двох головних
          підсистем : клієнтського програмного забезпечення, з яким
          безпосередньо взаємодіє користувач, і серверного програмного
          забезпечення, яке керує прийомом повідомлення, яке керує прийомом
          повідомлення від користувача-відправника, передаванням повідомлення,
          направленням повідомлення в поштову скриньку адресата та його
          збереженням у цій скриньці доти, поки користувач-одержувач його не
          візьме звідти.
        </p>
        <p>
          Для роботи з електронною поштою існують спеціальні поштові
          програми-клієнти, наприклад Outlook Express, Internet Mail тощо.
          Функції поштових програм. · Збирання листів з поштової скриньки на
          сервері. · Відсилання підготовлених листів. · Сортування прийнятих
          листів і листів, що відправляються, по папках. · Ведення адресної
          книги. · Відповідь на листи, що надходять, пересилання листів. ·
          Створення нового листа. · Можливість прикріплення до листа, що має
          звичайний текстовий вигляд, картинки чи будь - якого іншого файлу.
        </p>
        <p>
          Правила та етикет електронного листування ─ це частина мережного
          етикету. 1. Ніколи не довіряйте електронній пошті інформацію, що не є
          призначеною для всіх. (Ваші повідомлення часто залишаються в резервних
          копіях файлів на тривалий термін). 2. Будуйте фрази грамотно з точки
          зору орфографії та граматики. 3. Пам’ятайте про різне сприйняття
          відправником та одержувачем (Відправник найчастіше сприймає
          повідомлення як дружню бесіду, одержувач ─ як діловий лист. Електронна
          пошта забезпечує швидкий контакт, однак при цьому повністю відсутнє
          супроводження «мовою жестів». Ця проблема в мережі розв’язується за
          допомогою так званих «смайликів», тобто комбінацій символів ASCII, їх
          призначення ─ передавати вираз людського обличчя). 4. Не
          використовуйте цитати, які можуть скривдити людей. 5. Цитуйте у своїй
          відповіді текст оригінального повідомлення. 6. Правильно заповнюйте
          поля електронного повідомлення. 7. Пам’ятайте про відображення вашого
          повідомлення на екрані монітора (Встановлюйте довжину рядка, яка не
          перевищує 60 символів, щоб повідомлення відображалось на дисплеї
          практично будь-якого типу. Не пишіть увесь текст у верхньому регістрі,
          режим великих букв ─ тільки для більшої виразності. Не використовуйте
          різні види накреслення шрифту). 8. Використовуйте підпис (
          Рекомендована довжина підпису ─ із зазначенням організації, телефонів
          тощо ─ до 7 рядків). 9. Пам’ятайте, що користувач в Internet несе
          відповідальність за зміст своїх повідомлень.
        </p>
      </div>
      <div id="42">
        <h3>Покоління обчислювальних машин по методу обробки інформації.</h3>
        <p>
          По етапах створення ЕОМ виділяють кілька поколінь розвитку
          комп'ютерної техніки, які формувалися протягом XX в.
        </p>
        <p>
          До першого покоління відносять машини, створені в 1950-і рр. на основі
          електронних ламп. В цей час були розроблені вітчизняні машини: МЕСМ
          (мала електронна рахункова машина), БЕСМ (велика електроннолічильні
          машина), "Стріла", серія "Урал", М-20. Основним застосуванням перших
          ЕОМ було виконання науково-технічних розрахунків.
        </p>
        <p>
          Через десятиліття з'явилися ЕОМ, створені на дискретних
          напівпровідникових приладах (транзисторах). Друге покоління ЕОМ
          застосовувалося для технічних і економічних розрахунків.
        </p>
        <p>
          Машини третього покоління з'явилися в 1970-і рр. і були розроблені на
          напівпровідникових інтегральних схемах з малої і середньої ступенем
          інтеграції (сотні, тисячі транзисторів в одному корпусі). Це покоління
          ЕОМ початок застосовуватися в управлінні і проведенні економічних
          розрахунків.
        </p>
        <p>
          Четверте покоління ЕОМ сформувалося в 1980-і рр. на базі великих і
          надвеликих інтегральних схем - мікропроцесорів (десятки тисяч -
          мільйони транзисторів в одному кристалі). Метою ЕОМ цього покоління
          вже було подання інформації та більш широке використання в управлінні.
        </p>
        <p>
          Так, 1990-ті рр. характеризуються створенням ЕОМ з багатьма десятками
          паралельно працюючих мікропроцесорів, що дозволяють будувати ефективні
          системи обробки знань. Для цього покоління характерні застосування
          персональних комп'ютерів, телекомунікаційна обробка даних, комп'ютерні
          мережі, широке застосування систем управління базами даних, елементи
          інтелектуальної поведінки систем обробки даних і пристроїв.
        </p>
        <p>
          Створення оптоелектронних ЕОМ з масовим паралелізмом і нейронної
          структурою відноситься до початку XXI ст. Передбачається, що в
          комп'ютерах наступного покоління відбудеться якісний перехід від
          обробки даних до обробки знань.
        </p>
      </div>
      <div id="43">
        <h3>Правила впорядкування та пошуку даних у базі даних. Приклади.</h3>
        <p>
          У ACCESS існує багато способів пошуку потрібних даних під час
          виконання пошуку конкретного значення, одного запису або групи
          записів. Для пошуку запису можна прокрутити форму або об’єкт у режимі
          таблиці або ввести номер потрібного запису в поле номера запису. За
          допомогою діалогового вікна Пошук можна знайти конкретні записи або
          певні значення в полях. Якщо потрібно замінити конкретні, виявлені в
          ході пошуку значення, слід скористатися вікном Замена. За допомогою
          фільтра можна тимчасово ізолювати й переглянути конкретний набір
          записів для роботи з ним при відображенні на екрані відкритої форми
          або таблиці. За допомогою запиту можна працювати з конкретним набором,
          який задовольняє задані умови записів з однієї або декількох таблиць
          бази даних. Порядок пошуку значення в таблиці, формі або запиті ACCESS
          такий :
        </p>
        <p>
          Відкрити таблицю, запит або форму, у яких необхідно виконати пошук.
          Вибрати поле (стовпець), за яким треба виконати пошук (пошук в одному
          полі виконується швидше, ніж пошук у всі таблиці або формі). Натиснути
          кнопку Бинокль; увести в поле Образец значення, яке потрібно знайти.
          Якщо точне значення для пошуку невідоме, можна використовувати в полі
          Образец підстановочні знаки; установити в діалоговому вікні Поиск и
          замена всі інші потрібні параметри; натиснути кнопку Найти далее.
        </p>
      </div>
      <div id="44">
        <h3>
          Розподілені системи обробки інформації. Визначення. Призначення.
        </h3>
        <p>
          Распределенная система обработки данных (РСОД) - любая система,
          позволяющая организовать взаимодействие независимых, но связанных
          между собой ЭВМ. Эти системы предназначены для автоматизации таких
          объектов, которые характеризуются территориальной распределенностью
          пунктов возникновения и потребления информации. Концептуально
          распределенная обработка подразумевает тот или иной вид организации
          сети связи и децентрализацию трех категорий ресурсов:
        </p>
        <p>
          · аппаратных вычислительных средств и собственно вычислительной
          мощности; · баз данных; · управление системой.
        </p>
        <p>
          В распределенных системах обработки данных в той или иной степени
          осуществляется реализация следующих основных функций: · доступ к
          ресурсам (вычислительным мощностям, программам, данным и т. п.) с
          терминалов и из пользовательских программ в режиме «файл-сервер»; ·
          выполнение заданий и интерактивное общение пользователей с запущенными
          по их требованию программами в режиме «клиент-сервер»; · сбор
          статистики о функционировании системы; · обеспечение надежности и
          живучести системы в целом.
        </p>
        <p>
          Системы, имеющие программы распределенной среды, включают компьютеры,
          называемые серверами и клиентами. Каждый сервер имеет свою группу
          клиентов. Программное обеспечение сетевой среды обслуживается и
          поддерживается сетевыми операционными системами. В роли сервера
          выступает главный, более мощный компьютер. Распределенная среда
          требует организации распределенной базы данных и такого
          инструментария, как распределенная система управления базой данных
          (РСУБД). Распределенная обработка данных позволила повысить
          эффективность удовлетворения изменяющейся информационной потребности
          информационного работника и тем самым обеспечить гибкость принимаемых
          им решений.
        </p>
        <p>
          Преимущества распределенной обработки данных: • большое число
          взаимодействующих между собой пользователей, выполняющих функции
          сбора, регистрации, хранения, передачи и выдачи информации; • снятие
          пиковых нагрузок с централизованной базы путем распределения обработки
          и хранения локальных баз данных на разных ЭВМ; • обеспечение доступа
          информационного работника к вычислительным ресурсам сети ЭВМ; •
          обеспечение симметричного обмена данными между удаленными
          пользователями. Введение классификации моделей представления данных на
          иерархические, сетевые и реляционные отразилось на архитектуре систем
          управления базами данных и технологии их обработки. Архитектура СУБД
          описывает ее функционирование как взаимодействие процессов двух типов:
          клиента и сервера. Распределенная обработка и распределенная база
          данных не синонимы. Если при распределенной обработке производится
          работа с базой, то подразумевается, что представление данных, их
          содержательная обработка, работа с базой на логическом уровне
          выполняются на персональном компьютере клиента, а поддержание базы в
          актуальном состоянии — на сервере.
        </p>
      </div>
      <div id="45">
        <h3>
          Апаратні, програмні та інформаційні ресурси сучасних мереж. Програмне
          забезпечення роботи в глобальній мережі Інтернет. Основні послуги
          глобальної мережі Інтернет
        </h3>
        <p>
          nternet - глобальна комп'ютерна мережа, що охоплює увесь світ.
          Сьогодні Іnternet має близько 15 мільйонів абонентів у більш ніж 150
          країнах світу. Щомісяця розмір мережі збільшується на 7-10%. Іnternet
          утворює як би ядро, що забезпечує зв'язок різних інформаційних мереж,
          які належать різним установам в усьому світі.
        </p>
        <p>
          Сучасні мережі створюються по багаторівневому принципі. Передача
          повідомлень у виді послідовності бітів починається на рівні ліній
          зв'язку й апаратури, причому лінії зв'язку не завжди високої якості.
          Потім додається рівень базового програмного забезпечення, що керує
          роботою апаратури. Наступний рівень програмного забезпечення дозволяє
          наділити базові програмні засоби додатковими необхідними можливостями.
          Розширення функціональних можливостей мережі шляхом додавання рівня за
          рівнем приводить до того, що Ви зрештою одержуєте по-справжньому
          дружній і корисний інструментарій. Функція Internet полягає не лише в
          тому, щоб зв'язати комп'ютери один з одним. Основне завдання Internet
          - забезпечити користувача необхідною інформацією і послугами. Для
          цього використовується технологія клієнт/сервер (англ. client
          /server). Клієнт - це програма, що приймає інформацію і послуги, які
          надаються іншими програмами - серверами. Клієнти виступають у ролі
          споживачів, а сервери - у ролі постачальників. Комп'ютери, на яких
          запускають програми-сервери, повинні мати досить потужні ресурси,
          оскільки їм доводиться "пропускати через себе" великі обсяги
          інформації. Будь-який комп'ютер мережі може виступити в ролі клієнта,
          щойно на ньому буде запущена якась програма-клієнт.
        </p>
        <p>
          Загальна мережеве програмне забезпечення включає: • браузер - програма
          перегляду веб-сторінок (наприклад, Internet Explorer). Браузер містить
          такі засоби: програму для роботи з електронною поштою (читання,
          створення, редагування і відправка поштових повідомлень); програму для
          роботи з сервером новин (підписка на групу новин, читання новин,
          створення і пересилання повідомлень), редактор тексту; •
          HTML-редактори - редактори, призначені для створення веб-сторінок; •
          графічні веб-засоби - засоби, призначені для оптимізації графічних
          елементів веб-сторінок; • машинні перекладачі - програмні засоби, що
          служать для перегляду веб-сторінок на різних мовах; • антивірусні
          мережеві програми - програми, використовувані для запобігання
          потрапляння програмних вірусів на комп'ютер користувача або поширення
          його по локальній мережі фірми. До системного програмного забезпечення
          відносять: • операційну систему - обов'язкову частину системного
          програмного забезпечення, що гарантує ефективне функціонування ЕОМ у
          різних режимах, організуючу виконання програм і взаємодія користувача
          і зовнішніх пристроїв з ЕОМ; • сервісні програми - програми, які
          розширюють можливості ОС, надаючи користувачеві і його програмами
          набір додаткових послуг; • систему технічного обслуговування -
          систему, яка полегшує діагностику, тестування обладнання та пошук
          несправностей в ПК. Спеціальні мережні ОС призначені для управління
          мережею. По своїй організації цей різновид мережевих ОС можна
          розділити на однорангові (Peer-To-Peer Network) і з виділеним сервером
          (Dedicated File Server Network). До однорангові відносяться такі
          мережні ОС, як NetWare Lite, Personal NetWare (Novell), Windows For
          Workgroups (Microsoft), LANtastic (Artisoft).
        </p>
        <p>
          Послуги комп’ютерної мережі INTERNETINTERNET надає такі основні види
          послуг: e-mail – електронна пошта; групи новин; списки поштової
          розсилки; доступ до файлів віддалених комп’ютерів; сеанси зв’язку з
          іншими комп’ютерами, під’єднаними до INTERNET; пошук інформації в базі
          даних в оперативному режимі; спілкування з іншими користувачами шляхом
          використання сервісу Internet Relay Chart; доступ до інформаційної
          системи World Wide Web (WWW). З додаткових послуг можна виділити
          наступні: широка передача MultiMedia; RadioInternet; розмовний
          конференційний зв’язок; безпечні угоди; відеоконференційний зв’язок;
          безпровідне з’єднання.
        </p>
      </div>
      <div id="46">
        <h3>
          IP адреса. Призначення. Дати двійкове представлення IP адреси
          10.18.52.1
        </h3>
        <p>
          IP-адреса (ай-пі адреса, скорочення від англ. Internet Protocol
          Address) - мережева адреса вузла в комп'ютерній мережі Інтернет.
        </p>
        <p>Є два основних типи:</p>
        <p>
          Статична IP-адреса забезпечує можливість передачі даних із
          застосуванням мережевих протоколів, для роботи яких необхідна
          наявність у користувача реального IP-адресу в мережі Інтернет. Це
          необхідно, наприклад, для встановлення шифрованого VPN-з'єднання.
          Динамічна IP-адреса - призначається автоматично при підключенні
          пристрою до мережі і використовується протягом обмеженого проміжку
          часу, як правило, до завершення сеансу підключення. Також виділяють
          Ipv4 і Ipv6. pv4 - перша основна версія протоколу, яка застосовується
          для забезпечення роботи величезної частини Інтернету. Відповідно до
          IPv4, адреси складаються з бінарних чисел 0 і 1. Але вони можуть бути
          записані у вигляді десяткових чисел, між якими ставиться крапка.
        </p>
        <p>
          4,3 мільярда ipv4 досить велика кількість, але все ж її недостатньо
          для всіх пристроїв і потреб у всьому світі. Для вирішення цієї
          проблеми були розроблені IPv6. Вони використовують адресний простір
          розміром 128 біт. Обидва типи цих адрес Ви можете орендувати в нашій
          компанії.
        </p>
        <p>
          Кожному вузлу IP мережі призначається 32-розрядна логічна адреса, що
          називається IP-адресою. IP-адреса має довжину 4 байти і звичайно
          записується у вигляді чотирьох чисел, що представляють значення
          кожного байта в десятковій формі і розділених крапками, наприклад,
          10.18.52.1 – традиційна десяткова форма представлення адреси, а 1010
          10010 110100 1 – двійкова форма представлення цієї ж адреси.
        </p>
      </div>
      <div id="47">
        <h3>
          Ділова графіка. Побудова діаграм і графіків на основі табличних даних
          у середовищі табличного процесора. Приклади.
        </h3>
        <p>
          Подання даних в графічному вигляді (діаграм та графіків) дозволяє
          вирішувати різноманітні задачі. Основна перевага такого подання — його
          наочність (легко можна побачити тенденції до змін, різнома­нітні
          співвідношення, взаємозв'язок різних процесів тощо). Діаграма являє
          собою графічне зображення зв'язків між величинами, які порівнюються.
          Графік — графічне (візуальне) відображення числових даних згідно з
          вибраними осями та масштабом. Для побудови діаграм та графіків
          використовують спеціальні прогоа засоби, наприклад програма для
          проектування й опрацювання електрони таблиць Microsoft Office Excel. У
          програмі MS Excel термін «діаграма» використовується для позначення
          усіх видів графічних зображень числових даних. На діаграмі числові
          дані та­блиці зображуються у вигляді точок, ліній, смуг, стовбців,
          секторів і в іншій формі. Групи елементів даних, що відбивають вміст
          комірок одного рядка або стовпця на робочому листі, складають ряд
          даних. Microsoft Excel дозволяє будувати діаграми різних типів. Вибір
          правиль­ного типу діаграми — ключовий фактор, що впливає на
          переконливість гра­фічного зображення. Всього в Excel є 14 типів
          стандартних і 20 типів нестан­дартних діаграм. Стандартні типи діаграм
          Excel: гістограма, лінійчата діаграма, графік, кругова діаграма,
          точкова діаграма, з ділянками, кільцева, пелюсткова, по­верхнева,
          бульбашкова, біржова, циліндрична, канонічна, пірамідальна.
        </p>
        <p>
          Гістограма. Діаграми цього типу використовують для демонстрації того,
          як певні значення змінюються у часі, а також для порівняння даних або
          з'ясування тенденцій. Гістограму краще застосовувати, коли потрібно
          оціни­ти зміну даних за скінчений період часу.
        </p>
        <p>
          Лінійчата діаграма. Це горизонтальна діаграма, яка схожа на
          гістогра­му. Демонструє або порівнює окремі числові значення у
          визначений час. У ній менше уваги приділяється часовому перебігу,
          подібна діаграма відобра­жає співвідношення окремих компонентів.
          Лінійчата діаграма нагадує гісто­граму, повернуту на 90°. За наявності
          багатьох значень даних, які потрібно продемонструвати, краще обрати
          лінійчату діаграму, аніж гістограму, осо­бливо якщо планується її
          друкувати.
        </p>
        <p>
          Графік. Діаграму цього типу краще засто­совувати у випадках, коли
          треба показати зміни у групі значень за довгі проміжки часу, особливо
          якщо треба акцентувати ува­гу на змінах у часі і темпах змін. Графіки
          рекомендується використовувати при потре­бі відобразити кілька груп
          даних одночасно.
        </p>
        <p>
          Точкова діаграма. Діаграма такого типу зазвичай використовується для
          побу­дови графіка даних наукових досліджень, але її також можна
          застосовувати і для відтворення будь-якого іншого графіка, на якому,
          наприклад, потрібно побачити співвідношення між двома числовими
          змінними і порівняти їх значення у різні проміжки часу.
        </p>
        <p>
          Кругова діаграма. Використання кру­гової діаграми — це найкращий
          спосіб зо­бразити складові частини якоїсь величини або певні пропорції
          і співвідношення.
        </p>
        <p>
          Кільцева діаграма. На перший погляд, кільцева діаграм нагадує кругову.
          На загал це правильно, коли створюється графік з одного ряду даних.
          Проте на відміну від кругової діаграми кільцева може використовуватися
          для демонстрації не одного ряду даних, а декількох, і тоді кожне
          кільце в кільцевій діаграмі відображає окремий ряд даних. Для того,
          щоб створити в Excel діаграму, необхідно спочатку ввести для неї Дані
          на робочому аркуші. Після цього виділити ці дані, скориставшись
          Мастером диаграмм для покрокового створення діаграми, при якому
          оби­раються її тип і певні параметри. Або скористатися для створення
          основної діаграми панеллю інструментів Диаграмма.
        </p>
      </div>
      <div id="48">
        <h3>Мета обчислення (Суперобчислення)</h3>
        <p>
          Метаобчислення обумовлені бажанням користувачів мати доступ до
          ресурсів, недоступних в середовищі одномашинних обчислень. Турчин
          Валентин Федорович заклав основи метаобчислень, запропонувавши якісно
          новий метод перетворення і оптимізації програм. Метакомп’ютер (або
          обчислювальна мережа) утворюється деяким рівнем програмного
          забезпечення, яке об'єднує комп'ютери і комунікаційні мережі,
          створюючи ілюзію одного віртуального комп'ютера. Ще один рівень
          програмного забезпечення на вершині цієї інфраструктури забезпечує
          метаобчислювальне середовище, що дозволяє програмам використовувати
          можливості метакомп’ютера. Суть і ролі цих рівнів програмного
          забезпечення подібні операційним системам, які реалізують віртуальну
          машину на вершині апаратних ресурсів і підтримують набір інструментів,
          використовуваних прикладними програмістами.Метатеорія — теорія, що
          аналізує методи й властивості іншої теорії, так званої предметної або
          об'єктної теорії. Завдання метатеорії - встановити межі області
          застосування досліджуваної в ній теорії, відповісти на запитання про
          її несуперечності та повноті, вивчити або встановити способи введення
          її нових понять і докази її тверджень тощо. Необхідність створення
          метатеорії виникла насамперед у застосуванні до математики. Вона була
          зумовлена потребою з'ясування сенсу понять доказ, аксіома, теорема,
          дослідження структури математичних теорій і питання про їхню
          істинність в категорійно-логічних інтерпретаціях
        </p>
        <p>
          Грід-обчислення — це сукупність комп'ютерних ресурсів з декількох
          місць для досягнення спільної мети. Сітка може розглядатися як
          розподілена система з неінтерактивних робочих навантажень, які
          включають в себе велику кількість файлів. Сітка обчислень
          відрізняється від звичайних високопродуктивних обчислювальних систем,
          таких як кластерних обчислень тим, що сітки комп'ютерів мають кожен
          вузол налаштований на виконання іншої задачі / програми. Комп'ютерні
          сітки також мають тенденцію бути більш різнорідними і географічно
          розосереджені (таким чином, не фізичні в поєднанні), ніж кластерних
          комп'ютерів. Незважаючи на те, одна сітка може бути присвячена певній
          програмі, зазвичай сітка використовується для різних цілей. Сітки
          часто будуються з загального призначення бібліотеки сітки проміжного
          програмного забезпечення. Розміри сітки може бути досить великим.
        </p>
        <p>
          рід є формою розподілених обчислень, в якому багато комп'ютерів
          об'єднані в один потужний віртуальний комп'ютер, і які працюють разом
          для виконання трудомістких завдань. Для деяких застосувань, «ґрід»
          обчислення можна розлядати як спеціальний тип паралельних обчислень
          які покладаються на цілі комп'ютери(обладнані процесорами, пам'ятю,
          живленням, мережевим інтерфейсом і тд.), під'єднані до комп'ютерної
          мережі(приватної або публічної) звичайним мережевим інтерфейсом, таким
          як Ethernet. Це все відрізняє від традиційного поняття
          суперкомп'ютера, який має багато процесорів, з'єднаних локальною
          високошвидкісною комп'ютерною шиною.
        </p>
      </div>
      <div id="49">
        <h3>
          Інформаційний зв'язок у мережі Інтернет. Ідентифікація комп'ютерів у
          мережі. Адресація в мережі Інтернет. Провайдери. Способи під'єднання
          комп'ютерів до глобальної мережі.
        </h3>
        <p>
          Кожний комп'ютер, підключений до Internet, повинен мати свою адресу. В
          Internet використовуються два типи адрес: цифрові або IР-адреси і
          доменні (від англ. domain - область, сфера). Розглянемо структуру
          кожного з цих типів. IP-адреса за смислом аналогічна поштовому
          індексу, що містить інформацію про місто (перші три цифри) і поштове
          відділення в ньому (інші три цифри). IP-адреса є послідовністю з
          чотирьох чисел, розділених крапками: Наприклад, 198.162.201.204. Кожне
          з чисел займає 1 байт = 8 битів (через це їх часто називають
          октетами), тобто може набувати значень від О до 255. Ліва частина
          IP-адреси визначає конкретну мережу в Internet і називається
          ідентифікатором мережі* (англ. network ID). Права частина IP-адреси
          визначає конкретний комп'ютер у цій мережі й називається
          ідентифікатором комп'ютера (англ. host ID). Використовуються три класи
          IP-адрес: А, В і С. Клас IP-адреси визначає, скільки октетів
          відводиться під адресу мережі і скільки під адресу комп'ютера.
          IP-адреси класу А призначені для роботи з невеликою кількістю (до 126)
          мереж, які містять велику кількість комп'ютерів (до 16 777 214). Через
          це в таких адресах один октет - найліві-ший - задає адресу мережі, а
          три правих - адресу комп'ютера в цій мережі. IP-адреси класу В
          призначені для роботи із середньою кількістю мереж (до 16 384), що
          містять середню кількість комп'ютерів (до 65 534). У таких адресах два
          лівих октети - це ідентифікатор мережі, а два правих - ідентифікатор
          комп'ютера. IP-адреси класу С призначені для роботи з великою
          кількістю мереж (до 2 097 092), що містять малу кількість комп'ютерів
          (до 254). У таких адресах три лівих октети містять ідентифікатор
          мережі, а найправіший - ідентифікатор комп'ютера. До якого класу
          належить IP-адреса, визначають за значенням першого октету: якщо у
          першому октеті число від 1 до 126 - це IP-адреса класу А, якщо від 128
          до 191 - класу В, якщо від 192 до 223 - класу С. Для передачі
          повідомлень на конкретні комп'ютери в Internet протокол TCP/IP і
          програми-клієнти використовують IP-адреси. Але для сприйняття
          користувачем IP-адреса незручна. Людині краще працювати з іменами.
          Тому користувачі звичайно працюють із доменними адресами - унікальними
          іменами комп'ютерів у Internet. Доменна адреса, так само як і
          IP-адреса, складається з частин, розділених крапками. Але на відміну
          від IP-адреси, що уточнює місце призначення зліва направо, доменна
          адреса робить це у зворотному порядку - справа наліво: спочатку йде
          ім'я комп'ютера, а потім - ім'я мережі, в якій він знаходиться. Щоб
          користувачам Internet було простіше зв'язуватись один з одним, весь
          простір її адрес розбитий на області - домени. Можливе також
          розділення за певними ознаками всередині доменів. Доменна адреса
          комп'ютера включає в себе, як мінімум, два рівні доменів: ·
          Найправіший - домен першого рівня, · наступний зліва - його піддомен -
          домен другого рівня тощо. Домен першого рівня визначає країну або тип
          організації, до якої належить комп'ютер. Існують визначені дволітерні
          скоречення для доменів країн. Наприклад, Україна - ua; Росія - ru; США
          - us; Франція - fr. Домени типів організацій звичайно мають трилітерні
          скорочення. Наприклад, університети та інші навчальні заклади - edu,
          урядові установи - gov, комерційні організації - com, провайдери
          послуг Internet - net тощо. Домен другого рівня визначає організацію,
          яка володіє або керує мережею, що містить даний комп'ютер. У більшості
          випадків ім'я цього домену збігається з назвою відповідної фірми або
          її торговою маркою. Ім'я комп'ютера вказує конкретний комп'ютер у
          мережі, визначеної доменами першого і другого (а можливо, і наступних)
          і рівнів. Воно реєструється лише в цій мережі і тільки ця мережа І
          "відповідальна" за передачу інформації конкретному
          комп'ютеру-адресату. Для того щоб мережевий комп'ютер "зрозумів", куди
          слід передати повідомлення, доменна адреса має бути перетворена на
          IP-адресу. Отже, десь в Internet повинні зберігатися таблиці
          відповідності доменних і IP-адрес. Звісно, що "звичайний" комп'ютер
          користувача мережі не може і не повинен знати всі IP-адреси в
          Internet. Такі таблиці зберігаються на спеціальних серверах, які
          називаються DNS-серверами (скорочення від англ. Domain Name System -
          система доменних імен). DNS-сервери розкидані по всьому Internet.
          Кожний з них зберігає інформацію про велику кількість комп'ютерів в
          Internet і здатний миттєво перетворити доменне ім'я на IP-адресу. Якщо
          IP-адреса запитаного комп'ютера не відома даному DNS-серверу, він
          звернеться до найближчого DNS-сервера і далі за ланцюжком, доки
          потрібна адреса не буде знайдена. Весь процес забиратиме лише кілька
          секунд. Під час налагоджування комп'ютера для роботи в Internet
          користувач повинен указати адресу одного із DNS-серверів (таку адресу
          можна отримати у провайдера послуг Internet або в адміністратора
          локальної мережі).
        </p>
        <p>
          Постачальник послуг Інтернету (англ. Internet Service Provider, ISP),
          також провайдер послуг Інтернету, надавач послуг Інтернету,
          Інтернет-провайдер (від англ. to provide — забезпечувати, надавати
          доступ) — організація, яка надає послуги доступу та передачі
          (інформації) певними інформаційними каналами.
        </p>
        <p>
          Послуги інтернет-провайдера: • доступ до Інтернету по комутованих
          лініях надійного зв'язку • надання дискового простору для зберігання
          та забезпечення роботи сайтів (хостінг) • підтримка сервісів
          електронних поштових скриньок чи віртуального поштового сервера •
          розташування обладнання клієнтів на власних технічних потужностях та
          лініях зв'язку (колокація) • оренда відокремлених та віртуальних
          серверів, резервування даних тощо
        </p>
        <p>
          Для під’єднання до мережі можна скористатись телефонними, кабельними
          каналами або каналами радіозв’язку. Розглянемо найпоширеніші способи:
        </p>
        <p>
          Найпоширенішими способами на сьогоднішній день є: Модемне з'єднання
          (Комутований доступ) – Dial-Up, ADSL. З'єднання по виділеній лінії
          (оптоволоконний кабель чи «скручена пара»). GPRS – доступ через
          мобільний телефон. Радіодоступ. Супутниковий Інтернет.
        </p>
        <p>
          Вони різняться між собою за принципом роботи, швидкістю передачі
          даних, надійністю, складністю налаштування обладнання і, звичайно ж,
          ціною. Основною характеристикою будь-якого під’єднання до Інтернету є
          швидкість передачі даних. Вона вимірюється в кількості інформації, що
          передається користувачеві за одиницю часу (за одну секунду) і,
          зазвичай, вимірюється в кілобайтах/сек (Kb/s) або кілобітах/сек
          (kbps). Для високошвидкісних каналів швидкість вимірюється вже в
          Мегабітах або Мегабайтах в секунду. Загалом доступ до Інтернету
          постійно дешевшає. В великих містах завдяки наявності будинкових
          мереж, конкуренції багатьох провайдерів, великої кількості
          користувачів – послуги доступу в Інтернет є значно дешевшими, ніж в
          регіонах.
        </p>
      </div>
      <div id="50">
        <h3>Математичне забезпечення обчислювальних систем.</h3>
        <p>
          Математичне забезпеченнявключає сукупність математичних методів,
          моделей і алгоритмів для розв’язку задач управління і обробки
          інформації із застосуванням обчислювальної техніки. Математичне
          забезпечення містить засоби математичного забезпечення, методи вибору
          розв’язування, технічну документацію, персонал (спеціалістів цієї
          галузі). До засобів математичного забезпечення відносяться: моделі
          процесів управління, алгоритми розв’язку задач управління, методи
          оптимізації за багатьма критеріями, методи математичного
          програмування, математичної статистики, теорії масового обслуговування
          та інші. До методів вибору рішення математичного забезпечення
          інформаційної системи відносяться методи вибору типів алгоритмів,
          оцінки їх точності, швидкодії і складності. Технічна документація
          включає описи задач і алгоритмів, постановки задач, описи пакетів
          прикладних програм, тести і контрольні приклади. Спеціалісти
          математичного забезпечення займаються постановкою задач та
          використання математичних аналітичних і числових методів.
        </p>
      </div>
      <div id="51">
        <h3>
          Робота з таблицями в середовищі текстового процесора.Автоматичне
          форматування таблиці. Створення нового стилютаблиці. Таблиця і текст,
          їх взаємне перетворення. Приклади.
        </h3>
        <p>
          Таблиці призначені для наочного подання інформації та структурування
          даних для подальшого аналізу, виконання нескладних математичних
          обчислень з даними таблиці. Елементами таблиці є осередки, рядки,
          стовпці, рамки і дані осередків. За допомогою меню Таблиця можна
          створювати, форматувати та редагувати таблиці. Вибравши пункт меню
          Вставити таблицю і задавши кількість стовпців і рядків, таблиця
          вставляється в документ. Вона з'явиться в тому місці, де знаходився
          курсор. Для зміни формату таблиці необхідно викликати на екрані панель
          інструментів Таблиці і межі, виділити рядки або стовпці, формат яких
          треба змінити. За допомогою панелі інструментів змінюється тип і
          товщина ліній, колір і тип кордонів, колір заливки та ін Для
          об'єднання елементів таблиці використовується пункт меню Об'єднати
          комірки. Для форматування таблиць використовується контекстне меню,
          попередньо виділивши необхідні рядки або стовпці. Для переміщення по
          таблиці використовується клавіша Tab (вперед) або Shift + Tab (назад),
          або клавіші управління курсором. Розмір осередків змінюють за
          допомогою перетягування кордонів.
        </p>
      </div>
      <div id="52">
        <h3>Локальна мережа. Визначення. Призначення.</h3>
        <p>
          Лока́льна комп'ю́терна мере́жа (англ. Local Area Network (LAN)) являє
          собою об'єднання певного числа комп'ютерів на відносно невеликій
          території. В порівнянні з глобальною мережею (WAN), локальна мережа
          зазвичай має більшу швидкість обміну даними, менше географічне
          покриття та відсутність необхідності використовувати запозичену
          телекомунікаційну лінію зв'язку. Локальна комп'ютерна мережа —
          комп'ютерна мережа для обмеженого кола користувачів, що об'єднує
          комп'ютери в одному приміщенні або в рамках одного підприємства.
        </p>
        <p>
          Завдання, які вирішують локальні мережі Локальні мережі вирішують такі
          задачі: Радіус дії обмежується невеликими географічними відстанями.
          Надає множинний доступ до спільного передавального середовища. Права
          користувача надаються локальним адміністратором. Надає постійний
          доступ до сервісів локальної мережі. Фізично з'єднує пристрої на
          невеликій відстані. Існують такі поширені реалізації локальних мереж:
          Ethernet — локальна мережа з шинною топологією і випадковим методом
          доступу. Token Ring — кільцева мережа з маркерним методом доступу.
          FDDI — технологія побудови комп'ютерних мереж, що використовує для
          передачі сигналу оптоволоконний кабель.
        </p>
        <p>
          У локальних мережах застосовують такі мережеві пристрої: Концентратори
          Комутатори Повторювачі Мости Маршрутизатори
        </p>
      </div>
      <div id="53">
        <h3>
          Поняття про комп'ютерні віруси та їх класифікація. Антивірусні
          програми та їх застосування. Профілактика зараження комп'ютерними
          вірусами.
        </h3>
        <p>
          Комп'ютерний вірус (англ. computer virus) — комп'ютерна програма, яка
          має здатність до прихованого самопоширення. Одночасно зі створенням
          власних копій віруси можуть завдавати шкоди: знищувати, пошкоджувати,
          викрадати дані, знижувати або й зовсім унеможливлювати подальшу
          працездатність операційної системи комп'ютера. Розрізняють файлові,
          завантажувальні та макро-віруси. Можливі також комбінації цих типів.
          Нині відомі десятки тисяч комп'ютерних вірусів, які поширюються через
          мережу Інтернет по всьому світу.
        </p>
        <p>
          Комп'ютерні віруси бувають чотирьох типів: Шкідник Знищувач Хробак
          Жарт Комбінований
        </p>
        <p>
          Шкідник Вірус шкідник — робить якусь шкоду користувачу аби
          роздратувати. Вірус шкідник може зробити наступні дії: Перемісити
          вказівник миші на протилежну сторону від справжньої Вимкнути мишу
          Вимкнути клавіатуру Заборонити постачання відео сигналу Відкривати
          програму без команди користувача Відкривати вкладку у браузері без
          команди користувача Тощо Знищувач Вірус який знищує: Системні файли
          Документи Утиліти Ігри Відеозаписи Музику Фотографії Драйвери Тощо
          Жарт Вірус-жарт — не завдає шкоди комп'ютеру, а просто лякає
          користувача. Хробак комп'ютерний — це саморозповсюджувана програма,
          яка може подолати всі три етапи розповсюдження самостійно (звичайний
          хробак), або використовує агента-користувача тільки на 2-му етапі
          (поштовий черв'як). Комбінований Комбінований — це поєднання двох або
          більше типів вірусів.
        </p>
        <p>
          Антивірусна програма (антивірус) — спеціалізована програма для
          знаходження комп'ютерних вірусів, а також небажаних (шкідливих)
          програм загалом та відновлення заражених (модифікованих) такими
          програмами файлів, а також для профілактики — запобігання зараження
          (модифікації) файлів чи операційної системи шкідливим кодом.
        </p>
        <p>
          Основні завдання Сканування файлів і програм в режимі реального часу
          Сканування комп'ютера за потребою Сканування інтернет-трафіку
          Сканування електронної пошти Захист від атак ворожих веб-вузлів
          Відновлення пошкоджених файлів
        </p>
      </div>
      <div id="54">
        <h3>
          Клієнт-серверна система. Призначення. Поняття клієнту та серверу.
        </h3>
        <p>
          Архітектура клієнт-сервер є одним із архітектурних шаблонів
          програмного забезпечення та є домінуючою концепцією у створенні
          розподілених мережних застосунків і передбачає взаємодію та обмін
          даними між ними. Вона передбачає такі основні компоненти: набір
          серверів, які надають інформацію або інші послуги програмам, які
          звертаються до них; набір клієнтів, які використовують сервіси, що
          надаються серверами; мережа, яка забезпечує взаємодію між клієнтами та
          серверами.
        </p>
        <p>
          Сервери є незалежними один від одного. Клієнти також функціонують
          паралельно і незалежно один від одного. Немає жорсткої прив'язки
          клієнтів до серверів. Більш ніж типовою є ситуація, коли один сервер
          одночасно обробляє запити від різних клієнтів; з іншого боку, клієнт
          може звертатися то до одного сервера, то до іншого. Клієнти мають
          знати про доступні сервери, але можуть не мати жодного уявлення про
          існування інших клієнтів.
        </p>
        <p>
          уже важливо ясно уявляти, хто або що розглядається як «клієнт». Можна
          говорити про клієнтський комп'ютер, з якого відбувається звернення до
          інших комп'ютерів. Можна говорити про клієнтське та серверне програмне
          забезпечення. Нарешті, можна говорити про людей, які бажають за
          допомогою відповідного програмного та апаратного забезпечення отримати
          доступ до тієї чи іншої інформації. Загальноприйнятим є положення, що
          клієнти та сервери — це перш за все програмні модулі. Найчастіше вони
          знаходяться на різних комп'ютерах, але бувають ситуації, коли обидві
          програми — і клієнтська, і серверна, фізично розміщуються на одній
          машині; в такій ситуації сервер часто називається локальним.
        </p>
      </div>
      <div id="55">
        <h3>
          Вкорінені та зв'язані об'єкти слайдів комп'ютерної презентації.
          Способи демонстрації слайдів. Приклади.
        </h3>
        <p>
          Презентація — це набір слайдів, де є текст, графічні об'єкти, рисунки,
          кнопки тощо. Презентація може містити звук, відео та анімацію.
        </p>
        <p>
          Зв'язаний об'єкт — це об'єкт, створений у вихідному файлі та
          вставлений у кінцевий файл із підтриманням зв'язку між цими двома
          файлами. Зв'язаний об'єкт у кінцевому файлі може бути оновлений у разі
          оновлення вихідного файла. Зв'язані дані зберігаються у вихідному
          файлі. Кінцевий файл •зберігає лише відомості про розташування
          вихідного файла та ві­дображує подання зв'язаних даних. Використовуйте
          зв'язані об'єкти, коли має значення розмір файла.
        </p>
        <p>
          Впроваджений (вкорінений) об'єкт— це дані (об'єкт), які міс­тяться у
          вихідному файлі та вставлені в кінцевий файл. Після впровадження
          об'єкт стає частиною кінцевого файла. Зміни, які вносяться до
          впровадженого об'єкта, відбиваються на кінцевому файлі. -
          Відрізняються такі об'єкти один від одного, головним чином, місцем
          зберігання даних і способом оновлення даних після встановлення об'єкта
          в кінцевий файл. Якщо об'єкт є впровадженим, дані в кінцевому файлі не
          змі­нюються, коли'змінюється вихідний файл. Після встановлення
          впроваджені об'єкти перестають належати до вихідного файла.
        </p>
        <p>
          Кінцевий файл — це файл, в який вставлено зв'язаний або впроваджений
          об'єкт. Вихідний файл містить дані, які викори­стовуються для
          створення цього об'єкта. У разі зміни даних у кінцевому файлі у
          вихідному файлі вони не змінюються.. Вкорінені та зв'язані об'єкти
          використовуються для додаван­ня до файлів інших файлів (або частин
          файлів), створених у про­грамах Місго5оЛ Ойісе або в будь-яких інших
          програмах, які під­тримують зв'язування та впровадження об'єктів.
          Створення зв'язаного або впровадженого об'єкта з частини на­явного
          файла: 1. Відкрийте файл із даними, які будуть застосовані для
          ство­рення зв'язаного або впровадженого об'єкта, а потім виділіть
          потрібні дані. 2. На панелі інструментів Стандартна натисніть кнопку
          Ко­піювати або Вирізати. 3. Перейдіть до файла, в який необхідно
          помістити дані, а по­тім клацніть те місце, в якому ці дані повинні
          відображуватися. 4. У меню Змінити виберіть команду Спеціальна вставка
          . 5. Виконайте одну з таких дій.
        </p>
        <p>
          Оскільки презентації слугують для зацікавлення слухачів ілю­страціями
          та ефектами під час доповіді, для рекламування пос­луг, продуктів
          тощо, то важливим, окрім її створення, є і вміння її продемонструвати.
          Їх демонструють на екрані монітора чи на великому екрані у залі за
          допомогою спеціального обладнання. Перед демонстрацією треба задати
          додаткові ефекти демонст­рації командою Вигляд — Перехід слайдів, а
          також спосіб зміни слайдів на екрані за допомогою клацання миші чи
          автозміною за фіксований проміжок часу. Запуск демонстрації виконують
          командою Показ слайдів/По­чати показ або перейшовши в режим перегляду
          слайдів за допомогою кнопки, яка є внизу екрана. Потрібно стежити, щоб
          перед переглядом активним був перший слайд. У режимі демонстрації
          слайди можуть з'являтися внаслідок клацання кнопкою миші будь-де на
          слайді (якщо не задано авто-перехід). Керувати процесом демонстрації
          можна також за допо­могою меню стандартної кнопки керування, яка є у
          лівому ниж­ньому кутку слайда (але це незручно). Якщо користувача не
          за­довольняють можливості стандартної кнопки, він має змогу створити
          на слайді свої кнопки керування. Для створення кно­пок є команда
          Керуючі кнопки в меню Показ слайда. Після вибору кнопки із
          запропонованого меню її треба налаштувати для реагу­вання на подію
          клацання миші або на вказівник миші. Кнопці можна назначити дію
          переходу: на наступний слайд, на поперед­ній, на перший, на осіянній,
          на заданий, замнчиьі демонстра­цію, запустити деяку іншу програму.
          Перехід можна супроводжу­вати звуковими ефектами. Також під час показу
          слайдів можна застосувати ефект «При­хований слайд», який дає
          можливість підготувати деякі додаткові презенташйні матеріали, які
          можуть бути використані або про­пущені у демонстрації залежно від
          зацікавленості та реакції аудиторії. Одну і ту саму презентацію можна
          адаптувати для різних аудиторій, створивши довільний показ. Довільний
          показ — це слайди, згруповані у презентацію, які можна демонструвати
          незалежно від усього показу, або групи слайдів у презентації, на які
          виконано гіперпосилання.
        </p>
      </div>
      <div id="56">
        <h3>Застосування GRID систем. Недоліки.</h3>
        <p>
          Грід-обчислення — це сукупність комп'ютерних ресурсів з декількох
          місць для досягнення спільної мети. Сітка може розглядатися як
          розподілена система з неінтерактивних робочих навантажень, які
          включають в себе велику кількість файлів. Сітка обчислень
          відрізняється від звичайних високопродуктивних обчислювальних систем,
          таких як кластерних обчислень тим, що сітки комп'ютерів мають кожен
          вузол налаштований на виконання іншої задачі / програми. Комп'ютерні
          сітки також мають тенденцію бути більш різнорідними і географічно
          розосереджені (таким чином, не фізичні в поєднанні), ніж кластерних
          комп'ютерів. Незважаючи на те, одна сітка може бути присвячена певній
          програмі, зазвичай сітка використовується для різних цілей. Сітки
          часто будуються з загального призначення бібліотеки сітки проміжного
          програмного забезпечення. Розміри сітки може бути досить великим.[1]
        </p>
        <p>
          Ґрід є формою розподілених обчислень, в якому багато комп'ютерів
          об'єднані в один потужний віртуальний комп'ютер, і які працюють разом
          для виконання трудомістких завдань. Для деяких застосувань, «ґрід»
          обчислення можна розлядати як спеціальний тип паралельних обчислень
          які покладаються на цілі комп'ютери(обладнані процесорами, пам'ятю,
          живленням, мережевим інтерфейсом і тд.), під'єднані до комп'ютерної
          мережі(приватної або публічної) звичайним мережевим інтерфейсом, таким
          як Ethernet. Це все відрізняє від традиційного поняття
          суперкомп'ютера, який має багато процесорів, з'єднаних локальною
          високошвидкісною комп'ютерною шиною.
        </p>
        <p>
          Грід-обчислення об'єднує комп'ютери з кількох адміністративних доменів
          для досягнення спільної мети, щоб вирішити одну задачу, а потім може
          зникнути так само швидко. Однією з основних стратегій розподілених
          обчислень є використання проміжного програмного забезпечення, щоб
          розділити і розподілити частини програми між декількома комп'ютерами,
          іноді до багатьох тисяч. Грід-обчислення включає обчислення в
          розподіленому режимі, який також може включати агрегацію
          великомасштабних кластерів. Розмір сітки може варіюватися від
          невеликих обмежується мережею комп'ютерних робочих станцій в межах
          корпорації, наприклад, у великих, громадських співпраці з багатьох
          компаній і мереж. "Поняття обмеженою сітки може бути також відомо як
          співпраця Intra-вузлів у той час як поняття більшої, ширшої мережі
          таким чином, може ставитися до співпраці інтер-вузлів".[2] Сітки є
          однією з форм розподілених обчислень відповідно до якого "супер
          віртуальний комп'ютер" складається з безлічі мережевих слабозв'язаних
          комп'ютерів, що діють разом для виконання дуже великі завдання. Ця
          технологія була застосована для інтенсивних обчислень наукові,
          математичні та наукові проблеми за допомогою добровольця обчислень, і
          він використовується в комерційних підприємствах для таких
          різноманітних застосувань, як створення ліків, економічне
          прогнозування, аналіз сейсмічних даних і назад обробки даних в офісі
          підтримки e-комерції та веб-сервісів. Координаційні додатки на сітках
          може бути складним завданням, особливо при координації потоку
          інформації в розподілених обчислювальних ресурсів. Системи
          документообігу сітки були розроблені як спеціалізована форма системи
          управління робочими процесами, розроблена спеціально для створення і
          виконати ряду кроків обчислювальної або дані маніпуляції, або робочий
          процес, в контексті Grid.
        </p>
      </div>
      <div id="57">
        <h3>
          Етапи розв'язування задачі з використанням комп'ютера. Поняття
          інформаційної моделі задачі.
        </h3>
        <p>
          Розв’язання задач в будь-якій сфері діяльності – це завжди отримання
          деяких результатів. А процес отримання результатів спирається на
          деякий спосіб дій і пропонує використання визначених засобів. Одним із
          нових засобів розв’язання різних задач стають сучасні комп’ютери –
          універсальні пристрої опрацювання і накопичування даних.
          Універсальність комп’ютерів полягає в тому, що вони можуть
          опрацьовувати будь-які дані і розв’язувати задачі в будь-якій
          предметній області.
        </p>
        <p>Розв’язання задачі на комп’ютері проходить в декілька етапів.</p>
        <p>1-й етап – постановка задачі.</p>
        <p>2 -й етап – розробка математичної моделі.</p>
        <p>
          3- й етап – конструювання. На основі математичної моделі конструюється
          алгоритм. Про поняття алгоритму і його властивостях і способи
          конструювання ми будемо вивчати на наступних уроках. А тут даний етап
          виконаємо для нашої задачі без детальних пояснень.
        </p>
        <p>
          4- й етап – перевід алгоритму в програму. Дальше дослідження
          інформаційної моделі, записаної у вигляді алгоритму, можна проводити
          різними способами. Можна закодувати алгоритм на мові програмування або
          використати спеціальні програмні додатки.
        </p>
        <p>
          5- й етап розв’язування задачі полягає в проведенні комп’ютерного
          експерименту. Якщо ми досліджуємо інформаційну модель у вигляді
          програми в деякому середовищі програмування, то до цього етапу
          відносяться: завантаження вибраного середовища програмування; набір
          тексту програми; збереження цього тексту на диску; запуск програми на
          виконання. Причому необхідно запускати програму на виконання декілька
          разів – при різних значеннях початкових умов. Можна скористатись і
          готовими програмними засобами. Так, наприклад, якщо інформаційна
          модель досліджується в електронних таблицях, то різні числові дані
          вводяться у відповідні комірки.
        </p>
        <p>
          6- й етап полягає в аналізі отриманих результатів і корегуванні
          досліджуваної моделі. Для нашої задачі очевидно, що по-перше, доцільно
          отримати значення координат для послідовності моментів часу і
          по-друге, немає фізичного сенсу обчислення координат тіла після його
          падіння на поверхню землі.
        </p>
      </div>
      <div id="58">
        <h3>Текстовий редактор WORD. Призначення.</h3>
        <p>
          Microsoft Word (повна назва Microsoft Office Word, MS Word, WinWord
          або просто Word, укр. Слово) — текстовий процесор, що випускається
          фірмою Майкрософт, входить до складу офісного пакету «Microsoft
          Office». Перша версія, «Multi Tool Word», була написана для Xenix
          [3][4][5] і перенесена під DOS у 1983 році. Пізніше створено версії
          для Apple Macintosh (1984), Microsoft Windows (1989), SCO UNIX, OS/2.
        </p>
        <p>
          Назначение и возможности: • Создание и редактирование текстовых
          документов с использованием большого выбора шрифтов и стилей текста. •
          Оформление текстовых документов (создание заголовков, оглавления,
          колонтитулов, формирование предметного указателя, расстановка
          переносов, расположение текста на странице; настройка шрифтов и
          параметров абзаца, а также создание текстовых документов с
          использованием различных шаблонов (как системных, так и
          пользовательских), предназначенных специально для соответствующего
          оформления документа). • Вставка в текст требуемых элементов
          (специальных символов, рисунков, примечаний, гиперссылок, сносок и т.
          п.) • Работа с блоками текста (копирование, вставка, перемещение
          фрагментов текста с использованием возможностей буфера обмена). •
          Представление некоторых фрагментов текстового документа в виде
          таблицы, созданной в соответствии с заданными параметрами. • Настройка
          параметров представления текстового документа. • Просмотр статистики
          документа (количество страниц текстового документа, количество
          символов в документе, количество абзацев и др.). • Автоматическая
          проверка формируемого документа на наличие в нем грамматических,
          стилистических и т. п. ошибок с возможностью оперативного их
          устранения • Создание рисунков с использованием специально
          предназначенной функциональности. • Сохранение сформированного
          документа в разных форматах. • Вывод на печать готового текстового
          документа (при необходимости – предварительный просмотр документа
          перед его распечаткой).
        </p>
      </div>
      <div id="59">
        <h3>
          Виконання обчислень у середовищі табличного процесора. Використання
          логічних функцій та операцій для опрацювання даних, поданих у таблиці.
          Приклади.
        </h3>
        <p>
          Уведення формул аналогічне до введення текстів. Під час уведення
          формул потрібно дотримуватись наступних правил: – Для позначення
          математичних дій використовуються такі оператори: + – додавання; – –
          віднімання; * – множення; / – ділення; ^ – піднесення до степеня; % –
          знаходження відсотків; – У формулах не можна пропускати оператор
          множення, як іноді записують в зошити з математики; – Пріоритет
          операцій збігається з порядком виконання операцій, прийнятим у
          математиці, за окремими винятками; – Операція знаходження протилежного
          числа має вищий пріоритет, ніж операція піднесення до степеня. – Для
          обчислення відсотків від числа потрібно виконати множення числа на ці
          відсотки, увівши у формулу після кількості відсотків знак %; – Для
          змінення порядку виконання дій використовують круглі дужки; – Формулу
          потрібно записувати у вигляді рядка символів (так званий лінійний
          запис виразу);
        </p>
        <p>
          Електронна таблиця для обчислення значення функції у = 2х + 5 Для
          заповнення рядку значень х використайте маркер автозаповнення. Для
          цього введіть в першу клітинку-10 – вказівником миші натисніть на знак
          маркеру авто заповнення (хрестик чорного кольору) – утримуючи ліву
          клавішу миші протягніть на потрібну кількість клітинок – в меню, що
          з’явиться, оберіть пункт Заповнити В клітинку В2 введіть
          формулу=2*В1+5. Потім аналогічно з попереднім пунктом, використовуючи
          маркер автозаповнення, скопіюйте формулу вправо на потрібну кількість
          клітинок.
        </p>
      </div>
      <div id="60">
        <h3>
          Використання різних форматів зберігання даних. Вказати який формат для
          зберігання яких даних використовується. DOC, JPG, PDF, HTML, AVI, PAS.
        </h3>
        <p>
          Такие файлы содержат исходный код, написанный на одном из двух похожих
          языков программирования: Pascal или Object Pascal.
        </p>
      </div>
      <div id="61">
        <h3>
          Етапи розвитку обчислювальної техніки та галузі застосування
          комп'ютерів.
        </h3>
        <p>
          Перше покоління ЕОМ. У машинах цього покоління (сорокові роки XX ст.)
          використовувалися електронно-вакуумні лампи як основні елементи
          електронних схем. Лампи, в основному, замі­нили електромеханічні реле,
          тому швидкодія обчислювальних машин значно зросла. Першою потужною ЕОМ
          такого роду була ЕНІАК (США). Однак у ній, як і в інших перших ЕОМ,
          був сер­йозний недолік — програма, що виконувалась, не зберігалася в
          пам'яті машини, а набиралася у складний спосіб за допомогою зовнішніх
          перемичок. У 1945 р. з'явилася відома робота матема­тика фон Неймана,
          у якій він сформулював загальні принципи роботи обчислювальних
          пристроїв. Усі наступні ЕОМ створюва­лися з використанням цих
          принципів, згідно з якими програма мала зберігатися в пам'яті машини.
          Характерними рисами ЕОМ 1-го покоління є застосування електронних ламп
          у цифрових схемах, великі габарити, а також трудомісткий процес
          програмуван­ня.
        </p>
        <p>
          Друге покоління ЕОМ. Коли в середині 50-х років на зміну електронним
          лампам прийшли напівпровідникові прилади, то ЕОМ почали переводити на
          напівпровідники. Напівпровіднико­ві (транзистори, діоди) були значно
          компактніші від електрона них ламп, мали більший термін служби і
          споживали набагато менше енергії. Найпоширенішими машинами 2-го
          покоління були «Еліот» (Англія), «Сіменс» (ФРН), «Стретч» (США). У
          СРСР були розроблені і широко використовувалися «Раздан-2», серія
          машин «Минск», «Урал», «Наири», «Мир». Найдоскона­лішою машиною цього
          покоління була БЭСМ-6, що виконувала понад 1 млн операцій за секунду.
          ЕОМ 2-го покоління вирізня­ються застосуванням напівпровідникових
          елементів і використан­ням алгоритмічних мов програмування.
        </p>
        <p>
          Третє покоління ЕОМ. Чергова зміна поколінь ЕОМ відбулася наприкінці
          60-х років під час заміни напівпровідникових прила­дів у пристроях ЕОМ
          на інтегральні схеми. Інтегральна схема (мікросхема) — це невелика
          пластинка кристалу. кремнію, на якій уміщаються сотні і тисячі
          транзисторів, діодів, конденсато­рів тощо. Застосування інтегральних
          схем дало змогу збільшити кількість електронних елементів в ЕОМ без
          збільшення реальних розмірів машин. Швидкодія ЕОМ зросла до 10 млн.
          операцій за секунду. Характерними рисами ЕОМ третього покоління є
          засто­сування інтегральних схем і можливість використання розвинутих
          мов програмування (мов високого рівня).
        </p>
        <p>
          Четверте покоління ЕОМ. З удосконаленням мікросхем збіль­шувалася їхня
          надійність і щільність розміщених у них елемен­тів. В основі ЕОМ
          четвертого покоління лежать великі інтеграль­ні схеми (ВІС). У цих
          схемах на 1см2 приходиться кілька десятків тисяч елементів. Завдяки
          ВІС стало можливим на одному ма­лесенькому кристалі кремнію розмістити
          таку велику електронну схему, як процесор ЕОМ. Однокристальні
          процесори згодом стали називати мікропроцесорами. Перший мікропроцесор
          був створений компанією Іпtel (США) у 1971 р. Мікропроцесори
          спричинили появу міні-ЕОМ, а потім і персональних комп'ютерів. ЕОМ
          4-го покоління характеризуються застосуван­ням мікропроцесорів,
          побудованих на великих інтегральних схемах.
        </p>
        <p>
          П'яте покоління ЕОМ. Починаючи із середини 90-х років, у потужних
          комп'ютерах починають застосовуватися ВІСсупер-масштабу. Багато
          фахівців почали говорити про комп'ютери 5-го покоління. Гадають, що
          обчислювальними машинами 5-го поко­ління можна буде легко керувати —
          користувач зможе просто го­лосом подавати машині команди. Характерною
          рисою комп'ютерів п'ятого покоління має бути використання штучного
          інтелекту і природних мов спілкування.
        </p>
        <p>
          Основні галузі застосування коми 'ютерів такі: • Обробка інформації з
          великою швидкістю і точністю; • Збереження великого об'єму
          різноманітної інформації; • Створення місцевих і глобальних мереж
          передачі інфор­мації; • Доставка інформації споживачу на будь-яку
          відстань.
        </p>
      </div>
      <div id="62">
        <h3>
          Багаторівневі системи програмування в сучасних обчислювальних
          системах. Вказати рівні програмування.
        </h3>
        <p>
          БАГАТОРІВНЕВА СТРУКТУРА ЕОМ — репрезентація електронної обчислювальної
          машини (взагалі обчислювальної системи) як складної системи з
          декомпозицією її структури на певну кількість їєрархічних рівнів з
          метою спрощення процесів аналізу та синтезу.
        </p>
        <p>
          Розробка обчислювальної частини ЕОМ ведеться зазвичай на наступних
          рівнях: архітектурний рівень — розробка загальної концепції
          обчислювальної машини, системи команд процесора і його програмної
          моделі, визначення інформаційних потоків між процесорами, ієрархією
          запам’ятовуючих пристроїв, пристроями вводу-виводу. Визначення
          стандартів в обчислювальній підсистемі й підсистемі вводу-виводу
          рівень регістрових пересилань — конкретизація інформаційної й керуючої
          частин обчислювальної системи в термінах регістрів, обчислювальних
          операцій, потоків даних та управління і операцій пересилання даних між
          регістрами. логічний рівень — подання структур ЕОМ у вигляді набору
          логічних вентилів і зв'язків між ними. Поведінка системи описується в
          термінах алгебри логіки (для комбінаційних схем), таблиць переходів
          (для схем з пам'яттю). електричне або схемний рівень — подання ЕОМ у
          вигляді набору електричних схем. Поведінка машини описується законами
          електротехніки.
        </p>
      </div>
      <div id="63">
        <h3>
          Використання різних типів об'єктів (текстових, графічних, числових,
          звукових, відео) для створення презентації. Приклади.
        </h3>
        <p>
          Слайди є складними об'єктами, які монтує користувач. Слайд може
          містити елементи таких трьох основних типів: 1) кадри з текстовою
          інформацією; 2) мультимедійні об'єкти: картинки,, звук, відео; 3)
          кнопки керування процесом демонстрації.
        </p>
        <p>
          Слайди, що містять текстову інформацію, можуть мати заго­ловок і
          основний текст. Найчастіше основний текст подають у вигляді маркованих
          списків, де висвітлюють пункти, план чи го­ловні ідеї доповіді,
          ставлять запитання (відповіді на них дають усно) тощо. На окремих
          слайдах подають номери телефонів, назви й адреси фірм тощо. Щоб увести
          текст, клацають у потріб­ному місці слайда і набирають текст на
          клавіатурі.
        </p>
        <p>
          До слайда можна додавати текст чотирьох типів: • Текст у рамці; •
          Текст в автофігурах; • Текст у написах; • Текст WordArt
        </p>
        <p>
          У слайди можна помістити різні об'єкти: рисунки, організа­ційні
          діаграми, фотографії з графічних файлів (за допомогою ко­манди Малюнок
          у меню Вставка); діаграми та таблиці з ЕхсеІ, креслення, створені
          засобами AutoCad, документи та рисунки Microsoft Word, заготовки
          таблиць Word (за допомогою меню Вставка/Об'єкт та Тип об'єкта); ефекти
          WordArt, а також еле­менти мультимедіа: відеокліпи, звукові кліпи з
          файлів чи дикт­орські тексти, які, зокрема, вставляють командами
          Вставити — Кіно і звук — Звук з файла чи Записати звук. До об'єктів
          застосо­вують ефекти анімації з запропонованого програмою меню.
        </p>
        <p>
          Якщо тлом має бути пейзаж чи деяка картинка, то у слайд вставляють
          відповідний графічний об'єкт з файла (відскановану фотографію тощо')
          збільшують ного до рочміпів слайда і посила­ють на задній план.
        </p>
        <p>
          Для окремого слайда можна записати та відтворити звуковий супровід або
          примітку. Для цього: 1. Відкрийте слайд, до якого потрібно додати звук
          або звуко­ву примітку. 2. У меню Вставка виберіть команду Фільми та
          звуки, а потімЗаписати звук. 3. Щоб записати звук або звукову
          примітку, натисніть кноп­ку Запис. 4. Після закінчення запису
          натисніть кнопку Зупинити. 5. У полі Назва введіть назву звуку та
          натисніть кнопку ОК. 6. На слайді з'явиться значок звуку.
        </p>
        <p>
          До слайда додають фільми або анімовані малюнки GIF. Фільми — це фонові
          файли відео у форматі AVI,МРЕG, які мають розширення AVI,МОV, QТ, МРG
          і МРЕg. Анімований файл формату завжди має розширення GIF.
        </p>
      </div>
      <div id="64">
        <h3>
          Транслятор. Призначення. Відмінність компілятора від інтерпретатора.
          Переваги, недоліки
        </h3>
        <p>
          для перекладу тексту програми на мову, зрозумілу комп’ютеру, повинна
          існувати окрема програмна оболонка – транслятор.
        </p>
        <p>
          Означення Трансляція – перетворення програми, представленої на
          якій-небудь мові програмування в еквівалентну форму на іншій мові.
        </p>
        <p>Транслятори бувають двох видів: компілятори й інтерпретатори.</p>
        <p>
          Компілятор перетворює початковий (вихідний) код програми в машинну
          мову, тобто мову нулів і одиниць. До отриманого коду підключаються
          стандартні процедури, використані програмістом. У результаті виходить
          працююча програма – її називають робочим кодом. Файли таких програм
          мають розширення .ехе або .com і представляють собою машинний код.
          Компілятор – тип транслятора, що виконує перетворення всієї програми
          цілком з якої-небудь мови програмування на мову машинних кодів
          (абсолютний модуль) або близький до нього (об’єктний модуль).
        </p>
        <p>
          Інтерпретатори обробляють текст не заздалегідь, а безпосередньо під
          час виконання програми. Інтерпретатори є програмами-посередниками, які
          читають команди з файлу і перекладають їх на мову процесора під час
          виконання програми. Інтерпретатор – тип транслятора, що здійснює
          покомандний (порядковий) переклад і виконання програми, написаної на
          якій-небудь мові програмування.
        </p>
        <p>
          Щоб краще зрозуміти відмінність між компілятором і інтерпретатором,
          приведемо порівняння. Робота програми-компілятора схожа на роботу
          літературного перекладача, який спочатку прочитує текст, аналізує
          його, а потім виконує переклад. Роботу програми інтерпретатора можна
          порівняти з роботою синхронного перекладача, який виконує переклад
          відразу в міру озвучування тексту. Зрозуміло, що літературний переклад
          буде більш якісним, ніж переклад синхронний. Аналогічно код, отриманий
          при компіляції, буде більш компактний і ефективним, ніж код
          інтерпретатора. У результаті відкомпільовані програми працюють у 20-50
          разів швидше, ніж виконувані під керуванням інтерпретатора. Крім того,
          компілятори під час своєї роботи займають меншу частину ресурсів
          комп’ютера.
        </p>
        <p>
          Таким чином, компілятори – більш ефективні перекладачі програм. Тому
          всі прикладні і службові програми поставляються у відкомпільованому
          вигляді.
        </p>
        <p>
          У випадках, коли час виконання програми не занадто критичний,
          наприклад, при навчанні, зручно використовувати мову, що
          інтерпретується. Найпростіша і найбільш розповсюджена з них – це мова
          програмування Basic. Іншими прикладами є такі мови, що інтерпретуються
          JavaScript і VBScript, що широко використовуються при створенні
          Web-сторінок, доступних через Інтернет.
        </p>
      </div>
      <div id="65">
        <h3>
          Поняття програми. Поняття про системи програмування. Поняття про
          інтерпретацію та компіляцію програми.
        </h3>
        <p>
          Програма — це упорядкований список команд, написаних мо­вою
          програмування і призначених для виконання на комп'ютері. Отже, процес
          роботи комп'ютера полягає у виконанні програми, тобто набору цілком
          певних команд, що надходять у цілком певнЬму порядку. Машинний код
          команди, що складається з ну­лів та одиниць, указує, яку саме дію має
          виконати ЦП. Отже, щоб задати комп'ютеру послідовність дій, які він
          має виконати, треба задати послідовність двійкових кодів відповідних
          команд. Програми в машинних кодах містять у собі тисячі команд.
          Писа­ти такі програми — дуже складна справа". Програмісту для цього
          раніше слід було пам'ятати не тільки комбінацію нулів та оди­ниць
          двійкового коду кожної команди, але й двійкові коди адрес даних, що
          використовуються під час виконання.
        </p>
        <p>
          Разом з тим, для того щоб комп'ютер міг виконувати програ­му, її
          потрібно перекласти на машинну мову. Для такого пере­кладу
          використовують спеціальні програми-транслятори. Транслятор — це
          програма, яка призначена для перекладу тексту програми' з однієї мови
          програмування на іншу мову. Процес перекладання називається
          трансляцією.
        </p>
        <p>
          Розрізняють два типи трансляторів — компілятори та інтер­претатори.
        </p>
        <p>
          Компілятор — це програма, що призначена для перекладу програми, яка
          написана деякою мовою, в програму в машинних кодах. До отриманого коду
          підключаються стандартні процеду­ри, використані програмістом. У
          результаті дістанемо файли працюючих програм з розширеннями .ехе чи
          .сот. Процес такого перекладання називається компіляцією.
        </p>
        <p>
          Компілятор створює кінцевий результат — програму в ма­шинних кодах,
          яка потім виконується. Скомпільований варіант програми можна зберігати
          на диску. Для повторного виконання програми компілятор вже не
          потрібен. Досить завантажити з диска в пам'ять комп'ютера
          скомпільований перед цим варіант і виконати його. Крім того,
          компілятори під час своєї роботи ви­користовують і частину ресурсів
          комп'ютера. Тому всі прикладні й службові рами поставляються у
          відкомпільованому вигляді. Мови, для яких існують
          програми-компїлятори, — це компі­льовані мови Разсаі, С++, Оеірпі,
          РоЛгап та інші.
        </p>
        <p>
          Інтерпретатор — це програма, яка призначена для поко-мандних
          трансляцій та виконання вихідної програми. Такий процес називається
          інтерпретацією.
        </p>
        <p>
          У процесі трансляції відбувається перевірка вихідної програ­ми на
          відповідність правилам мови, яка використовується для її описування.
          Якщо в програмі знайдено помилки, транслятор ви­водить повідомлення
          про них на пристрій виведення (як прави­ло, на екран дисплея).
        </p>
        <p>
          Інтерпретатор повідомляє про знайдені помилки після транс­ляції кожної
          команди програми. Це значною мірою полегшує процес пошуку та
          виправлення помилок у програмі, але суттєво збільшує час трансляції.
          Компілятор транслює програму набага­то швидше, ніж інтерпретатор, але
          повідомляє про знайдені ним помилки після завершення компіляції всієї
          програми. Знайти та виправити помилки у цьому випадку важче. Через це
          інтерпрета­тори розраховані, в основному, на мови, що призначені для
          нав­чання програмуванню, і використовуються
          програмістами-по-чатківцями. Найпростіша й найпоширеніша — це мова
          програ­мування Ваsіс. Іншими прикладами є і мови JavaSkript і
          VBSkript, які широко використовуються при створенні Web-сторінок,
          доступних через Інтернет.
        </p>
      </div>
      <div id="66">
        <h3>Редактор зв’язків. Призначення. Вхідна і вихідна інформація.</h3>
        <p>
          Компонувальник (також редактор зв'язків, лінкер — від англ. Link
          editor, linker) — програма, яка виконує компонування (англ. linking) —
          приймає на вхід один або кілька об'єктних модулів і збирає їх в один
          виконуваний модуль.
        </p>
        <p>
          Для зв'язування модулів компонувальник використовує таблиці імен
          ідентифікаторів, створені компілятором в кожному з об'єктних модулів.
          Такі імена можуть бути двох типів: Певні або експортовані назви
          функцій та змінних, визначені в даному модулі і надані для
          використання іншим модулям Невизначені або імпортовані імена — функції
          та змінні, на які посилається модуль, але не визначає їх в середині
          себе Робота компонувальника полягає в тому, щоб в кожному модулі
          конкретизувати посилання на невизначені імена. Для кожного
          імпортованого імені, визначення якого перебуває в інших модулях,
          згадування імені замінюється на його адресу.
        </p>
        <p>
          До вхідної інформації відносять дані, що необхідні для розв'язання
          аналітичних задач (наприклад, наявність основних засобів, кількість і
          склад працівників). Вхідна інформація реєструється в місці її збирання
          чи виникнення і вводиться в ПЕОМ без попередньої обробки. Вхідна
          первинна інформація є найбільш детальною і становить основу для
          наступної логічної та арифметичної обробки даних. До вхідної
          інформації може належати не лише змінна, а й умовно-постійна та
          постійна інформація за особливо великої ролі умовно-постійної. Вихідна
          інформація є підсумком обробки вхідних даних, але вона містить поряд з
          результатною інформацією і певні первинні дані. Спеціального значення
          набуває проміжна інформація, яка потрібна для розв'язування тих самих
          задач у наступних періодах. Результатні дані в багатьох випадках
          архівуються й накопичуються у базі даних для розв'язування інших
          взаємозв'язаних задач, для вивчення динаміки показників чи процесів.
        </p>
      </div>
      <div id="67">
        <h3>
          Створення запитів, форм і формування звітів при роботі з базами даних.
          Приклади.
        </h3>
        <p>
          Запити є одним із основних інструментів опрацювання даних в СУБД, він
          дає змогу вибрати дані із однієї чи кількох взаємо­пов'язаних таблиць,
          провести обчислення та одержати результат у вигляді таблиці, поновити
          дані в таблиці, подати чи вилучити із неї записи.
        </p>
        <p>СУБД МS Ассеss дає змогу створювати кілька видів запитів:</p>
        <p>
          1. Запит на вибірку, за допомогою якого можна із взаємо­пов'язаних
          таблиць та заздалегідь створених запитів вибрати дані. 2. Запит на
          створення таблиці будується на основі запиту на вибірку і результати
          зберігаються у новій таблиці. 3. Запити на оновлення, додавання,
          вилучення даних відносяться до запитів дій, в результаті виконання
          яких змінюються дані в таблицях. 4. Перехресні запити відображають
          результати статистичних розрахунків, виконаних по даним з одного поля.
          5. Запит з параметром.
        </p>
        <p>
          Створення запиту на вибірку. Припустимо, що вас цікавить така
          інформація: які крайні брали участь в олімпіаді ;а скільки спортсменів
          від кожної країни було представлено. Очевидно, що такий запит має бути
          підготовлений на основі таблиць Країни та Спортсмени.
        </p>
        <p>
          • Відкрийте вікно бази даних і клацніть по вкладці Запроси. У діалозі,
          що з'явиться, виберіть позицію Простойзапрос. • У подальших діалогах
          вибрати таблиці, на основі яких ство­рюватиметься запит, і вказати
          поля, що будуть присутні взапиті. • В останньому діалозі залишіть
          установленим перемикач Подробний (виведення кожного поля кожного
          запису) і клацніть по кнопці Готово.
        </p>
        <p>
          Форма — це об'єкт бази даних, в якому її розробник розміщує елементи
          управління для прийняття дій користувача для введен­ня, відображення
          та зміни в полях. Форми використовуються у БД для введення даних в
          таблицю; відкриття інших форм чи зві­тів та вибору, перегляду та
          друкування звіту. Форма завжди створюється на базі таблиці або запиту,
          що створює зв'язок між формою і відповідною таблицею, однією чи
          кількома, який дає змогу переносити їх до відповідних таблиць після
          введення або зміни. У СУБД МS Ассеss можна працювати з формами в двох
          режи­мах: режимі форми та режимі конструктора форми.
        </p>
        <p>
          Залежно від призначення та елементів, які містяться у формі,
          розрізняють: кнопкові, стрічкові, табличні, стовчикові форми та форми
          з діаграмою. Звіти призначаються для відображення даних, які
          організую­ться та форматуються відповідно до потреб користувача. За
          до­помогою звітів складаються комерційні зведення, списки теле­фонів
          або списки розсилки. Звіт — ефективний засіб для організації даних при
          виведені на друк. За допомогою звіту можна вивести необхідні відомості
          в потрібному вигляді. Більшість інформації у звіті вибирається із
          базової таблиці чи запиту, який є для нього джерелом даних. Інша
          інформація вводиться при розробці звіту.
        </p>
        <p>
          Користувач має змогу розробити звіт самостійно або створити його за
          допомогою майстра. Після виклику майстра виводяться діалогові вікна із
          запрошенням ввести необхідні дані, і звіт ство­рюється на основі
          відповідей користувача. Далі користувачеві дозволяється перейти до
          режиму конструктора та внести зміни до стандартного створеного звіту.
        </p>
        <p>
          Простий звіт містить всі поля і записи із базової таблиці чи запиту.
          При цьому можна розташувати по-різному поля: стовп­чиком, рядком.
        </p>
      </div>
      <div id="68">
        <h3>
          ?Види модулів. Програми, що беруть участь в перетворенні модулів
        </h3>
        <p>
          Мо́дульное программи́рование — это организация программы как
          совокупности небольших независимых блоков, называемых модулями,
          структура и поведение которых подчиняются определённым правилам.[1]
          Использование модульного программирования позволяет упростить
          тестирование программы и обнаружение ошибок. Аппаратно-зависимые
          подзадачи могут быть строго отделены от других подзадач, что улучшает
          мобильность создаваемых программ.
        </p>
        <p>
          Мо́дуль — функционально законченный фрагмент программы. Во многих
          языках (но далеко не обязательно) оформляется в виде отдельного файла
          с исходным кодом или поименованной непрерывной её части. Некоторые
          языки предусматривают объединение модулей в пакеты.
        </p>
        <p>
          Принцип модульности является средством упрощения задачи проектирования
          ПС и распределения процесса разработки ПС между группами
          разработчиков. При разбиении ПС на модули для каждого модуля
          указывается реализуемая им функциональность, а также связи с другими
          модулями.[2] Удобство использования модульной архитектуры заключается
          в возможности обновления (замены) модуля, без необходимости изменения
          остальной системы.
        </p>
        <p>
          Роль модулей могут играть структуры данных, библиотеки функций,
          классы, сервисы и др. программные единицы, реализующие некоторую
          функциональность и предоставляющие интерфейс к ней.
        </p>
        <p>
          Программный код часто разбивается на несколько файлов, каждый из
          которых компилируется отдельно от остальных. Такая модульность
          программного кода позволяет значительно уменьшить время перекомпиляции
          при изменениях, вносимых лишь в небольшое количество исходных файлов,
          и упрощает групповую разработку. Также это возможность замены
          отдельных компонентов (таких как jar-файлы, so или dll библиотеки)
          конечного программного продукта, без необходимости пересборки всего
          проекта (например, разработка плагинов к уже готовой программе).
        </p>
        <p>
          Одним из методов написания модульных программ является
          объектно-ориентированное программирование. ООП обеспечивает высокую
          степень модульности благодаря таким свойствам, как инкапсуляция,
          полиморфизм и позднее связывание.
        </p>
        <p>
          Модульное программирование может быть осуществлено, даже когда
          синтаксис языка программирования не поддерживает явное задание имён
          модулям.
        </p>
      </div>
      <div id="69">
        <h3>
          Поняття про растрову та векторну графіку. Системи опрацювання
          графічної інформації. Типи графічних файлів.
        </h3>
        <p>
          Растрове зображення складається з точок — пікселів, які збе­рігають
          інформацію про яскравість та колір. Якість растрових малюнків
          достатньо висока, але вони займають великий обсяг пам'яті. Растрове
          зображення нагадує аркуш паперу в клітинку, на якому кожна клітинка
          зафарбована яким-небудь кольором.
        </p>
        <p>
          Кожний растровий малюнок має певну кількість точок по го­ризонталі і
          вертикалі. Ці два числа характеризують розмір ма­люнка. Розмір малюнка
          в пікселях записують у вигляді: X — кількість пікселів по горизонталі,
          V — кількість пікселів по вер­тикалі. Наприклад для операційної
          системи Windows типові роз­міри екрану дисплея в піксеЛях 640*480,
          1024*768, 1240*1024. Очевидно, що чим більша кількість пікселів
          міститься по гори­зонталі та вертикалі за одних і тих самих
          геометричних розмірів малюнка, тим вища якість відтворення малюнка.
        </p>
        <p>
          Крім розмірів, малюнок характеризується також кольором кожного
          пікселя. Таким чином, для створення або збереження растрового малюнка
          необхідно вказати його розміри і колір кож­ного пікселя. Растрова
          графіка дає змогу одержати високу якість зобра­ження, тому що
          ефективно представляє реальні образи. Недолік растрової графіки —
          великі розміри файлів, що зберігають растровий малюнок.
        </p>
        <p>
          Векторні зображення будуються за допомогою математичного опису простих
          об'єктів — ліній, кіл, з яких створюються більш складні. Такі прості
          об'єкти називаються примітивами. Перева­гою векторної графіки є те, що
          файли, які зберігають векторний малюнок, за розміром в 1-1000 разів
          менші, ніж аналогічні рас­трові файли.
        </p>
        <p>
          Векторна графіка повністю використовує всі переваги роздільної
          здатності того конкретного пристрою, на який виво­диться малюнок.
          Векторні команди просто покіломляють при­строю виведення, що необхідно
          намалювати об'єкт заданого роз­міру, використовуючи стільки точок,
          скільки можливо. Векторна графіка дає змогу також легко редагувати
          окремий об'єкт у ма­люнку, не впливаючи на інші частини.
        </p>
        <p>
          Недоліком векторної графіки є «неприродність» малюнка. Природа уникає
          прямих ліній, і не всякий малюнок можна скла­сти з кіл та прямих ліній
          без втрати якості. Через це векторну графіку в основному
          використовують для побудови креслень, стилізованих малюнків.
        </p>
        <p>
          Виборчі системи. Типи, значення у політ процесі. Визначення поняття
          БІЛЕТ №18 Розрізняють два принципи побудови графічних зображень:
          растровий та векторний. Растрове зображення складається з точок —
          пікселів, які збе­рігають інформацію про яскравість та колір. Якість
          растрових малюнків достатньо висока, але вони займають великий обсяг
          пам'яті. Растрове зображення нагадує аркуш паперу в клітинку, на якому
          кожна клітинка зафарбована яким-небудь кольором. Кожний растровий
          малюнок має певну кількість точок по го­ризонталі і вертикалі. Ці два
          числа характеризують розмір ма­люнка. Розмір малюнка в пікселях
          записують у вигляді: X — кількість пікселів по горизонталі, V —
          кількість пікселів по вер­тикалі. Наприклад для операційної системи
          Windows типові роз­міри екрану дисплея в піксеЛях 640*480, 1024*768,
          1240*1024. Очевидно, що чим більша кількість пікселів міститься по
          гори­зонталі та вертикалі за одних і тих самих геометричних розмірів
          малюнка, тим вища якість відтворення малюнка. Крім розмірів, малюнок
          характеризується також кольором кожного пікселя. Таким чином, для
          створення або збереження растрового малюнка необхідно вказати його
          розміри і колір кож­ного пікселя. Растрова графіка дає змогу одержати
          високу якість зобра­ження, тому що ефективно представляє реальні
          образи. Недолік растрової графіки — великі розміри файлів, що
          зберігають растровий малюнок. Векторні зображення будуються за
          допомогою математичного опису простих об'єктів — ліній, кіл, з яких
          створюються більш складні. Такі прості об'єкти називаються
          примітивами. Перева­гою векторної графіки є те, що файли, які
          зберігають векторний малюнок, за розміром в 1-1000 разів менші, ніж
          аналогічні рас­трові файли. Векторна графіка повністю використовує всі
          переваги роздільної здатності того конкретного пристрою, на який
          виво­диться малюнок. Векторні команди просто покіломляють при­строю
          виведення, що необхідно намалювати об'єкт заданого роз­міру,
          використовуючи стільки точок, скільки можливо. Векторна графіка дає
          змогу також легко редагувати окремий об'єкт у ма­люнку, не впливаючи
          на інші частини. Недоліком векторної графіки є «неприродність»
          малюнка. Природа уникає прямих ліній, і не всякий малюнок можна
          скла­сти з кіл та прямих ліній без втрати якості. Через це векторну
          графіку в основному використовують для побудови креслень, стилізованих
          малюнків. Прикладна програма, призначена для створення й опрацю­вання
          графічних зображень на комп'ютері, називається графіч­ним редактором.
          Програма графічного редактора дає змогу ство­рювані нею зображення
          записувати у файл, а також посилати зображення на пристрій виведення.
          Графічні програми зазвичай використовуються разом зі сканерами,
          кольоровими принтера­ми, цифровими фотоапаратами та іншою апаратурою
          одержання й опрацювання зображень. Для роботи з растровими
          (точкови­ми) зображеннями призначені растрові редактори (Adobe
          Photoshop, Согеl РhotoPaint, Раіпt та ін.). Для створення векторних
          зображень служать векторні редактори (СогеlDraw, АdobeIllustrator,
          Хага та ін.).
        </p>
        <p>
          Існує багато форматів для запису графічних зображень у файл. Існують
          растрові формати, які використовуються для збе­реження растрових
          зображень (розширення файлів ВМР, РСХ, ТІFF, GIF, JPG та ін.);
          векторні формати (розширення СGМ, CDR, WМF, ЕМFР); метафайлові
          формати, які підтримують обидва види графіки WРG, СGМ). Графічні
          редактори, як правило, дають змогу працювати з графічними файлами
          кількох форматів, конвертувати файли з одного формату в інший.
        </p>
      </div>
      <div id="70">
        <h3>Текстовий редактор WORD. Призначення.</h3>
        <p>
          Microsoft Word (повна назва Microsoft Office Word, MS Word, WinWord
          або просто Word, укр. Слово) — текстовий процесор, що випускається
          фірмою Майкрософт, входить до складу офісного пакету «Microsoft
          Office». Перша версія, «Multi Tool Word», була написана для Xenix
          [3][4][5] і перенесена під DOS у 1983 році. Пізніше створено версії
          для Apple Macintosh (1984), Microsoft Windows (1989), SCO UNIX, OS/2.
        </p>
        <p>
          Назначение и возможности: • Создание и редактирование текстовых
          документов с использованием большого выбора шрифтов и стилей текста. •
          Оформление текстовых документов (создание заголовков, оглавления,
          колонтитулов, формирование предметного указателя, расстановка
          переносов, расположение текста на странице; настройка шрифтов и
          параметров абзаца, а также создание текстовых документов с
          использованием различных шаблонов (как системных, так и
          пользовательских), предназначенных специально для соответствующего
          оформления документа). • Вставка в текст требуемых элементов
          (специальных символов, рисунков, примечаний, гиперссылок, сносок и т.
          п.) • Работа с блоками текста (копирование, вставка, перемещение
          фрагментов текста с использованием возможностей буфера обмена). •
          Представление некоторых фрагментов текстового документа в виде
          таблицы, созданной в соответствии с заданными параметрами. • Настройка
          параметров представления текстового документа. • Просмотр статистики
          документа (количество страниц текстового документа, количество
          символов в документе, количество абзацев и др.). • Автоматическая
          проверка формируемого документа на наличие в нем грамматических,
          стилистических и т. п. ошибок с возможностью оперативного их
          устранения • Создание рисунков с использованием специально
          предназначенной функциональности. • Сохранение сформированного
          документа в разных форматах. • Вывод на печать готового текстового
          документа (при необходимости – предварительный просмотр документа
          перед его распечаткой).
        </p>
      </div>
      <div id="71">
        <h3>
          Поняття гіпертексту. Засоби створення та перегляду гіпертекстових
          документів. Особливості мови розмітки НТМL. Тегова модель.
          Класифікація тегів. Основні теги мови НТМL для створення
          гіпертекстового документа. Приклади.
        </h3>
        <p>
          Гіпертекст зовні являє собою звичайний текст з картинками, в якому
          виділені окремі знаки, слова, фрази або картинки, які називають
          полями. З кожним полем в гіпертексті пов’язана яка-небудь дія :
          перехід в інше місце того ж гіпертексту; перехід в інший гіпертекст;
          програвання звукозапису або відеозапису; запуск програми на виконання
          тощо.
        </p>
        <p>
          Якщо встановити курсор на одне з полів та натиснути клавішу введення
          (або кнопку миші), то виконається дія, пов’язана з вибраним полем.
          Принципи гіпертексту закладені в більшість сучасних комп’ютерних
          програм. Принципи побудови гіпертекстів широко використовується в
          Інтернеті. На цьому принципу у 1991 р. була розроблена технологія WWW.
        </p>
        <p>
          Гіпертекст (гіпертекстовий документ) ─ це сукупність елементів тексту,
          кожний з яких оточений тегами, які визначають сферу дії правил, за
          якими інтерпретуються текстові елементи документа.
        </p>
        <p>
          Для створення гіпертекстових (HTML) сторінок слід уміти працювати в
          текстовому редакторі та знати мову HTML (Hyper Text Markup Language) ─
          мову розмітки гіпертексту. HTML - документ ─ це текстовий файл, що
          містить звичайний ASCII текст та спеціальні команди розмітки (теги).
        </p>
        <p>
          Теги в HTML ─ це спеціальні елементи розмітки, що визначають, як даний
          документ HTML має інтерпретуватися браузером. Теги мови HTML
          визначають правила, за якими браузер виводить документ на екран :
          розміщення тексту у вікні, представлення графічних об’єктів, виведення
          звуку та відео тощо. Якщо браузер не розуміє якійсь тег, він його
          пропускає. Більшість тегів в HTML є парними і мають формат : .Але є й
          непарні теги, для яких не обов’язковий кінець команди. Багато команд
          мають параметри (атрибути), які модернізують дію команди.
        </p>
        <p>
          HTML> HEAD> TITLE> Заголовок сторінки /TITLE> /HEAD> BODY> Тіло
          документа /BODY> /HTML> HTML> ─ тег, який вказує на те, що даний
          документ є HTML-документом. HEAD>─ тег, у якому розташовані загальні
          відомості про HTML-сторінку (назва сторінки, додаткова інформація про
          документ). BODY>─ тег «тіла» документа, що визначає ту частину
          документа, у якій міститься його основний зміст. TITLE>─ тегзаголовка,
          що розташовується в HEAD- області документа. Усі теги за їхнім
          призначенням й ділянкою дії можна розділити на такі основні групи : ü
          теги, що визначають структуру документа (теги форматування); ü теги,
          що оформляють блоки гіпертексту (параграфи, списки, таблиці,
          картинки); ü гіпертекстові посилання і закладки (тобто загальні
          посилання). Теги форматування : P> …/P> ─ новий абзац; BR>─ перехід на
          інший рядок; Hn>Текст/Hn>, де під nрозуміється рівень заголовка.
        </p>
      </div>
      <div id="72">
        <h3>База даних. Види.</h3>
        <p>
          База даних (англ. database) – сукупність даних, організованих
          відповідно до концепції, яка описує характеристику цих даних і
          взаємозв'язки між їх елементами; ця сукупність підтримує щонайменше
          одну з областей застосування (за стандартом ISO/IEC 2382:2015[1]). В
          загальному випадку база даних містить схеми, таблиці, подання,
          збережені процедури та інші об'єкти. Дані у базі організовують
          відповідно до моделі організації даних. Таким чином, сучасна база
          даних, крім саме даних, містить їх опис та може містити засоби для їх
          обробки.
        </p>
        <p>
          В загальному випадку базою даних можна вважати будь-який впорядкований
          набір даних. Наприклад, паперову картотеку з формулярами про
          працівників підприємства у відділі кадрів. Але дана стаття зосереджена
          на використанні баз даних в інформаційних системах. На даний час
          застосунки для роботи з базами даних є одними з найпоширеніших
          прикладних програм.
        </p>
        <p>
          Бази даних класифікують за різними критеріями. За моделлю організації
          даних розрізняють такі бази даних:
        </p>
        <p>
          *Ієрархічна. Ієрархічна база даних може бути представлена як дерево,
          що складається з об'єктів різних рівнів. Між об'єктами існують зв'язки
          типу «предок-нащадок». При цьому можлива ситуація, коли об'єкт не має
          нащадків або має їх декілька, тоді як у об'єкта-нащадка обов'язково
          тільки один предок. *Мережна. Така база даних подібна до ієрархічної,
          за винятком того, що кожен об'єкт може мати більше одного предка. *
          Реляційна. Реляційна база даних зберігає дані у вигляді таблиць.
          Найвживаніші СКБД використовують реляційну модель даних.
          *Об'єктно-орієнтована. У базі даних цього виду дані оформляють у
          вигляді моделей об'єктів.
        </p>
        <p>За розміщенням даних виділяють такі види баз:</p>
        <p>
          Локальна, або централізована. Така база даних підтримується на одному
          комп'ютері. Розподілена. Частини такої бази даних розміщують на різних
          комп'ютерах мережі.
        </p>
        <p>Структуровані та неструктуровані БД</p>
        <p>
          Структуровані БД використовують структури даних, тобто структурований
          опис типу фактів за допомогою схеми даних, більш відомої як модель
          даних. Модель даних описує об'єкти та взаємовідношення між ними. Існує
          декілька моделей (чи типів) баз даних, основні: ієрархічна, мережна та
          реляційна.
        </p>
        <p>
          До неструктурованих БД належать повнотекстові бази даних, які містять
          неструктуровані тексти статей чи книг у формі, що дозволяє здійснювати
          швидкий пошук (наприклад, як Вікіпедія).
        </p>
      </div>
      <div id="73">
        <h3>
          Системи опрацьовування текстів, їх класифікація та функції. Основні
          формати текстових файлів і їх перетворення.
        </h3>
        <p>
          Однією з найпоширеніших функцій сучасного персонального комп'ютера є
          підготовка різноманітних текстових документів. Розрізняють три групи
          програм підготовки текстових документів: текстові редактори, текстові
          процесори та видавничі системи.
        </p>
        <p>
          екстовими редакторами, в основному, називають програми, що створюють
          текстові файли без елементів форматування (тобто не дозволяють
          виділяти частини тексту різними шрифтами й гарнітурами). Редактори
          такого роду незамінні під час створення текстів комп'ютер них програм.
        </p>
        <p>Редактори неформатованих текстів:</p>
        <p>
          NotePad - убудований в операційну систему Windows, зрозумілий і
          простий у використанні; McEdit - подібний до редактора Edit із MS DOS,
          компонента файлового менеджера mc (Midnight Commander) ОС Linux; KEdit
          - найпростіший текстовий редактор, який входить до складу KDE Linux;
          KWrite - текстовий редактор, який має низку додаткових настроювань у
          порівнянні з іншими найпростішими текстовими редакторами; Emacs -
          сполучає в собі функції файлового менеджера й тек стового редактора.
          Текстові процесори вміють форматувати текст, вставляти в документ
          графіку й інші об'єкти, що не належать до класичного поняття «текст».
          Слід зазначити умовність такого поділу — розмаїтість програм для
          опрацювання тексту дозволяє знайти редактор із будь-яким набором
          функцій. Редактори, що створюють текст із елементами розмітки: Word —
          служить для створення різноманітних друкованих документів, є
          компонентом офісних додатків у MS Windows; StarWriter — входить до
          складу програми StarOffice, зовнішнім виглядом і функціональністю
          схожий на Word, однаково добре працює як в MS Windows, так і в ОС
          Linux;
        </p>
        <p>
          Деякі текстові процесори є так званими WYSIWYG-редакторами. Назва
          отримана за першими буквами фрази What You See Is What You Get - «те,
          що ти бачиш, є те, що ти одержиш». Коли говорять, що це
          WYSIWYG-редактор, то гарантують повну відповідність зовнішнього
          вигляду документа на екрані комп'ютера і його друкованої копії. До
          редакторів такого типу належать Word i StarWriter.
        </p>
        <p>
          Текстові файли — найпоширеніший тип даних у комп'ютерному світі.
          Текстовий файл є формою подання послідовності символів у комп'ютері.
          Кожний символ із використовуваного набора символів кодується у вигляді
          одного байта, а решта у вигляді послідовності, двох, трьох і т. д.
          байтів, що ідуть підряд. Існують кілька проблем, пов'язаних з
          текстовими файлами. Перша — надзвичайно велика кількість символів, які
          вимагаються для підтримки різних мов. Американські програмісти для
          роботи з 128 символами використовують набір символів US ASCII
          (американський стандартний код для обміну інформацією). Для підтримки
          інших мов найчастіше не вистачає й 256 символів, тому зараз
          здійснюється поступовий перехід до кодування Unicode, у якому для
          зберігання одного символу приділяється вже два байти (тобто є
          можливість закодувати 65 536 різних символів).
        </p>
        <p>
          Чимало текстових файлів передаються у вигляді простого тексту (plain
          text). Простий текст складно зробити привабливим і читати легко,
          оскільки в ньому немає шрифтів різних накреслень, графіків,
          заголовків, підзаголовків і т. д. Ці додаткові особливості звуться
          розмітки тексту (markup).
        </p>
        <p>
          Файли, створені різними редакторами, найчастіше мають унікальні
          розширення, що дозволяють, не заглядаючи усередину документа,
          здогадатися про способи розмітки тексту. Так, файли, створені
          редакторами підготовки plain - тексту, часто мають розширення .txt, а
          підготовлені в редакторі Lyx — .lух. Текстовий процесор Word за
          замовчуванням створює файли у форматі MS Word (розширення .doc), але
          підтримує й інші формати, наприклад RTF (роз ширення .rtf). Документи,
          що містять команди розмітки мови HTML, мають розширення html або .htm.
          Текстові файли часто використовуються для подання даних, які самі не є
          чисто текстовими. У цьому випадку інші формати файлів «надбудовуються»
          над простим текстом. Мови програмування майже виключно використовують
          простий текст як основу. Зокрема, це дозволяє використати для
          опрацювання текстів програм різноманітні стандартні утиліти. Файли
          конфігурації багатьох програм використовують текстовий формат, навіть
          якщо там зберігаються числа й двійкові перемикачі (так/ні). Хоча це
          викликає невеличке ускладнення програм через необхідність перетворення
          бінарних даних у текст і навпаки, проте набагато спрощується
          налагодження. Крім того, у разі необхідності можна підправити
          конфігурацію «вручну», без використання власних засобів настроювання
          даної програми.
        </p>
      </div>
      <div id="74">
        <h3>Математичне забезпечення обчислювальних систем.</h3>
        <p>
          Наряду с аппаратным и программным обеспечением средств вычислительной
          техники в некоторых случаяхцелесообразно рассматривать информационное
          обеспечение, под которым понимают совокупность программ и
          предварительно подготовленных данных, необходимых для работы данных
          программ.
        </p>
        <p>
          Рассмотрим, например, систему автоматической проверки орфографии в
          редактируемом тексте. Ее работа заключается в том, что лексические
          единицы исходного текста сравниваются с заранее заготовленным
          эталонным массивом данных (словарем).
        </p>
        <p>
          В данном случае для успешной работы системы необходимо иметь кроме
          аппаратного и программного обеспечения специальные наборы словарей,
          подключаемые извне. Это пример информационного обеспечения
          вычислительной техники.
        </p>
        <p>
          (3 специализированных компьютерных системах (бортовых компьютерах
          автомобилей, судов, ракет, самолетов, космических летательных
          аппаратов и т. п.) совокупность программного и информационного
          обеспечения называют математическим обеспечением. Как правило, оно
          «жестко» записывается в микросхемы ПЗУ и может быть изменено только
          путем замены ПЗУ или его перепрограммирования на специальном
          оборудовании.
        </p>
        <p>
          Вычислительная техника прошла те же исторические этапы эволюции,
          которые прошли и все прочие технические устройства: от ручных
          приспособлений к механическим устройствам и далее к гибким
          автоматическим системам. Юридическая консультация Современный
          компьютер — это прибор. Его принцип действия — электронный, а
          назначение — автоматизация операций с данными. Гибкость автоматизации
          основана на том, что операции с данными выполняются по заранее
          заготовленным и легко сменяемым программам. Универсальность
          компьютеров основана на том, что любые типы данных представляются в
          нем с помощью универсального двоичного кодирования.
        </p>
        <p>
          Работа компьютерных программ имеет многоуровневый характер. Программы
          низшего (базового) уровня занимаются только взаимодействием с базовыми
          аппаратными средствами и согласованием их работы. Ключевая роль
          программ базового уровня проявляется в момент первичного запуска
          компьютера. Программы системного уровня опираются на программы
          базового уровня и обеспечивают взаимодействие пользователя с
          оборудованием, взаимодействие дополнительного оборудования с базовым,
          а также предоставляют возможность для установки и работы программ
          более высоких уровней. Программы служебногоуровня выполняют
          обслуживание компьютерной системы, обеспечивают ее контроль и
          настройку. В своей работе они опираются на программы базового и
          системного уровней. Программы прикладного уровня используются
          человеком для исполнения практических задач с помощью компьютера. Эти
          программы опираются на программы нижележащих уровней. Совокупность
          программ, установленных на компьютере, называется его программной
          конфигурацией. Совокупность оборудования, подключенного к компьютеру,
          называется его аппаратной конфигурацией. Несмотря на то что по своей
          архитектуре и функциональному назначению разные компьютеры могут быть
          весьма близки друг другу, найти два компьютера, имеющих одинаковые
          аппаратные и программные конфигурации, практически невозможно. На
          каждом рабочем месте программноаппаратная конфигурация создается
          такой, чтобы наиболее эффективно решать конкретные практические
          задачи, характерные для данного рабочего места.
        </p>
      </div>
      <div id="75">
        <h3>
          Організація пошуку інформації в глобальній мережі. Способи збереження
          веб-сторінок та їх частин. Особливості збереження зображень і звуку.
          Приклади.
        </h3>
        <p>
          Кожний ПК в Інтернеті має свою унікальну IP- адресу. IP- адреса ─ це
          числова адреса, за допомогою якої визначене місце розташування кожного
          комп’ютера в адресному просторі комп’ютерів всього світу. IP- адреси
          складаються з чотирьох чисел (байтів), кожне з яких не перевищує 255.
        </p>
        <p>
          В запису адреси числа відокремлюються одне від одного крапками :
          192.112.36.5. Початок адреси містить інформацію для маршрутизаторів
          про те, до якої мережі належить комп’ютер; права частина адреси
          служить для того, щоб повідомити мережі, який комп’ютер має отримати
          інформацію.
        </p>
        <p>
          Доменна адреса комп’ютера ─ символьна адреса, яка складається з
          декількох слів, розподілених крапками. Складові частини адреси
          називаються сегментами.
        </p>
        <p>
          Доменне ім’я розбивається зліва направо : першим стоїть ім’я
          комп’ютера, потім ім’я домену (область), в який входить цей комп’ютер,
          потім ім’я більшого домену. Самий правий сегмент є доменом верхнього
          рівня.
        </p>
        <p>
          Доменна система імен DNS являє собою метод призначення імен шляхом
          покладання на різні групи користувачів відповідальності за підмножини
          імен. За міжнародним стандартом домени країн мають двобуквене ім’я
          (наприклад ua ─ код України).
        </p>
        <p>
          Доступ до Інтернету забезпечують спеціальні організації, які
          називаються постачальниками послуг Інтернету, або провайдерами. За
          допомогою власного або орендованого каналу зв’язку провайдер
          приєднується до опорного каналу та стає комп’ютерним вузлом, до якого
          підходить цей канал.
        </p>
        <p>
          Способи підключення комп’ютерів до мережі Інтернет : ü Прямий доступ
          через виділений (спеціальний) канал зв’язку; ü Прямий доступ через
          виділений телефонний канал зв’язку; ü Комутований доступ (на час
          зв’язку) через телефонну мережу; ü Доступ через асиметричну цифрову
          абонентську лінію; ü радіозв’язок; ü супутниковий зв’язок; ü
          стільниковий зв’язок і т. п.
        </p>
        <p>
          Доступ до Інтернету з використанням телефонної мережі передбачає
          використання модему ─ стандартного пристрою, що перетворює цифровий
          (дискретний) сигнал комп’ютера в аналоговий (безперервний) сигнал для
          передачі телефонною мережею, і навпаки. Модем складається з двох
          логічних пристроїв : модуляторів, який перетворює цифрову інформацію в
          аналогову форму, і демодулятора ─ зворотного перетворювача.
        </p>
        <p>
          Пошук інформації в мережі Інтернет ─ це не тільки пошук у web –
          просторі, але й у інших типах ресурсів мережі. Основними об’єктами,
          які можна використовувати при виконанні пошуку, є гіпертекстова
          система WWW, система телеконференцій, електронна пошта, бази даних,
          списки розсилки, пошукові системи тощо. Але й після проведення пошуку
          та отримання результатів потрібен контроль за достовірністю отриманої
          інформації.
        </p>
        <p>
          В Internet вже досить давно використовують так звані метапошукові
          служби. Таки служби не мають власної бази даних, а просто передають
          запит декільком звичайним пошуковим службам і, після цього,
          систематизують всі знайдені посилання.
        </p>
        <p>
          Крім метапошукових систем можна використовувати спеціальні програми
          пошуковіагенти, які шукають інформацію одночасно по кількох пошукових
          службах, як і мета пошукові служби. Тобто подають запит одночасно
          кільком пошуковим машинам, а результати збираються в одне ціле і
          сортують. Пошукові агенти мають ряд переваг над мета пошуковими
          службами, серед них : · опитування одночасно великої кількості
          пошукових служб, інколи до кількох сотень; · гнучке керування
          передаванням запитом з вказанням максимального часу очікування
          відповіді, кількості одночасно встановлених з’єднань і т.д.; ·
          можливість збереження результатів пошуку з можливістю обновлення; ·
          перевірка доступності знайдених посилань і завантаження сторінок для
          автономного вивчення; · можливість додаткової перевірки знайдених
          документів.
        </p>
        <p>
          Основна перевага пошукових агентів полягає в тому, що всі вище
          перераховані дій виконуються автоматично, а також в тому, що для
          обробки посилань та документів завантажуються відразу декілька
          процесів. За рахунок цього оптимально використовується Internet –
          канал і затрати часу різко зменшуються.
        </p>
        <p>
          Інформація на Web- сервері зберігається у вигляді так званих Web-
          сторінок або Web-документів. Web-документ ─ це файл у форматі HTML.
          Цей формат визначає зовнішній вигляд документа, взаємне розташування
          текстової, графічної і мультимедійної інформації.
        </p>
        <p>
          Більшість користувачів Інтернету використовують для зв’язку зі
          Всесвітньою мережею з’єднання комутованими телефонними каналами за
          допомогою модему. Оскільки це повільний спосіб зв’язку, то час
          завантаження графічного зображення в клієнтський браузер має бути
          якомога меншим. Саме тому два найбільш популярних графічних стандарти
          ─ це .GIF і .JPEG.
        </p>
        <p>
          Стандарт GIFвикористовується в документах HTML для відображення так
          званої бізнес-графіки : діаграм, логотипів, кнопок, розподільних
          ліній, інших елементів оформлення сторінки. Для розміщення на
          web-сайті фотографій, репродукцій картин та зображень із великою
          кількістю кольорів і колірних переходів використовується стандарт
          JPEG.
        </p>
        <p>
          Аудіофайли (звукові файли) в Інтернеті, як і графічні, зберігаються з
          втратою інформації, як правило, у форматі .WAV (.WAV ─ один з типів
          файлів сімейства RIFF ─ системи зберігання будь-яких структурованих
          даних.
        </p>
        <p>
          Як правило, розробники сайтів вказують розмір аудіофайлів, щоб
          користувач міг оцінити свої можливості по завантаженню даного
          звукового файлу. Сучасні браузери також підтримують роботу з
          відеокліпами популярних форматів .AVI, .VIVO, .QT, .MPEG.
        </p>
      </div>
      <div id="76">
        <h3>
          Клієнт-серверна система. Призначення. Поняття клієнту та серверу.
        </h3>
        <p>
          Архітектура клієнт-сервер є одним із архітектурних шаблонів
          програмного забезпечення та є домінуючою концепцією у створенні
          розподілених мережних застосунків і передбачає взаємодію та обмін
          даними між ними. Вона передбачає такі основні компоненти: набір
          серверів, які надають інформацію або інші послуги програмам, які
          звертаються до них; набір клієнтів, які використовують сервіси, що
          надаються серверами; мережа, яка забезпечує взаємодію між клієнтами та
          серверами.
        </p>
        <p>
          Сервери є незалежними один від одного. Клієнти також функціонують
          паралельно і незалежно один від одного. Немає жорсткої прив'язки
          клієнтів до серверів. Більш ніж типовою є ситуація, коли один сервер
          одночасно обробляє запити від різних клієнтів; з іншого боку, клієнт
          може звертатися то до одного сервера, то до іншого. Клієнти мають
          знати про доступні сервери, але можуть не мати жодного уявлення про
          існування інших клієнтів.
        </p>
        <p>
          уже важливо ясно уявляти, хто або що розглядається як «клієнт». Можна
          говорити про клієнтський комп'ютер, з якого відбувається звернення до
          інших комп'ютерів. Можна говорити про клієнтське та серверне програмне
          забезпечення. Нарешті, можна говорити про людей, які бажають за
          допомогою відповідного програмного та апаратного забезпечення отримати
          доступ до тієї чи іншої інформації. Загальноприйнятим є положення, що
          клієнти та сервери — це перш за все програмні модулі. Найчастіше вони
          знаходяться на різних комп'ютерах, але бувають ситуації, коли обидві
          програми — і клієнтська, і серверна, фізично розміщуються на одній
          машині; в такій ситуації сервер часто називається локальним.
        </p>
      </div>
      <div id="77">
        <h3>
          Поняття алгоритму. Властивості алгоритмів. Базові структури алгоритмів
          та їх основні властивості.
        </h3>
        <p>
          Термін алгорипім виник задовго до появи комп'ютерів, і похо­дить від
          імені давнього філософа й математика з Хорезму, шо жив у IX ст. —
          Аль-Хорезмі. Алгоритм — це точний і зрозумілий опис послідовності дій
          над заданими об'єктами, що дає змогу одержати кінцевий ре­зультат.
          Синонімом алгоритму можуть бути слова: спосіб, ре­цепт.
        </p>
        <p>
          Алгоритм дає змогу формалізувати виконання інформаційно­го процесу,
          тобто виконавець алгоритму може виконувати алго­ритм формально, не
          вникаючи в зміст поставленої задачі. Кожен алгоритм має задовольняти
          певні властивості.
        </p>
        <p>
          Дискретність. Будь-який алгоритм може бути розбитий на окремі кроки —
          закінчені дії. Перехід до наступного кроку мож­ливий лише після
          завершення попереднього.
        </p>
        <p>
          Визначеність (чи детермінованість). Кожна команда алгорит­му повинна
          однозначно визначати певну дію і не допускати двоякого тлумачення.
          Строго визначеним повинен бути і поря­док виконання операцій.
        </p>
        <p>
          Результативність. Виконання алгоритму має приводити до конкретного
          результату — розв'язку задачі, якщо навіть він дає і результати, які
          можуть виявитися і неправильними. Розв'язком задачі може бути також
          повідомлення про те, що задача розв'яз­ку не має.
        </p>
        <p>
          Масовість. За допомогою алгоритму можна розв'язувати не одну конкретну
          задачу, а безліч однотипних задач. Властивість масовості збільшує
          практичну цінність алгоритму.
        </p>
        <p>
          Скінченність. Виконання алгоритму повинно завершитися за скінченну
          кількість кроків. Виконання алгоритму не може закін­чуватися
          невизначеною ситуацією або ж зовсім не закінчуватися.
        </p>
        <p>
          Правильність. Алгоритм правильний, якщо його виконання забезпечує
          досягнення мети.
        </p>
        <p>
          Формальність. Будь-який виконавець, здатний сприймати і виконувати
          вказівки алгоритму (навіть не розуміючи їх змісту), діючи за
          алгоритмом, зможе виконати поставлене завдання.
        </p>
        <p>
          Під час складання алгоритмів треба пам'ятати, що одна й та сама задача
          може бути успішно розв'язана за допомогою алго­ритмів, що
          відрізняються один від одного. При виборі алгоритму треба насамперед
          зважати на вимоги компактності алгоритму і легкості його розуміння. Ці
          вимоги можна задовольнити, якщо дотримуватися структурного підходу, в
          основі якого лежить твер­дження, що алгоритм будь-якого ступеня
          складності можна ви­разити за допомогою трьох базових структур:
          слідування, розга­луження і циклу.
        </p>
        <p>
          Слідування. Операція S подається у вигляді послідовності двох (або
          більше) виконуваних одна за одною простіших операцій S1, S2,...., SN.
          Розгалуження (вибір). Для виконання операції S треба спочат­ку
          визначити, хибне чи істинне деяке твердження Р. Якщо твер­дження Р
          істинне, то виконується вказівка S1 і на цьому опера­ція S
          закінчується. Якщо твердження Р хибне, то виконується вказівка S2 і на
          цьому виконання вказівки S закінчується.
        </p>
        <p>
          Повторення (цикли). Розрізняють два види циклів — цикл-ПОКИ і цикл-ДО
          а) У структурі цикл-ПОКИ для виконання вказівки S спочатку треба
          визначити, істинне чи хибне твердження Р. Якщо Р істин­не, то
          виконується вказівка S1 і знову повертаються до визначен­ня істинності
          твердження Р. Якщо ж твердження Р хибне, то ви­конання вказівки S
          вважається закінченим. б) У структурі цикл-ДО спочатку виконується
          вказівка S1, а потім визначається істинність твердження Р. Якщо
          твердження Р хибне, то знову виконується вказівка S1 і визначається
          істин­ність твердження Р. Якщо ж твердження Р істинне, то виконан­ня
          вказівки 51 вважається закінченим.
        </p>
        <p>
          Основною властивістю базових алгоритмічних структур є те, що кожна з
          них має єдиний вхід та єдиний вихід. Для побудови алгоритмів з
          використанням цих структур дозволяється тільки заміняти будь-яку
          окрему вказівку алгоритму сукупністю більш простих вказівок, яка являє
          собою одну із базових структур алго­ритмів. Будь-який алгоритм може
          бути побудованим з викори­станням тільки вказаних базових структур.
        </p>
      </div>
      <div id="78">
        <h3>
          Розподілені системи обробки інформації. Визначення. Призначення.
        </h3>
        <p>
          Распределенная система обработки данных (РСОД) - любая система,
          позволяющая организовать взаимодействие независимых, но связанных
          между собой ЭВМ. Эти системы предназначены для автоматизации таких
          объектов, которые характеризуются территориальной распределенностью
          пунктов возникновения и потребления информации. Концептуально
          распределенная обработка подразумевает тот или иной вид организации
          сети связи и децентрализацию трех категорий ресурсов:
        </p>
        <p>
          · аппаратных вычислительных средств и собственно вычислительной
          мощности; · баз данных; · управление системой.
        </p>
        <p>
          В распределенных системах обработки данных в той или иной степени
          осуществляется реализация следующих основных функций: · доступ к
          ресурсам (вычислительным мощностям, программам, данным и т. п.) с
          терминалов и из пользовательских программ в режиме «файл-сервер»; ·
          выполнение заданий и интерактивное общение пользователей с запущенными
          по их требованию программами в режиме «клиент-сервер»; · сбор
          статистики о функционировании системы; · обеспечение надежности и
          живучести системы в целом.
        </p>
        <p>
          Системы, имеющие программы распределенной среды, включают компьютеры,
          называемые серверами и клиентами. Каждый сервер имеет свою группу
          клиентов. Программное обеспечение сетевой среды обслуживается и
          поддерживается сетевыми операционными системами. В роли сервера
          выступает главный, более мощный компьютер. Распределенная среда
          требует организации распределенной базы данных и такого
          инструментария, как распределенная система управления базой данных
          (РСУБД). Распределенная обработка данных позволила повысить
          эффективность удовлетворения изменяющейся информационной потребности
          информационного работника и тем самым обеспечить гибкость принимаемых
          им решений.
        </p>
        <p>
          Преимущества распределенной обработки данных: • большое число
          взаимодействующих между собой пользователей, выполняющих функции
          сбора, регистрации, хранения, передачи и выдачи информации; • снятие
          пиковых нагрузок с централизованной базы путем распределения обработки
          и хранения локальных баз данных на разных ЭВМ; • обеспечение доступа
          информационного работника к вычислительным ресурсам сети ЭВМ; •
          обеспечение симметричного обмена данными между удаленными
          пользователями. Введение классификации моделей представления данных на
          иерархические, сетевые и реляционные отразилось на архитектуре систем
          управления базами данных и технологии их обработки. Архитектура СУБД
          описывает ее функционирование как взаимодействие процессов двух типов:
          клиента и сервера. Распределенная обработка и распределенная база
          данных не синонимы. Если при распределенной обработке производится
          работа с базой, то подразумевается, что представление данных, их
          содержательная обработка, работа с базой на логическом уровне
          выполняются на персональном компьютере клиента, а поддержание базы в
          актуальном состоянии — на сервере.
        </p>
      </div>
      <div id="79">
        <h3>
          Основні команди для роботи з таблицями в реляційних базах даних:
          створення структури записів, заповнення даними, редагування даних.
          Приклади.
        </h3>
        <p>
          Основні категорії команд мови SQL : • DDL - мова визначення даних; •
          DML - мова маніпулювання даними; • DQL - мова запитів ; • DCL - мова
          управління даними; • команди адміністрування даних; • команди
          управління транзакціями
        </p>
        <p>
          Визначення структур бази даних (DDL) Мова визначення даних (Data
          Definition Language, DDL) дозволяє створювати і змінювати структуру
          об'єктів бази даних, наприклад, створювати і видаляти таблиці.
          Основними командами мови DDL є наступні: CREATE TABLE, ALTER TABLE,
          DROP TABLE, CREATE INDEX, ALTER INDEX, DROP INDEX.
        </p>
        <p>
          Маніпулювання даними (DML) Мова маніпулювання даними (Data
          Manipulation Language, DML) використовується для маніпулювання
          інформацією усередині об'єктів реляційної бази даних за допомогою
          трьох основних команд: INSERT, UPDATE, DELETE.
        </p>
        <p>
          Вибірка даних (DQL) Мова запитів DQL найбільш відома користувачам
          реляційної бази даних, не дивлячись на те, що він включає всього одну
          команду SELECT. Ця команда разом зі своїми численними опціями і
          пропозиціями використовується для формування запитів до реляційної
          бази даних.
        </p>
        <p>
          Мова управління даними (DCL - Data Control Language) Команди
          управління даними дозволяють управляти доступом до інформації, що
          знаходиться усередині бази даних. Як правило, вони використовуються
          для створення об'єктів, пов'язаних з доступом до даних, а також
          служать для контролю над розподілом привілеїв між користувачами.
          Команди управління даними наступні: GRANT, REVOKE.
        </p>
        <p>
          Команди адміністрування даних За допомогою команд адміністрування
          даних користувач здійснює контроль за виконуваними діями і аналізує
          операції бази даних ; вони також можуть виявитися корисними при
          аналізі продуктивності системи. Не слід плутати адміністрування даних
          з адмініструванням бази даних, яке є загальним управлінням базою даних
          і має на увазі використання команд усіх рівнів.
        </p>
        <p>
          Команди управління транзакціями Існують наступні команди, що
          дозволяють управляти транзакціями бази даних : COMMIT, ROLLBACK,
          SAVEPOINT, SET TRANSACTION.
        </p>
        <p>Просмотр доступных баз данных SHOW DATABASES;</p>
        <p>Создание новой базы данных CREATE DATABASE;</p>
        <p>Выбор базы данных для использования USE database_name>;</p>
        <p>Импорт SQL-команд из файла .sql SOURCE path_of_.sql_file></p>
        <p>DROP DATABASE database_name>;</p>
        <p>Просмотр таблиц, доступных в базе данных SHOW TABLES;</p>
        <p>
          Создание новой таблицы CREATE TABLE table_name1> ( col_name1>
          col_type1>, col_name2> col_type2>, col_name3> col_type3> PRIMARY KEY
          (col_name1>), FOREIGN KEY (col_name2>) REFERENCES
          table_name2>(col_name2>) );
        </p>
        <p>
          Создайте таблицу «instructor»: CREATE TABLE instructor ( ID CHAR(5),
          name VARCHAR(20) NOT NULL, dept_name VARCHAR(20), salary NUMERIC(8,2),
          PRIMARY KEY (ID), FOREIGN KEY (dept_name) REFERENCES
          department(dept_name) );
        </p>
      </div>
      <div id="80">
        <h3>Мета обчислення (Суперобчислення)</h3>
        <p>
          Метаобчислення обумовлені бажанням користувачів мати доступ до
          ресурсів, недоступних в середовищі одномашинних обчислень. Турчин
          Валентин Федорович заклав основи метаобчислень, запропонувавши якісно
          новий метод перетворення і оптимізації програм. Метакомп’ютер (або
          обчислювальна мережа) утворюється деяким рівнем програмного
          забезпечення, яке об'єднує комп'ютери і комунікаційні мережі,
          створюючи ілюзію одного віртуального комп'ютера. Ще один рівень
          програмного забезпечення на вершині цієї інфраструктури забезпечує
          метаобчислювальне середовище, що дозволяє програмам використовувати
          можливості метакомп’ютера. Суть і ролі цих рівнів програмного
          забезпечення подібні операційним системам, які реалізують віртуальну
          машину на вершині апаратних ресурсів і підтримують набір інструментів,
          використовуваних прикладними програмістами.Метатеорія — теорія, що
          аналізує методи й властивості іншої теорії, так званої предметної або
          об'єктної теорії. Завдання метатеорії - встановити межі області
          застосування досліджуваної в ній теорії, відповісти на запитання про
          її несуперечності та повноті, вивчити або встановити способи введення
          її нових понять і докази її тверджень тощо. Необхідність створення
          метатеорії виникла насамперед у застосуванні до математики. Вона була
          зумовлена потребою з'ясування сенсу понять доказ, аксіома, теорема,
          дослідження структури математичних теорій і питання про їхню
          істинність в категорійно-логічних інтерпретаціях
        </p>
        <p>
          Грід-обчислення — це сукупність комп'ютерних ресурсів з декількох
          місць для досягнення спільної мети. Сітка може розглядатися як
          розподілена система з неінтерактивних робочих навантажень, які
          включають в себе велику кількість файлів. Сітка обчислень
          відрізняється від звичайних високопродуктивних обчислювальних систем,
          таких як кластерних обчислень тим, що сітки комп'ютерів мають кожен
          вузол налаштований на виконання іншої задачі / програми. Комп'ютерні
          сітки також мають тенденцію бути більш різнорідними і географічно
          розосереджені (таким чином, не фізичні в поєднанні), ніж кластерних
          комп'ютерів. Незважаючи на те, одна сітка може бути присвячена певній
          програмі, зазвичай сітка використовується для різних цілей. Сітки
          часто будуються з загального призначення бібліотеки сітки проміжного
          програмного забезпечення. Розміри сітки може бути досить великим.
        </p>
        <p>
          рід є формою розподілених обчислень, в якому багато комп'ютерів
          об'єднані в один потужний віртуальний комп'ютер, і які працюють разом
          для виконання трудомістких завдань. Для деяких застосувань, «ґрід»
          обчислення можна розлядати як спеціальний тип паралельних обчислень
          які покладаються на цілі комп'ютери(обладнані процесорами, пам'ятю,
          живленням, мережевим інтерфейсом і тд.), під'єднані до комп'ютерної
          мережі(приватної або публічної) звичайним мережевим інтерфейсом, таким
          як Ethernet. Це все відрізняє від традиційного поняття
          суперкомп'ютера, який має багато процесорів, з'єднаних локальною
          високошвидкісною комп'ютерною шиною.
        </p>
      </div>
    </>
  );
};

export default Answers_40_80;
