import React from 'react';

const Answers_1_39: React.FC = (): JSX.Element => {
  return (
    <>
      <div id="1">
        <h3>
          Computer(Комп'ютер обчислювач) - пристрій, призначений для обробки,
          зберігання та передвання інформації. Може обробляти тільки інформацію
          представлену в цифровій формі. Термін комп'ютер є синонімом ЕОМ. Після
          появи PC термін ЕОМ був витісненний.
        </h3>
        <p>
          Computer(Комп'ютер обчислювач) - пристрій, призначений для обробки,
          зберігання та передвання інформації. Може обробляти тільки інформацію
          представлену в цифровій формі. Термін комп'ютер є синонімом ЕОМ. Після
          появи PC термін ЕОМ був витісненний.
        </p>
        <p>
          Перше (1940-ві – середина 1950-х років) ЕОМ цього покоління базувались
          на дискретних елементах і вакуумних лампах, мали великі габарити,
          масу, потужність, володіючи при цьому малою надійністю. Основна
          технологія збірки — навісний монтаж. Вони використовувались переважно
          для вирішення науково-технічних завдань атомної промисловості,
          реактивної авіації та ракетобудування. Збільшенню кількості
          вирішуваних завдань перешкоджали низька надійність і продуктивність, а
          також надзвичайно трудомісткий процес підготовки, введення та
          налагодження програми, написаної мовою машинних команд, тобто у формі
          двійкових кодів. Машини цього покоління мали швидкодію близько 10-20
          тисяч операцій в секунду і оперативну пам’ять приблизно 1 кілобайт. У
          цей же період з'явились перші прості мови для автоматизованого
          програмування.
        </p>
        <p>
          Друге кінець 1950-х друге Це було зумовлено насамперед появою
          напівпровідників і створенням на їх основі транзисторів, які замінили
          електронні лампи. ЕОМ на транзисторній елементній базі докорінно
          змінили більшість уявлень про можливості та роботу ЕОМ. Значно зросла
          їх надійність, вони могли вже працювати упродовж кількох діб без
          перерви. Скоротилися витрати електроенергії, зменшилися розміри
          окремих пристроїв і всієї машини в цілому. Швидкодія ЕОМ другого
          покоління досягла 100 тисяч операцій за секунду, ємність внутрішньої
          пам’яті зросла до 300 Кбайт.Складнішою стала архітектура ЕОМ,
          з’явилися дисплеї та накопичувачі на магнітних дисках. У написанні
          програм стався перехід від мов машинних кодів до мов програмування
          низького рівня, які були універсальнішими. Це робило програмування
          простішим і доступнішим. З’явилися перші операційні системи, які дали
          змогу автоматизувати процеси обміну даними між пристроями ЕОМ,
          спростили обмін даними між самою ЕОМ і користувачем. Стрімко
          розширилося коло задач (математичних, статистичних, логічних та
          інших).
        </p>
        <p>
          Трете період 1960-х характеризується появою промислової технології
          створення інтегральних схем (ІС) та їх широким застосуванням в
          електронній техніці. Інтегральні схеми були покладені в основу ЕОМ
          третього покоління, які почали з’являтися в середині 1960-х років.
          Швидкодія цих машин підвищилася до 10 мільйонів операцій за секунду, а
          ємність внутрішньої пам’яті розширилася до декількох мегабайтів. Поява
          мов програмування високого рівня. Опрацювання графічних і звукових
          даних.
        </p>
        <p>
          Четверте кінець 1970-х – на початку 1980-х років - Елементною базою
          машин цього покоління стали великі інтегральні схеми (ВІС) і надвеликі
          інтегральні схеми (НВІС), тобто мікросхеми з високою щільністю малих
          елементів. Різко зменшилися розміри ЕОМ, швидкодія зросла до сотень
          мільйонів операцій за секунду, а ємність внутрішньої пам’яті – до
          десятків і сотень мегабайтів. Удосконалюються також зовнішні пристрої,
          значно розширюється їх коло. З’являються перші персональні комп’ютери.
        </p>
        <p>
          90-ті(з 2000-х) рр ЕОМ п'ятого покоління, надвеликі інтегральні схеми,
          які містять до сотні тисяч елементів на квадратний сантиметр. 5
          покоління - це не тільки нова елементна база, а це прогрес та
          досягнення нових якісних зрушень у всіх галузях.
        </p>
      </div>
      <div id="2">
        <h3>
          Електронні таблиці та їх призначення. Середовище табличного процесора
          та основні його елементи. Подання даних в електронних таблицях.
          Введення тексту, чисел і формул. Приклади.
        </h3>
        <p>
          Одним з найважливіших засобів опрацювання і зберігання інформації є
          таблиці. Вони можуть утворювати деякий документ або бути частиною
          іншого документа. Програми, які забезпечують автоматизацію процесу
          створення, опрацювання, корегування, зберігання і виведення на друк
          документів у формі таблиць або їх частин, називають електронними
          таблицями(табличними редакторами). Електронні таблиці призначені для
          формування табличних документів з використанням чисел, текстів і
          формул, які використовують для автоматизації обчислювального процесу,
          а також для подання табличних даних в графічній формі. Електронні
          таблиці є засобом організації інформації, надання їй певної структури.
          Це значно спрощує аналіз інформації та її опрацювання.
        </p>
        <p>
          Електронні таблиці виконують такі функції(табличні редактори, табличні
          процессори):
        </p>
        <p>
          створення таблиці одноразового та багаторазового використання;
          формування таблиць із текстових та чисельних даних; редагування та
          форматування таблиць даних; задавання формул для автоматичного
          виконання обчислень; графічне подання табличних даних; фільтрування та
          впорядкування даних; створення форм і звітів; проведення дослідження;
          статистичний аналіз; створення та опрацювання баз даних (введення,
          пошук, сортування, фільтрація (відбір) і аналіз даних); розв’язання
          математичних задач (виконання різноманітних табличних обчислень за
          допомогою вбудованих функцій); збереження табличних даних на зовнішніх
          носіях. наочне подання даних у вигляді графіків і діаграм; здійснення
          обміну даними з іншими програмами (вставлення тексту, рисунків,
          таблиць, підготовлених в інших додатках);
        </p>
        <p>
          Сучасні електронні таблиці володіють власними засобами програмування,
          дозволяють здійснювати публікацію в Web, володіють засобами захисту
          даних.
        </p>
        <p>
          Популярними електронними таблицями є Microsoft Excel, Open Office,
          Numbers.
        </p>
        <p>
          Допускаються такі основні форми подання чисел: цілі, дійсні, в
          експоненціальній формі, раціональні дроби. Для цілих чисел допустимо
          використання цифр 0 ... 9, а також знаки «+» і «-». Дійсні числа
          включають кому, яка розділяє цілу і дробову частини. Числа в
          експоненціальній формі складаються з мантиси і порядку, розділених
          латинською літерою є. Для введення раціональних дробів слід ввести
          нуль (щоб відрізнити дріб від дати), потім символ пробіл, далі
          чисельник, символ «/» і знаменник. Можна помістити в одну клітинку
          дату і час.
        </p>
      </div>
      <div id="3">
        <h3>
          Інформація і повідомлення. Види інформації та її властивості.
          Інформація та шум, їх взаємоперетворення.
        </h3>
        <p>
          Термін «інформація» (з лат.іпformatio, яке означає роз'яснення,
          виклад). Поняття інформація є неозначуваним. Під інформацією розуміють
          відомості про об'єкти навколишнього світу, які сприймаються людиною,
          твариною, рослинним світом або спеціальними пристроями і підвищують їх
          рівень поінформованості.
        </p>
        <p>
          Інформація передається за допомогою повідомлень. Повідомлення бувають
          усними, письмовими, у вигляді малюнків, жестами, спеціальними знаками
          чи організованими якимось іншим чином. Прикладами повідомлень є:
          покази вимірювального пристрою, дорожні знаки, текст телеграми, усна
          розповідь, відповідь учня тощо.
        </p>
        <p>
          За допомогою повідомлень відбувається обмін інформацією між людьми,
          між людьми і машинами, між машинами; обмін сигналами у рослинному і
          тваринному світі, від клітини до клітини, від організму до організму
          тощо.
        </p>
        <p>Види інформації:</p>
        <p>
          За суспільним значенням: наукова; виробнича; управлінська; технічна;
          масового подання: повсякденна; суспільно-політична;
        </p>
        <p>
          За способами сприйняття: візуальна; аудіальна; тактильна; нюхова;
          смакова.
        </p>
        <p>
          За формами подання: текстова; числова; графічна; комбінована естетична
          Інформація, яку несуть повідомлення повинна характеризуватися такими
          властивостями, як корисність, актуальність, вірогідність,
          об'єктивність, повнота, зрозумілість.
        </p>
        <p>
          Корисність. Корисність інформації оцінюється за тими задачами, які
          можна розв'язати з її використанням. Відомості, корисні для однієї
          людини, виявляються марними для іншої, якщо вона не може їх
          використовувати.
        </p>
        <p>
          Актуальність. Інформація актуальна(своєчасна), якщо вона важлива в
          даний момент часу. Якщо ви маєте їхати потягом, то для вас важливою є
          інформація про те, коли цей потяг вирушає. Однак ця інформація втрачає
          свою актуальність після того, як потяг рушив.
        </p>
        <p>
          Вірогідність. Інформація вважається вірогідною, якщо вона не
          суперечить реальній дійсності, правильно її пояснює і підтверджується
          нею. Якщо ви довідалися про повінь з інформаційної телепрограми, то ця
          інформація, цілком ймовірно, є достовірною. Водночас чутки про
          пришестя інопланетян, що очікується наступного тижня, недостовірні.
        </p>
        <p>
          Об'єктивність. Інформація може бути об'єктивною або суб'єктивною
          (залежати чи не залежати від чийогось судження). Наприклад,
          повідомлення «вода в морі холодна» є суб'єктивним, водночас
          повідомлення «температура води +17С0» дає об'єктивну інформацію.
        </p>
        <p>
          Повнота. Інформація повна, якщо її достатньо для правильних висновків
          і прийняття правильних рішень. Якщо людині на основі якої-небудь
          інформації доводиться щось вирішувати, то вона спочатку оцінює, чи
          досить цієї інформації для-ухвалення правильного рішення. Інакше
          кажучи, повною чи неповною є наявна інформація.
        </p>
        <p>
          Зрозумілість. Інформація зрозуміла, якщо при її сприйманні немає
          потреби у додаткових повідомленнях (не виникає запитань). Якщо людині
          розповідають щось, до сприймання чого вона ще не підготовлена,
          наприклад звертаються англійською раніше, ніж людина вивчила цю мову,
          то вона з почутої інформації винесе зовсім іншу інформацію, ніж це
          було б тоді, коли людина вивчила англійську мову.
        </p>
      </div>
      <div id="4">
        <h3>Програмне забезпечення. Визначення. Види.</h3>
        <p>
          Програмне забезпечення (ПЗ) являє собою сукупність програм,
          призначених для розв’язання завдань на комп’ютері. Програма – це
          впорядкований набір команд. Програмне та апаратне забезпечення
          працюють взаємопов’язано і в неперервній взаємодії. Будь-який
          апаратний пристрій управляється програмно.
        </p>
        <p>
          Програмне забезпечення можна поділити на три класи: системне прикладне
          інструментальне
        </p>
        <p>
          Наведена класифікація є досить умовною. Інтеграція програмного
          забезпечення призвела до того, що практично будь-яка програма має риси
          кожного класу. Системне ПЗ призначено для управління роботою
          комп'ютера, розподілу його ресурсів, підтримки діалогу з
          користувачами, надання їм допомоги в обслуговуванні комп'ютера, а
          також для часткової автоматизації розробки нових програм.
        </p>
        <p>
          Системне ПЗ – це комплекс програм, багато з яких постачаються разом з
          комп'ютером та документацією до неї. Системне ПЗ можна розділити на
          три основні частини:
        </p>
        <p>
          операційні системи (ОС) системи програмування сервісні програми
          Основними компонентами загальносистемного програмного забезпечення є
          операційні системи, які вирішують задачі взаємозв’язаного
          функціонування окремих компонентів.
        </p>
        <p>Існують 4 типи операційних систем:</p>
        <p>
          операційні системи пакетної обробки: порівняно велика швидкість
          логічних і автоматичних операцій, але в свою чергу мала швидкість
          вводу і виводу, завантаженість процесора на 20 – 30%.
        </p>
        <p>
          операційна система з розподілом задач в часі (організовується черга
          вводу і виходу задач, і обслуговується до 15 користувачів, процесор
          завантажений на 80 – 90%).
        </p>
        <p>
          операційна система реального часу, використовується для керування
          різними процесами. Системне програмне забезпечення здійснює управління
          роботою обчислювальної системи. Як правило, системні програми
          забезпечують взаємодію інших програм з апаратними складовими,
          організацію інтерфейсу користувача. Сюди відносять операційні системи,
          сервісні системи.
        </p>
        <p>
          Прикладне програмне забезпечення призначене для розв’язання прикладних
          завдань фахової діяльності людини (тобто, прикладене до практики).
          Спектр таких програм надзвичайно широкий: від виробничих та наукових
          до навчальних та розважальних. Сюди відносять розрахункові, навчаючі,
          моделюючі програми, комп’ютерні ігри, тощо.
        </p>
        <p>
          Інструментальне програмне забезпечення призначене для розробки всіх
          видів інформаційно-програмного забезпечення. При цьому під
          інформаційним забезпеченням розуміють сукупність попередньо
          підготовлених даних, необхідних для роботи програмного забезпечення.
          Наприклад, будь-яка сучасна програма має вбудовану довідку для роботи
          з цією програмою. Файл довідки являє собою інформаційне забезпечення.
          До інструментального програмного забезпечення відносять: редактори
          (текстові, графічні, музичні), системи табличної обробки даних
          (табличні процесори), системи управління базами даних, транслятори мов
          програмування, інтегровані системи діловиробництва, тощо. Системи
          програмування призначені для полегшення та для часткової автоматизації
          процесу розробки та відлагодження програм. Основними компо¬нентами цих
          систем є транслятори з мов високого рівня, наприклад, Паскаль, Сі,
          Бейсик та ін. Особлива роль належить Ассамблеру. Програму мовою
          Ассамблер називають машинно-орієнтованою. Мовою Ассамблер
          користую¬ться, як правило, системні програмісти. Транслятори
          здійснюють перетворення програм з мов високого рівня на машинну мову.
          Крім того, транслятори здійснюють синтаксичний аналіз програми, яка
          транслюється. Вони можуть також відлагоджувати та оптимізувати
          програми, які одержують, видавати документацію на програму та
          виконувати ряд інших сервісних функцій. Ассемблер перетворює програми,
          які представлені у машиноорієнтованих мовах, на машинну мову.
          Прикладне ПЗ загального призначення – це комплекс програм, який широко
          використовується серед різних категорій користувачів. Найбільш
          відомими серед них є: текстові редактори, графічні системи, електронні
          таблиці, системи управління базами даних та ін. Прикладні програми
          спеціального призначення використовують у специфічній діяльності
          користувачів. Функції специфічних систем залежать від їх призначення.
          Наприклад, для систем навчального призначення це можуть бути
          інструментальні засоби для розробки комп'ютерних уроків (гіпермедійні
          та гіпертекстові системи, авторсь¬кі та інші системи), імітаційне
          моделюючі програми навчального призначення, програми для розробки та
          підтримки шкільного розкладу, педагогічні програмні засоби різного
          призначення та ін.
        </p>
      </div>
      <div id="5">
        <h3>
          Системи опрацювання графічних зображень. Створення і редагування
          графічних зображень за допомогою графічного редактора. Зміна
          параметрів графічних об'єктів у середовищі графічного редактора.
          Графічні формати Інтернету. Приклади.
        </h3>
        <p>
          Комп'ютерна графіка використовується при конструюванні, в архітектурі,
          створенні рекламних роликів, у видавничій діяльності. Основні функції
          графічного редактора:
        </p>
        <p>
          Зображення поділяються на растрові й векторні. Растрове зображення
          являє собою набір пікселів, тобто кольорових точок, розташованих на
          правильній сітці — растрі. Векторне представлення полягає в описі
          елементів зображення за допомогою математичних формул. Для цього
          зображення розкладається на прості об'єкти — примітиви (лінії, еліпси,
          кола, багатокутники, зірочки тощо).
        </p>
        <p>
          Прикладна програма, призначена для створення й опрацювання графічних
          зображень на комп'ютері, називається графічним редактором.
        </p>
        <ul>
          <li>Забезпечення створення зображень;</li>
          <li>Редагування зображень;</li>
          <li>Збереження у зовнішній пам'яті;</li>
          <li>Отримання записів на папері, кіноплівці.</li>
        </ul>
        <p>
          Графічні програми зазвичай використовуються разом зі сканерами,
          кольоровими принтерами, цифровими фотоапаратами та іншою апаратурою
          одержання й опрацювання зображень. Для роботи з растровими (точковими)
          зображеннями призначені растрові редактори (Adobe Photoshop, Согel
          Photo Раіnt, Раіnt та ін.). Для створення векторних зображень існують
          векторні редактори (СогеlDRAW, Аdobe Illustrator, Хага та ін.). Відомо
          багато форматів для запису графічних зображень у файл. Існують
          растрові формати, які використовуються для збереження растрових
          зображень (розширення файлів ВМР, РСХ, ТІFF, GIF, JPG та ін.);
          векторні формати (розширення СGМ, СDR, WMF, ЕМF); метафайлові формати,
          які підтримують обидва види графіки (WPG, СGМ).
        </p>
        <p>
          Графічні редактори, як правило, мають змогу працювати з графічними
          файлами кількох форматів, конвертувати файли з одного формату в інший.
          Середовище графічного редактора (ГР)
        </p>
        <p>
          Інтерфейс більшості графічних редакторів організується таким чином. З
          лівого боку екрана розташовується набір піктограм (умовних малюнків)
          із зображенням інструментів, якими можна користуватися в процесі
          редагування зображень. У нижній частині екрана палітра, з якої
          користувач вибирає фарби необхідного кольору. Частина екрана, що
          лишилася, являє собою порожнє «полотно» (робоче поле). Над робочим
          полем знаходиться меню, що дає змогу змінювати режими роботи. На
          лівому краю палітри виводиться квадрат, забарвлений в фоновий колір. У
          ньому вміщуються ще два квадрати, з яких верхній забарвлено в перший
          робочий колір, а нижній — у другий робочий колір. Як приклад
          розглянемо призначення графічних примітивів та правила роботи у
          графічному редакторі Раіnt для Windows. Рисунки на Web-сторінках
          бувають різні: маленькі кнопки, великі рекламні
          кнопки-«вивіски»(банери), елементи фону тощо. На відміну від тексту
          малюнки — досить об'ємні, «важкі» елементи, які впливають на швидкість
          завантаження сторінок. Мережа визнає малюнки тільки трьох форматів:
          GIF, PNG, JPG. Перші два формати ідеальні для створення невеликих
          оформлювальних елементів — кнопок, заголовків, «шапок», третій — для
          більших зображень (наприклад, фото). Формат GIF дає змогу «втиснути» в
          одну картинку одразу кілька.
        </p>
      </div>
      <div id="6">
        <h3>
          Структурна схема обчислювальної машини першого покоління. Призначення
          вузлів.
        </h3>
        <p>
          Розвиток ЕОМ поділяється на кілька періодів. Покоління ЕОМ кожного
          періоду відрізняються один від одного елементною базою і математичним
          забезпеченням. Перше покоління (1945-1954) - ЕОМ на електронних лампах
          (на кшталт тих, що були в старих телевізорах). Це доісторичні часи,
          епоха становлення обчислювальної техніки. Більшість машин першого
          покоління були експериментальними пристроями і будувалися з метою
          перевірки тих чи інших теоретичних положень. Вага та розміри цих
          комп'ютерів, які нерідко вимагали для себе окремих будівель, давно
          стали легендою. Введення чисел вперше машини проводився за допомогою
          перфокарт, а програмне управління послідовністю виконання операцій
          здійснювалося, наприклад в ENIAC, як у лічильно-аналітичних машинах,
          за допомогою штекерів і набірних полів. Хоча такий спосіб
          програмування і вимагав багато часу для підготовки машини, тобто для
          з'єднання на набірному полі (комутаційної дошці) окремих блоків
          машини, він дозволяв реалізовувати лічильні "здібності" ENIAC'а і тим
          вигідно відрізнявся від способу програмної перфострічки, характерного
          для релейних машин . Солдати, приписані до цієї величезної машині,
          постійно носилися вогруг неї, скриплячи візками, доверху набитими
          електронними лампами. Варто було перегоріти хоча б одній лампі, як
          ENIAC тут же вставав, і починалося сум'яття: всі спішно шукали згорілу
          лампу. Однією з причин - можливо, і не дуже достовірною - настільки
          частої заміни ламп вважалася така: їх тепло і світіння залучали
          метеликів, які залітали всередину машини і викликали коротке
          замикання. Коли всі лампи працювали, інженерний персонал міг
          налаштувати ENIAC на яку-небудь завдання, вручну змінивши підключення
          6000 проводів. Всі ці дроти доводилося знову перемикати, коли вставала
          інше завдання.
        </p>
        <p>
          Першою серійно випускалася ЕОМ 1-го покоління став комп'ютер UNIVAC
          (Універсальний автоматичний комп'ютер). Розробники: Джон Мочлі і Дж.
          Преспер Еккерт. Він був першим електронним цифровим комп'ютером
          загального призначення. UNIVAC, робота зі створення, якого почалася в
          1946 році і завершилася в 1951-му, мав час складання 120 мкс, множення
          -1800 мкс і ділення - 3600 мкс. UNIVAC міг зберігати 1000 слів, 12000
          цифр з часом доступу до 400 мкс максимально. Магнітна стрічка несла
          120000 слів і 1440000 цифр. Введення / висновок здійснювався з
          магнітної стрічки, перфокарт і перфоратора.
        </p>
        <p>
          Програмне забезпечення комп'ютерів 1-го покоління складалося в
          основному із стандартних підпрограм.
        </p>
        <p>
          Машини цього покоління: "ENIAC", "МЕСМ", "БЕСМ", "IBM -701", "Стріла",
          "М-2", "М-3", "Урал", "Урал-2", "Мінськ -1 "," Мінськ-12 "," М-20 "та
          ін Ці машини займали велику площу, використали багато електроенергії і
          складалися з дуже великого числа електронних ламп. Наприклад, машина
          "Стріла" складалася з 6400 електронних ламп і 60 тис. штук
          напівпровідникових діодів. Їх швидкодія не перевищувало 2-3 тис.
          операцій у секунду, оперативна пам'ять не перевищувала 2 Кб. Тільки у
          машини "М-2" (1958) оперативна пам'ять була 4 Кб, а швидкодія 20 кВт.
        </p>
      </div>
      <div id="7">
        <h3>
          Поняття про сучасні засоби зберігання й опрацювання повідомлень. Носії
          повідомлень. Форми і способи подання повідомлень. Кодування
          повідомлень, за допомогою яких передається інформація.
        </h3>
        <p>
          Люди в своїй діяльності постійно зустрічаються з необхідністю
          опрацьовувати повідомлення. Читаючи книгу, розглядаючи предмети,
          людина обробляє, запам'ятовує, накопичує інформацію. Для того щоб
          інформація стала надбанням багатьох людей, необхідно мати змогу
          зберігати її. Однак мало навчитися зберігати інформацію, ще необхідно
          її опрацьовувати, одержувати нову інформацію та передавати її. На всіх
          етапах роботи з інформацією людина використовує різні пристрої:
          наприклад, датчики, компас, ваги, термометр, барометр тощо. Зібравши
          інформацію за допомогою різних датчиків, людина приступає до її
          опрацювання і перетворення.
        </p>
        <p>
          Одним із найефективніших сучасних засобів опрацювання інформації є
          комп'ютер. За допомогою комп'ютера вхідна інформація опрацьовується за
          певними алгоритмами, які складаються користувачем. Застосування
          комп'ютера як інструмента для роботи з інформацією багатогранні та
          різноманітні. Він дає змогу не лише працювати з відомими моделями
          об'єктів, але й допомагає їх вдосконалювати, а також створювати нові
          моделі об'єктів.
        </p>
        <p>
          Середовище, в якому зафіксовано повідомлення, називають носієм
          повідомлення.
        </p>
        <p>
          У «до комп'ютерні» часи повідомлення зберігали на різноманітних
          носіях: папері, картоні, фотокартках, кіноплівці, магнітній стрічці
          тощо. З появою перших комп'ютерів знайшли широке використання такі
          носії, як перфокарти та перфострічки. Нині ми користуємося різними
          носіями повідомлень: папір, фото- і кіноплівка, магнітна аудіо- та
          відео стрічка, магнітні і оптичні компакт-диски тощо. Носії інформації
          для комп'ютера поділяються на електронні, магнітні та оптичні. Серед
          магнітних дисків використовуються гнучкі і жорсткі.
        </p>
        <p>
          Гнучкі магнітні диски, або ГМД (FDD), дають змогу переносити
          інформацію з одного комп'ютера на ін­ший, а також зберігати
          інформацію, що не використовується на комп'ютері постійно.
          Випускаються дискети, як правило, з диском 3,5 дюйма та мають ємність
          1,44 Мбайта.
        </p>
        <p>
          Жорсткі магнітні диски, або вінчестери (HDD), є основним типом носіїв
          для тривалого зберігання інформації. Накопичувач включає власне
          магнітний диск, систему позиціонування і комплект магнітних головок;
          усе це розміщено в герметично закритому корпусі. Максимальна ємність
          жорстких дисків нині вже перевищила 200Гбайт.
        </p>
        <p>
          Оптичні диски (компакт-диски) вирізняються великою ємністю і
          надійністю. Інформація заноситься на диск за допомогою високоточного
          лазера. Компакт-диски застосовуються для збереження на них великих
          програм, енциклопедій, ігор, високоякісних аудіо- та відеозаписів.
          Існують СD-R, DVD-R — оптичні диски, на які можна здійснювати
          одноразовий запис, а також СD-RW, DVD-RW — оптичні диски, на які можна
          здійснювати багаторазовий запис. СD містять до 700 Мбайт, DVD до 4,5
          Гбайт інформації. Існують різні форми подання інформації — у
          символьному, текстовому, графічному вигляді. Є інші форми, наприклад,
          звукова, відео.
        </p>
        <p>
          Символьна форма подання повідомлень є найбільш простою, в ній кожний
          символ має якесь значення. Наприклад: червоне світло світлофора,
          показники повороту на транспортних засобах, ранковий крик півня, різні
          жести, скорочення і позначення у формулах тощо.
        </p>
        <p>
          У символьній формі використовуються букви, цифри, знаки, сигнали
          прапорцями, покажчики приладів тощо.
        </p>
        <p>
          Текстова форма подання є більш складною. Ця форма передбачає, що зміст
          повідомлення передається не окремими символами, а їх сполученням,
          порядком розміщення. Послідовно розміщені символи утворюють слова, які
          у свою чергу можуть утворювати речення.
        </p>
        <p>
          Текстові повідомлення використовуються у книжках, брошурах, газетах,
          журналах тощо.
        </p>
        <p>
          Графічна форма подання повідомлень, як правило, має найбільший об'єм.
          До цієї форми належать фотографії, картини, креслення, графіки тощо.
          Графічна форма найбільш інформативна.
        </p>
        <p>
          Повідомлення можна подавати одним із способів: літерами і знаками,
          жестами, нотами музики, малюнками, картинами, скульптурами,
          звукозаписом, кінофільмами тощо.
        </p>
        <p>
          Існує змога переходити від одного способу подання інформації до
          іншого.
        </p>
        <p>
          Як правило, подання повідомлення добирається так, щоб його передавання
          було якомога швидшим і надійнішим, а його опрацювання було якомога
          зручнішим для адресата. Тому часто до текстів додають уточнюючі
          рисунки, схеми, фотографії, і навпаки, до рисунків, схем, фотографій —
          пояснюючі тексти.
        </p>
        <p>
          Важливо також, щоб повідомлення по можливості було коротшим, тобто
          його можна було якомога швидше прийняти і опрацювати, і разом з тим,
          за його допомогою можна було передати якомога більше інформації. До
          такого типу повідомлень відносять, як правило, графічні образи з
          відповідними короткими текстовими поясненнями — географічні карти,
          схеми, креслення, таблиці, діаграми, спеціальні коди тощо.
        </p>
        <p>Щоб передати інформацію, її необхідно певним чином закодувати.</p>
        <p>
          Кодування повідомлень — це перетворення повідомлень без зміни його
          змісту на інший вигляд за допомогою певного коду.
        </p>
        <p>Код — це набір правил перетворення для кодування.</p>
        <p>
          Одне і те саме повідомлення можна кодувати по-різному. Однією із
          систем кодування є азбука. Можна кодувати і звуки. Однією з таких
          систем кодування є ноти. Зберігати можна не тільки текстову та звукову
          інформацію. У вигляді кодів зберігаються і зображення. Якщо розглянути
          малюнок через збільшувальне скло, то видно, що він складається із
          точок. Координати кожної точки можна запам'ятати у вигляді чисел.
          Колір кожної точки також можна запам'ятати у вигляді чисел. Такі числа
          можуть зберігатися у пам'яті комп'ютера і передаватися на відстані.
          Таким чином, коли на комп'ютері опрацьовується зображення, то
          насправді комп'ютерні програми змінюють числа, якими окремі точки
          зображення подані в пам'яті комп'ютера. Для подання та опрацювання
          інформації в комп'ютері використовують двійкові коди, що вміщують лише
          два символи — 0 і 1. Біт — найменша одиниця двійкового коду.
        </p>
        <p>
          Байт — це послідовність з 8 бітів. Загальна кількість різних
          комбінацій двійкових значень у байті дорівнює 28=256. для кодування
          різних символів та для їх зберігання в запам'ятовуючих пристроях
          комп'ютера найчастіше використовують американський стандартний код для
          обміну інформацією — АSCII, який являє собою стандартну таблицю
          кодування знаків.
        </p>
      </div>
      <div id="8">
        <h3>
          Багаторівнева пам’ять обчислювальної системи. Її види. Упорядкувати по
          наступним умовам:
        </h3>
        <p>
          • Збільшує ємність • Збільшує час доступу • Зменшує вартість
          зберігання одного біту інформації
        </p>
      </div>
      <div id="9">
        <h3>
          Структура інформаційної системи: апаратна та інформаційна складові, їх
          взаємодія.
        </h3>
        <p>
          Інформаційна система — це взаємопов'язана сукупність при­строїв,
          методів і персоналу для обробки інформації.
        </p>
        <p>
          Інформаційна система забезпечує приймання інформації, її перетворення
          (кодування), обробку, збереження і передачу ре­зультатів обробки
          споживачу: людині, тварині, рослині, машині, іншій інформаційній
          системі. Прикладом сучасної інформаційної системи може бути ре­дакція
          газети або журналу, оснащена комп'ютерною технікою.
        </p>
        <p>В інформаційній системі відбуваються такі процеси:</p>
        <ul>
          <li>Введення інформації від джерел інформації;</li>
          <li>Обробка (перетворення) інформації;</li>
          <li>Зберігання вхідної і обробленої інформації;</li>
          <li>Виведення інформації для підправлення користувачу;</li>
          <li>
            Можливе введення інформації від користувача через зво­ ротний
            зв'язок.
          </li>
        </ul>
        <p>
          У сучасній інформаційній системі комп 'ютер відіграє роль
          апаратно-програмної частини. Складові частини комп'ютерної системи
        </p>
        Апаратна частина
        <p>
          (Нагdwаге, «тверда частина» — «залізо») Складається із з'єднаних між
          собою різноманітних при­строїв, які можна побачити.
        </p>
        <ul>
          <li>Процесор</li>
          <li>Запам'ятовуючі при­строї</li>
          <li>Зовнішні пристрої введення-виведення</li>
          <li>Контролери зовнішніх пристроїв</li>
          <li>Засоби зв'язку</li>
        </ul>
        Програмне забезпечення(ПЗ)
        <p>
          (Software, «м'яка частина») Складається із набору різ­номанітних
          програм, які керують роботою комп 'ютера, підтримують діалог з
          кори­стувачем, обробляють різно­манітну інформацію, допома­гають
          створювати різнома­нітні програми.
        </p>
        Системне ПЗ:
        <ul>
          <li>операційна система</li>
          <li>системи програму­вання</li>
          <li>програми технічного обслуговування</li>
        </ul>
        Прикладне ПЗ:
        <ul>
          <li>ПЗ загального приз­начення</li>
          <li>ПЗ спеціальногопризначення</li>
        </ul>
        <p>
          Апаратна частина не може виконувати операції з обробки ін­формації без
          різноманітних програм, завдяки яким пристрої ви­конують свої функції.
          Для забезпечення працездатності комп'ютера і виконання певної роботи
          потрібна сукупність про­грам, яка створює його програмне забезпечення.
        </p>
        <p>
          Програмне забезпечення здійснює керування пристроями комп'ютера під
          час введення, обробки, виведення і зберігання інформації, створює
          умови для роботи користувача на комп'ютері тощо.
        </p>
      </div>
      <div id="10">
        <h3>Дисплей. Основні характеристики. Види.</h3>
        <p>
          Дисплей призначено для відображення інформації на екрані
          електронно-променевої трубки. Дисплей керується відеоконтролером, який
          знаходиться в системному блоці. Відеоконтролер має власну пам'ять, яку
          ще називають відеопам'яттю. Відеоконтролер задає текстовий або
          графічний режим роботи.
        </p>
        <p>
          Дисплеї бувають монохромними та кольоровими. Вони можуть працювати в
          одному з двух режимiв: текстовому або графiчному.
        </p>
        <p>Текстовий режим.</p>
        <p>
          В текстовому режимi екран дисплея умовно подiяють на окремi дiлянки -
          знакомiсця, частiше всього на 25 рядкiв по 80 символiв (знакомiсць). В
          кожне знакомiсце може бути виведений один iз 256 заздалегiть заданих
          символiв. В число цих символiв входять великi та маленькi латинськi
          букви, цифри та сиволи:
        </p>
        <p>~ ! @ # $ % ^ &amp; * ( ) _ + | {} [ ] : ; " &lt; &gt; , . ? /</p>
        <p>
          а також псевдографiчнi символи, якi використовують для виведення на
          екран таблиць та дiаграм, побудови рамок навколо дiлянок екрана та
          iнші. В число символiв, якi зображуються на екранi в текстовому
          режимi, можуть входити i символи кирилицi (букви української абетки).
        </p>
        <p>
          На кольорових дисплеях кожному знакомiсцю може вiдповiдати свiй колiр
          символа i свiй колiр фону, що дозволяє виводити гарнi кольоровi написи
          на екран.
        </p>
        <p>Графiчний режим.</p>
        <p>
          Графiчний режим дисплея призначений для виведення на екран будь-якого
          зображення, елементами цього зображення є точки (пікселі).
        </p>
        <p>Основні характеристики дисплея такі:</p>
        <ul>
          <li>роздільна здатність;</li>
          <li>кількість кольорів (палітра);</li>
          <li>розмір екрана.</li>
        </ul>
        <p>
          Кiлькiсть крапок по горизонталi та вертикалi називається роздільною
          здатнiстю дисплея в даному режимi. Наприклад, вираз "роздільна
          здатнiсть 640х200" означає, що дисплей в даному режимi виводить 640
          крапок по горизонталi i 200 крапок по вертикалi.
        </p>
        <p>
          Слiд зауважити, що дозволена здатнiсть не залежить вiд розмiру екрана
          дисплея, подiбно тому як i великий, так i маленький телевiзори мають
          на екранi 625 рядкiв розгортки зображення.
        </p>
      </div>
      <div id="11">
        <h3>
          Упорядкування даних в середовищі табличного процесора. Використання
          фільтрів. Приклади.
        </h3>
        <p>
          Операції упорядкування і фільтрації даних в електронних таблицях (ЕТ)
          аналогічні упорядкуванню і фільтрації в базах даних. Щоб ці операції
          були можливі в ЕТ, таблиця повинна мати вигляд списку. Список
          складається із записів (рядків), що мають ті самі поля (стовпці).
          Прикладом списку може бути телефонний довідник, у якому кожен окремий
          запис-рядок відповідає конкретному абоненту, а полями-стовпцями є
          Прізвище, ім'я по батькові, Адреса, Телефон.
        </p>
        <p>
          Упорядкування даних в електронних таблицях виконується сортуванням.
        </p>
        <p>
          Сортування — це зміна відносного положення даних у списку відповідно
          до значення чи типу даних. Дані звичайно сортуються за алфавітом,
          чисельним значенням або датою. Опишемо порядок сортування, прийнятий у
          Ехсеl за замовчуванням. Якщо вмістом комірок є числа, то вони
          сортуються в порядку зростання: від найменшого від'ємного до
          найбільшого додатного числа. Якщо в комірки записано текст, то при
          сортуванні порівнюється вміст комірок за символами зліва направо.
          Наприклад, слово "якір" буде поміщено після слова "кір", а слово
          "Судан" - після слова "судак" (на регістр при сортуванні не зважають).
        </p>
        <p>
          Для сортування таблиці клацніть по будь-якій її непорожній комірці і
          натисніть на одну з кнопок на панелі інструментів : Сортировка по
          возрастанию або Сортировка по убыванию. При натисканні на зазначені
          кнопки сортування здійснюється по крайньому лівому полю (наприклад, по
          стовпцю А).При цьому виконуватиметься сортування суцільної частини
          таблиці, що не має порожніх рядків чи стовпців. Рядки
          переставлятимуться повністю. Заголовки (підписи) стовпців у процес
          сортування за замовчуванням не потрапляють.
        </p>
        <p>
          Якщо треба виконати сортування по довільному стовпцю чи по кількох
          стовпцях, то потрібно клацнути мишею по довільній комірці таблиці і
          вибрати команду меню Данные — Сортировка. У діалозі, що відкрився,
          визначаємо черговість полів, по яких виконуватиметься сортування.
        </p>
        <p>Однією з найпоширеніших операцій над списками є фільтрація.</p>
        <p>
          Фільтрація являє собою виділення певних записів, що задовольняють
          задані критерії Результатом фільтрації є створоння списку з
          відфільтрованих записів. У Ехсеl передбачено два режими фільтрації:
        </p>
        <ul>
          <li>Автофильтр</li>
          <li>Расширенный фильтр.</li>
        </ul>
        <p>
          Розглянемо режим автофільтру. Клацніть по довільній комірці списку,
          який підлягає фільтрації, і виконайте команду меню Дані — Фільтр —
          Автофільтр. Праворуч від назви кожного стовпця з'явиться кнопка зі
          списком, що розкривається. Список кнопки відкривають позиції Всі,
          Перші 10..., Умова..., потім йдуть елементи стовпця, розміщені за
          абеткою. Прокрутивши список, ви можете дібрати необхідний критерій.
          Зазначимо, що позиція Умова дає змогу задати точні критерії для
          фільтрації. Відразу після вибору критерію на екрані залишаться лише
          записи, що пройшли фільтрацію, а інші записи будуть приховані. Для
          скасування процедури фільтрації треба ввійти в меню. Дані — Фільтр і
          забрати галочку з команди Автофільтр.
        </p>
        <p>
          Розширений фільтр дає змогу оформити критерій для фільтрації у вигляді
          таблиці і вивести відфільтровані записи в будь-який діапазон робочого
          аркуша. Порядок створення фільтра такий. Спочатку треба створити
          таблицю-критерій. Для цього під початковою таблицею вводяться точні
          назви стовпців, за якими мають виконати фільтрацію. Наступним рядком
          під назвами введіть із клавіатури критерії добору. Як критерії можуть
          виступати текстові записи, що збігаються зі значеннями комірок (для
          стовпців з текстом), числа або умови, що містять оператори порівняння
          (для стовпців з числами). Активізуйте будь-яку комірку початкової
          таблиці і виконайте команду Дані — Фільтр — Розширений фільтр. У
          результаті з'явиться діалог Розширений фільтр, у якому треба задати
          параметри розширеного фільтра. Результат фільтрації за замовчуванням
          буде розміщений на місці початкової таблиці. Якщо ви хочете, щоб
          результат був поміщений в іншому місці аркуша чи Робочої книги, то
          клацніть по перемикачу Скопіювати результат в інше місце. Потім у
          нижнє текстове поле введіть діапазон вставки відфільтрованої таблиці.
          Для цього дійте аналогічно тому, як вводився діапазон таблиці-критерію
          (див. вище).
        </p>
        <p>
          Скасувати дію розширеного фільтра можна командою Дані — Фільтр -
          Показати все. При цьому повертається стан таблиці до фільтрації, але
          таблиця-критерій також буде присутня.
        </p>
      </div>
      <div id="12">
        <h3>
          Носії інформації для обчислювальних систем. Види. Особливості. Основні
          характеристики.
        </h3>
        <p>
          Носії інформації - Матеріал, який призначений для запису, зберігання
          та подальшого відтворення інформації.
        </p>
        <p>
          Носій інформації - Строго певна частина конкретної інформаційної
          системи, що служить для проміжного зберігання або передачі інформації.
        </p>
        <p>Носій інформації - Це фізичне середовище, в якій вона фіксується.</p>
        <p>
          У ролі носія можуть виступати папір, фотоплівка, клітини мозку,
          перфокарти, перфострічки, магнітні стрічки і диски або комірки пам'яті
          комп'ютера. Сучасна техніка пропонує все нові і нові різновиди носіїв
          інформації. Для кодування інформації в них використовуються
          електричні, магнітні та оптичні властивості матеріалів. Розробляються
          носії, в яких інформація фіксується навіть на рівні окремих молекул.
        </p>
        <p>
          У сучасному суспільстві можна виділити три основні види носіїв
          інформації:
        </p>
        <ul>
          <li>
            <p>
              Перфораційні - мають паперову основу, інформація заноситься у
              вигляді пробивок у відповідному рядку і стовпці. Обсяг інформації
              - 800 біт або 100 КБ;
            </p>
          </li>
          <li>
            <p>
              Магнітні - для них використовуються гнучкі магнітні диски і
              касетні магнітні стрічки;
            </p>
          </li>
          <li>
            <p>Оптичний.</p>
          </li>
        </ul>
        <p>До носіїв інформації відносять:</p>
        <ul>
          <li>
            <p>магнітні диски;</p>
          </li>
          <li>
            <p>
              магнітні барабани - Ранній різновид комп'ютерної пам'яті, що
              широко використовувалася в 1950-1960. Винайдено Густавом Таушеком
              в 1932 в Австрії. Надалі магнітний барабан був витіснений пам'яттю
              на магнітних сердечниках.
            </p>
          </li>
          <li>
            <p>
              дискети - Портативний магнітний носій інформації, використовуваний
              для багатократного запису і зберігання даних порівняно невеликого
              обсягу. Запис і зчитування здійснюється за допомогою спеціального
              пристрою - дисковода;
            </p>
          </li>
          <li>
            <p>
              магнітні стрічки - Носій магнітного запису, що представляє собою
              тонку гнучку стрічку, що складається з основи і магнітного
              робочого шару;
            </p>
          </li>
          <li>
            <p>
              оптичні диски - Носій інформації в вигляді диска з отвором в
              центрі, інформація з якого зчитується за допомогою лазера.
              Спочатку компакт-диск був створений для цифрового зберігання
              аудіо, проте в даний час широко використовується як пристрій
              зберігання даних широкого призначення;
            </p>
          </li>
          <li>
            <p>
              flash пам'ять - Різновид твердотільної напівпровідникової
              незалежної перезаписуваної пам'яті. Флеш-пам'ять може бути
              прочитана скільки завгодно раз, але писати в таку пам'ять можна
              лише обмежене число раз (зазвичай близько 10 тисяч разів).
              Стирання відбувається ділянками, тому не можна змінити один біт
              або байт без перезапису всієї ділянки.
            </p>
          </li>
        </ul>
        <p>Всі носії можна розділити на:</p>
        <ul>
          <li>
            <p>Людиночитаємі (документи).</p>
          </li>
          <li>
            <p>
              Машиночитні (машинні) - для проміжного зберігання інформації
              (диски).
            </p>
          </li>
          <li>
            <p>
              Людиномашиночитні- комбіновані носії вузькоспеціального
              призначення (бланки з магнітними смужками).
            </p>
          </li>
        </ul>
        <p>
          Однак швидкий розвиток засобів обчислювальної техніки стерло грань між
          1ої і 3ей групою - з'явився сканер, який дозволяє вводити інформацію з
          документів в пам'ять ЕОМ.
        </p>
        <p>
          Всі наявні в даний час носії інформації можуть поділятися за різними
          ознаками. В першу чергу, слід розрізняти :
        </p>
        <ul>
          <li>енергозалежні</li>
          <li>енергонезалежні накопичувачі інформації.</li>
        </ul>
        <p>
          Енергонезалежні накопичувачі, які використовуються для архівування і
          збереження масивів даних, поділяють:
        </p>
        <p>по виду запису:</p>
        <ul>
          <li>
            <p>Магнітні накопичувачі (жорсткий диск, дискета, змінний диск);</p>
          </li>
          <li>
            <p>Магнітно-оптичні системи, звані також МО;</p>
          </li>
          <li>
            <p>
              Оптичні, такі, як CD (Compact Disk, Read Only Memory) або DVD
              (Digital Versatile Disk);
            </p>
          </li>
        </ul>
        <p>по способам побудови:</p>
        <ul>
          <li>
            <p>
              Обертається пластина або диск (як у жорсткого диска, дискети,
              змінного диска, CD, DVD або Mо);
            </p>
          </li>
          <li>
            <p>Стрічкові носії різних форматів;</p>
          </li>
          <li>
            <p>
              Накопичувачі без рухомих частин (наприклад, Flash Card, RAM
              (Random Access Memory), що мають обмежену сферу застосування через
              відносно невеликі обсяги пам'яті в порівнянні з вищеназваними).
            </p>
          </li>
        </ul>
        <p>
          Якщо потрібно швидкий доступ до інформації, як, наприклад, при
          виведенні або передачі даних, то використовуються носії з обертовим
          диском. Для архівування, виконуваного періодично (Backup), навпаки,
          більш переважними є стрічкові носії. Вони мають великі обсяги пам'яті
          в поєднанні з невисокою ціною, правда, при відносно невисокій
          швидкодії.
        </p>
        <p>За призначенням носії інформації різняться на три групи:</p>
        <ul>
          <li>
            <p>
              поширення інформації: Носії з попередньо записаною інформацією,
              такі як CD ROM або DVD-ROM;
            </p>
          </li>
          <li>
            <p>
              архівування: Носії для одноразової запису інформації, такі як CD-R
              або DVD-R (R (record able) - для запису);
            </p>
          </li>
          <li>
            <p>
              резервування (Backup) або передача даних: Носії з можливістю
              багаторазового запису інформації, такі як дискети, жорсткий диск,
              MO, CD-RW (RW (rewritable) - перезапису і стрічки.
            </p>
          </li>
        </ul>
      </div>
      <div id="13">
        <h3>
          Основні складові апаратної частини інформаційної системи, їх
          функціональне призначення..
        </h3>
        <p>
          Аналіз апаратної складової інформаційної системи зручно робити,
          використовуючи структурну схему комп'ютера. Під структурною
          організацією комп'ютерів розуміють їх деяку фізичну модель, яка
          відображає склад, порядок і принципи взаємодії основних функціональних
          модулів без деталей їх технічної реалізації. Проаналізуємо будову
          персонального комп'ютера (ПК) на логічному рівні. У структурі ПК
          виділяють центральні та зовнішні пристрої. До центральних пристроїв
          відносять мікропроцесор та основну пам'ять, яку ще називають
          внутрішньою. Зовнішні пристрої часто називають периферійними.
        </p>
        <p>
          Ядром обчислювального процесу в комп'ютері є його мікропроцесор.
          Мікропроцесор (МП) — це мікросхема (надвелика інтегральна схема,
          chip), яка керує роботою всіх апаратних компонентів комп'ютера,
          забезпечує виконання програм, виконує арифметичні та логічні операції.
        </p>
        <p>
          Оперативна пам'ять (ОП) призначена для зберігання даних та програм
          протягом одного сеансу роботи з комп'ютером (від моменту включення
          комп'ютера до моменту його виключення). В ОП інформацію можна заносити
          та читати з неї. У ній зберігаються дані, з якими ведеться оперативна
          робота, та програми для їх обробки.
        </p>
        <p>
          У постійній пам'яті (ПП) містяться програми, які забезпечують
          функціонування обчислювальної системи (зокрема, програми початкового
          завантаження комп'ютера та тестування його складових) та деякі
          програми з базового програмного забезпечення комп'ютера. Цю пам'ять
          називають постійною тому, що інформація в ній зберігається після
          виключення комп'ютера. Вона є енергонезалежною, але команди, які в ній
          зберігаються, починають виконуватися при поступленні першого імпульсу
          струму після вмикання комп'ютера. ПП «прошивається» інформацією на
          етапі її виготовлення. З постійної пам'яті інформацію можна лише
          читати, записати туди користувач нічого не може.
        </p>
        <p>
          ОП і ПП утворюють основну пам'ять. Основна пам'ять комп'ютерів
          складається з окремих комірок, в кожну з яких вміщається інформація
          величиною в 1 байт. Усі комірки пам'яті нумеруються, починаючи з нуля;
          номери комірок пам'яті називаються їх адресами.
        </p>
        <p>
          Технічною реалізацією запам'ятовую'чих пристроїв для організації
          основної пам'яті є мікросхеми пам'яті. Кеш-пам'ять — це невелика за
          розміром буферна пам'ять, яка дозволяє пришвидшувати процеси обміну
          даними між МП і ОП за рахунок значно меншого, ніж до ОП, часу доступу
          до даних та розташування в ній даних, які найчастіше використовуються.
        </p>
        <p>
          Системна магістраль — це сукупність шин для обміну даними, адресами та
          керуючими сигналами між центральними та зовнішніми пристроями. Кожна
          шина — це деяка кількість паралельних ліній (ця кількість визначає
          розрядність шини), по яких у вигляді електричних сигналів передається
          інформація від одного пристрою до іншого.
        </p>
        <p>
          Інтерфейси блоки використовуються для узгодження роботи центральних та
          зовнішніх пристроїв. Вони здійснюють перетворення сигналів, які
          передаються через системну магістраль в сигнали, які забезпечують
          роботу відповідного зовнішнього пристрою, здійснюють буферизацію
          даних. Технічною реалізацією інтерфейсних блоків є контролери,
          адаптери, відеоплати, синтезатори звуку тощо.
        </p>
        <p>До основних зовнішніх пристроїв належать:</p>
        <ol>
          <li>
            <p>клавіатура — пристрій для введення символьної інформації;</p>
          </li>
          <li>
            <p>
              монітор — пристрій для відображення на екрані текстової та
              графічної інформації. Монітори бувають монохромні та кольорові.
              Основними характеристиками моніторів є:
            </p>
          </li>
        </ol>
        <ul>
          <li>
            параметри текстових режимів роботи (кількість символів в рядку та
            кількість рядків);
          </li>
          <li>
            параметри графічних режимів (роздільна здатність, глибина кольору —
            кількість бітів, яка необхідна для запам'ятовування коду кольору
            однієї точки);
          </li>
          <li>частота вертикальної розгортай;</li>
          <li>розміри по діагоналі;</li>
        </ul>
        <ol>
          <li>
            <p>
              ручний маніпулятор «мишка» — для вибору тих чи інших параметрів,
              режимів роботи, команд програм та для керування роботою рухомих
              об'єктів на екрані монітора;
            </p>
          </li>
          <li>
            <p>
              накопичувані на гнучких магнітних дисках (дисководи) для читання
              та запису даних на дискети;
            </p>
          </li>
          <li>
            <p>
              накопичувачі на жорстких магнітних дисках для читання та запису
              інформації на жорсткі магнітні диски («вінчестери»);
            </p>
          </li>
          <li>
            <p>
              CD-ROM — пристрій для читання інформації із компакт-дисків
              (оптичних дисків);
            </p>
          </li>
          <li>
            <p>
              принтер — пристрій для роздрукування інформації на папері (часом
              на інших носіях). За принципом роботи розрізняють матричні,
              струменеві та лазерні принтери. До основних характеристик
              принтерів відносять швидкість друку (кількість надрукованих
              аркушів за 1 хвилину) та роздільну здатність (кількість відбитих
              точок на відрізку завдовжки 1 дюйм);
            </p>
          </li>
          <li>
            <p>
              сканер — пристрій для отримання електронних копій текстових та
              графічних документів;
            </p>
          </li>
          <li>
            <p>плотер — пристрій для побудови графічних зображень на папері;</p>
          </li>
          <li>
            <p>
              стример — пристрій для збереження інформації на магнітних
              стрічках;
            </p>
          </li>
          <li>
            <p>
              модем — пристрій для підключення комп'ютерів до мереж за допомогою
              телефонних ліній.
            </p>
          </li>
        </ol>
      </div>
      <div id="14">
        <h3>Пристрої для вводу інформації в обчислювальній системі. Види.</h3>
        <p>Пристрої введення:</p>
        <ul>
          <li>Клавіатура</li>
          <li>«Миша»</li>
          <li>Сканер</li>
          <li>Цифрові камери</li>
          <li>Мікрофон</li>
        </ul>
        <p>Клавіатура</p>
        <p>
          Клавіатура - це стандартний пристрій введення числової і текстової
          інформації, а також команд управління. Клавіатура відноситься до
          стандартних засобів ПК і не потребує підтримки спеціальними системними
          програмами. Інформація вводиться у вигляді алфавітно-цифрових
          символьних даних.
        </p>
        <p>Види клавіатур:</p>
        <ul>
          <li>
            Мембранні У них натискання клавіш призводить до дотику двох мембран,
            через які проходить слабкий струм.
          </li>
          <li>
            Механічні Механічні клавіатури засновані на механічних перемикачах
            (найбільш якісні).
          </li>
        </ul>
        <p>"Миша"</p>
        <p>
          "Миша" - пристрій «графічного» управління. При переміщенні миші по
          килимку на екрані переміщається покажчик миші, за допомогою якого
          можна указувати на об'єкти і / або вибирати їх. Використовуючи клавіші
          миші, можна задати той чи інший тип операції з об'єктом.
        </p>
        <p>Сканер</p>
        <p>
          Сканер - пристрій введення, яке переводить документи (текст, графіка)
          в цифрову інформацію, що розуміється комп'ютером. Сканери бувають двох
          типів:
        </p>
        <ul>
          <li>Ручні</li>
          <li>Планшетні.</li>
        </ul>
        <p>Цифрові камери і фотоапарати</p>
        <p>
          Цифрові відеокамери і фотоапарати, пристрої дозволяють отримувати
          відеозображення і фотознімки безпосередньо в цифровому форматі і мають
          пам'ять аналогічну комп'ютерної. Завдяки цьому зображення відразу
          можна вводити в комп'ютер для зберігання на жорсткому диску, або для
          перетворення, або для передачі по комп'ютерних мережах.
        </p>
        <p>Мікрофон</p>
        <p>
          Мікрофон - використовується для введення звукової інформації,
          підключається до входу звукової карти.
        </p>
      </div>
      <div id="15">
        <h3>
          Системи опрацювання текстів, їх функції. Середовище текстового
          процесора, його призначення та система вказівок. Відкриття та
          збереження документу. Введення тексту, його редагування і
          форматування. Перевірка правопису.
        </h3>
        <p>
          Текстовими редакторами (ТР) або текстовими процесорами називають
          програми для роботи з різними видами текстів (службовими паперами,
          конспектами лекцій, газетами, журналами, книгами). Серед професійних
          ТР найпоширеніші Microsoft Word, Лексикон, Multiedit.
        </p>
        <p>Текстові процесори реалізують чотири основні функції:</p>
        <ul>
          <li>Функцію введення.</li>
          <li>Функцію перегляду.</li>
          <li>Функцію опрацювання.</li>
          <li>Функцію відтворення тексту.</li>
        </ul>
        <p>
          Для різних операцій з текстовими документами призначено спеціалізовані
          додатки: настільні видавничі системи (створення оригіналів-макетів для
          друку на виробництві); програми-коректори (для опрацювання різного
          роду помилок); програми-розпізнавання (переклад від сканованих текстів
          у символьну форму); програми-перекладачі; електронні словники.
        </p>
        <p>Середовище текстового процесора.</p>
        <p>
          Робоче поле ТП — це екран дисплея, на якому відображаються результати
          всіх дій, що виконуються за допомогою ТП. Важливим елементом
          середовища ТП є інтерфейс — це ті засоби, за допомогою яких користувач
          може управляти текстовим редактором. Нині найпопулярнішим є інтерфейс
          у формі меню, з якого спеціальним маркером (виділеним кольором) можна
          вибирати різні команди ТП.
        </p>
        <p>
          Одночасно з меню на екрані висвічується рядок стану, в якому дається
          інформація про поточний стан ТП (режими роботи, позиція курсору тощо).
        </p>
        <p>
          Текст, що опрацьовується за допомогою ТП, зберігається в оперативній
          пам'яті і візуально може бути поданий у вигляді рулону паперу
          (поділеного на сторінки у деяких ТП), довжина і ширина якого в
          більшості випадків не дозволяють цілком спостерігати його на екрані.
        </p>
        <p>
          Переміщуючи курсор, можна переміщувати вікно відносно тексту.
          Координати курсору в тексті (або на сторінці) — номери рядка і
          стовпчика, де знаходиться курсор — відображаються в рядку стану.
        </p>
        <p>Текстовий процесор (ТП) — це програма, що дає змогу:</p>
        <ul>
          <li>виконувати введення та редагування тексту;</li>
          <li>операції форматування тексту;</li>
          <li>вставлення малюнків і таблиць,</li>
          <li>перевірку правопису;</li>
          <li>автоматичне перенесення слів;</li>
          <li>складання змістів і безліч інших складних операцій.</li>
        </ul>
        <p>Систему команд (вказівок) ТП можна умовно поділити на такі групи:</p>
        <ul>
          <li>команди інтерфейсу;</li>
          <li>команди зміну стану ТП;</li>
          <li>команди переміщення по тексту;</li>
          <li>команди до символьного редагування;</li>
          <li>команди роботи з абзацами;</li>
          <li>пошук за зразком;</li>
          <li>копіювання;</li>
          <li>форматування.</li>
        </ul>
        <p>У більшості ТП команди можна виконати двома способами:</p>
        <ol>
          <li>за допомогою функціональних і управляючих клавіш;</li>
          <li>вибором пунктів меню</li>
        </ol>
        <p>
          Завантажити або відкрити раніше створений документ можна кількома
          способами:
        </p>
        <ul>
          <li>вказівкою Файл/Відкрити;</li>
          <li>кнопкою Відкрити панелі інструментів;</li>
          <li>
            комбінацією клавіш Ctrl+О. Потім у діалоговому вікні Відкриття
            документа вибрати у списку Папка потрібну папку та ім'я документа.
            Крім того, документ, з яким працювати недавно, можна відкрити,
            вибравши його ім'я у списку документів, що відображається у нижній
            частині вказівки Файл.
          </li>
        </ul>
        <p>
          Для збереження документа необхідно клацнути на значку Зберегти, або у
          меню Файл виконати команду Зберегти, потім ввести ім'я файлу і
          натиснути кнопку Зберегти або клавішу Еnter. Команда Зберегти як
          використовується, коли треба записати файл з новим ім'ям і у новій
          папці.
        </p>
        <p>
          Введення тексту в Microsoft Word виконується за допомогою клавіатури
          по місцерозташування текстового курсору. При натисканні клавіші Еnter
          у документ вставляється символ кінця абзацу. Для вилучення символів
          ліворуч від курсору використовується клавіша Васкsрасе, а праворуч —
          Delete. При наборі тексту слід дотримуватися певних правил.
        </p>
        <p>До засобів редагування текстових документів належать такі дії:</p>
        <ul>
          <li>перевірка правопису;</li>
          <li>перевірка граматики;</li>
          <li>знайти і замінити;</li>
          <li>
            російсько-український переклад окремих слів, речень і документів.
          </li>
        </ul>
        <p>
          Форматування документа дає змогу виконувати в текстовому процесорі
          Word операції верстки. Можуть виконуватися такі операції:
        </p>
        <ul>
          <li>
            встановлення параметрів сторінки: полів сторінки, розміру паперу,
            орієнтації тощо;
          </li>
          <li>розбивка на сторінки, розділи;</li>
          <li>
            вставка номерів сторінок, колонтитулів, виносок, закладок, приміток
            тощо;
          </li>
          <li>
            вставка або створення формул, малюнків, таблиць, відео чи звукових
            фрагментів;
          </li>
          <li>вставка назв ілюстрацій, перехресних посилань;</li>
          <li>формування сторінки змісту.</li>
        </ul>
        <p>
          При введенні тексту може автоматично перевірятися орфографія. Щоб,
          наприклад, перевірити український текст, необхідно виконати команду
          Сервіс/Мова/ Вибрати мову. У вікні Мова вибрати Український.
        </p>
        <p>
          При наборі слова після натискання на пропуск чи розділовий знак
          автоматично виконується процедура його порівняння із внутрішнім
          словником. Якщо слово не знайдено у словнику, воно підкреслюється
          червоною хвилястою лінією.
        </p>
        <p>
          Для перевірки орфографії всього документа треба виконати команду
          Сервіс/Правопис, або натиснути на кнопку Правопис на панелі
          інструментів, або натиснути клавішу F7.
        </p>
      </div>
      <div id="16">
        <h3>Операційна система. Призначення.</h3>
        <p>
          Операці́йна систе́ма, скорочено ОС (англ. operating system, OS) — це
          базовий комплекс програм, що виконує управління апаратною складовою
          комп'ютера або віртуальної машини; забезпечує керування обчислювальним
          процесом і організовує взаємодію з користувачем.
        </p>
        <p>
          Операційна система (ОС) - це програма, яка завантажується при
          включенні комп'ютера. Вона робить діалог із користувачем, здійснює
          управління комп'ютером, його ресурсами (оперативною пам'яттю, місцем
          на дисках і т.д.), запускає інші (прикладні) програми на виконання.
          Операційна система забезпечує користувачу і прикладним програмам
          зручний спосіб спілкування (інтерфейс) із пристроями комп'ютера.
          Загалом, вона грає роль сполучної ланки між апаратурою комп'ютера і
          виконуваними програмами, а також користувачем
        </p>
        <p>Відносно свого призначення, операційні системи бувають:</p>
        <ul>
          <li>універсальні (для загального використання);</li>
          <li>спеціальні (для розв'язання спеціальних задач);</li>
          <li>спеціалізовані (виконуються на спеціальному обладнанні);</li>
          <li>
            однозадачні (в окремий момент часу можуть виконувати лише одну
            задачу);
          </li>
          <li>
            багатозадачні (в окремий момент часу здатні виконувати більше однієї
            задачі);
          </li>
          <li>
            однокористувацькі (в системі відсутні механізми обмеження доступу до
            файлів та на використання ресурсів системи);
          </li>
          <li>
            багатокористувацькі (система впроваджує поняття «власник файлу» та
            забезпечує механізми обмеження на використання ресурсів системи
            (квоти)), всі багатокористувацькі операційні системи також є
            багатозадачними;
          </li>
          <li>
            реального часу (система підтримує механізми виконання задач
            реального часу, тобто такі, для яких будь які операції завжди
            виконуються за наперед передбачуваний і незмінний при наступних
            виконаннях час).
          </li>
        </ul>
      </div>
      <div id="17">
        <h3>
          Операційна система, її функції. Інтерфейс операційної системи та
          правила роботи з ним. Основні об'єкти, з якими працює операційна
          система. Типи вікон і правила роботи з ними. Піктограми, їх
          призначення.
        </h3>
        <p>
          Операційна система (ОС) — це набір управляючих програм, які
          забезпечують роботу обчислювальної системи, а саме:
        </p>
        <ul>
          <li>
            Здійснюють управління роботою апаратної і програмної складових
            обчислювальної системи, координують взаємодію ок­ремих частин цих
            складових.
          </li>
          <li>
            Дають змогу користувачеві здійснювати загальне управління
            обчислювальною системою на рівні заздалегідь занесених до
            запам'ятовуючих пристроїв машини програм
          </li>
          <li>
            ОС забезпечує взаємодію програм із зовнішніми пристроями та між
            собою; здійснює розподіл ресурсів оперативної пам'яті; виявляє різні
            ситуації, що виникають у процесі виконання про­грам, повідомляючи
            про них.
          </li>
        </ul>
        <p>
          Інтерфейс — засоби та сукупність команд ОС для здійснення діяльності
          користувача щодо опрацювання інформації засобами обчислювальної
          системи.
        </p>
        <p>
          Для спрощення доступу користувача до ресурсів комп'ютера операційна
          система підтримує інтерфейс користувача, який має високий рівень
          сервісу і звільняє користувача від безпосереднього «спілкування» з
          апаратурою. Інтерфейс користувача сучасних ОС (наприклад, Windows
          98/2000/ХР) називають ще графічним, Оскільки він дає змогу подавати
          команди операційній системі шляхом маніпулювання наочними графічними
          об'єктами (вікнами, меню; списками, кнопками тощо).
        </p>
        <p>
          Об'єкт - це будь-який елемент інтерфейсу користувача: значок, кнопка,
          меню, список, межа вікна, а також саме вікно тощо. Основними об'єктами
          в системи Windows є вікна, документи, папки, ярлики.
        </p>
        <p>
          Для збереження інформації на зовнішніх носіях система Windows
          організує інформацію у вигляді документів. Як правило документи
          створюються у конкретних прикладних програмах (додатках). Окремі
          документи складаються у папки, причому кожна папка може містити в собі
          як документи, так і вкладені папки.
        </p>
        <p>
          Папка в Windows — це сховище різних об'єктів: документів, інших папок,
          зразків дисків, принтерів тощо. Папки позначаються жовтим прямокутники
          із виступом у лівому верхньому куті. Серед усіх папок, записаних на
          диски комп'ютера, існують такі, що необхідні для роботи самої системи
          Windows. Ці папки називаються системними.
        </p>
        <p>
          Ярлик - це невеликий файл (розміром до 1 Кбайта), що містить
          картинку-піктограму і посилання на будь-який об'єкт (програму,
          документ, папку, принтер тощо)
        </p>
        <p>
          Вікнами називаються прямокутні ділянки на екрані, що призначені для
          введення інформації від користувача і виведення інформації, отриманої
          програмою.
        </p>
        <p>
          Вікна – це графічні, відображення програм (тобто Windows-додатків),
          які бачить Користувач на екрані.
        </p>
        <p>До основних типів вікон належать:</p>
        <ul>
          <li>
            <p>
              Прикладні — вікна прикладних програм (додатків) Windows для
              виконання певної роботи.
            </p>
          </li>
          <li>
            <p>Підлеглі—вікна, що викликаються із іншого вікна Windows</p>
          </li>
          <li>
            <p>
              Діалогові — додаткові вікна, для встановлення параметрів ко­манд.
            </p>
          </li>
          <li>
            <p>
              Інформаційні — вікна з інформацією про стан системи, пристроїв,
              хід виконання роботи, а також з попередженнями про аварійні
              ситуації.
            </p>
          </li>
        </ul>
        <p>
          Маніпулювати з вікнами можна, користуючись клавіатурою, а ще простіше
          — мишею. Наведемо основні операції з вікнами, що виконуються мишею.
        </p>
        <p>
          Активізація вікна здійснюється простим клацанням миші по полю
          всередині .вікна. Активне вікно розміщується зверху інших вікон,
          причому змінюється Підсвічування фону заголовка. Цього ж результату
          досягають натисканням кнопки програми на панелі задач: кнопка при
          цьому ніби заглиблюється.
        </p>
        <p>
          Переміщення вікна. Щоб перемістити вікно; розмістіть курсор миші у
          рядок заголовка, натисніть на кнопку миші та потягніть контур вікна у
          потрібний бік. Відпустіть кнопку миші й вікно займе нове положення.
        </p>
        <p>
          Зміна розмірів вікна. Розгорнути вікно на весь екран, віднови­ти його
          до попередніх розмірів, згорнути на панелі задач — усі ці операції
          виконуються за допомогою кнопок керування вікном. Для довільної зміни
          розмірів вікна потягніть покажчиком миші за будь-яку зі сторін
          обрамлення вікна (для зміни одного розмі­ру) чи за куток обрамлення
          (для одночасної зміни двох розмірів).
        </p>
        <p>
          Закриття вікна здійснюється клацанням по кнопці керування вікном,
          позначеній хрестиком, або комбінацією клавіш Alt+F4.
        </p>
        <p>
          Корисна команда Свернуть все окна. Вона дає змогу згорнути на панель
          задач усі вікна додатків та відкрити простір робочого стола. Ви можете
          користуватися цією командою, якщо треба швидше дістатися до будь-якого
          значка на робочому столі або до діалогу настроювання екрана.
        </p>
        <p>
          Windows дає можливість користувачу керувати комп'ютером за допомогою
          графічних символів. Такі символи називають піктограмами, значками або
          «іконками».
        </p>
        <p>
          Піктограми — це графічне зображення значком об'єкта, який знаходиться
          десь у файловій системі. Піктограмами зображаються дисководи для
          дискет і компакт-дисків, вінчестер, пристрої, папки, файли, засоби
          налагодження системи тощо.
        </p>
        <p>
          Щоб Windows виконав певну команду, досить вибрати потрібну піктограму
          і виконати відповідну дію мишею. Залежно від виду піктограми реакція
          на ці дії може бути різною.
        </p>
      </div>
      <div id="18">
        <h3>
          Поняття генерації, інсталяції, ініціалізації операційної системи.
        </h3>
        <p>
          При покупке вычислительной системы приобретается и программное
          обеспечение для выполнения тех функций, ради которых эта ВС и
          покупается. Как правило, в это ПО включены все необходимые программы
          для полной поддержки всех соответствующих аппаратурных составляющих и
          необходимых режимов работы приобретенной ВС. Таким образом, покупается
          исходный вариант операционной системы или дистрибутив. В него входят
          различные варианты драйверов для аппаратных компонент, а также
          программы для обеспечения различных режимов работы ВС. Это драйверы
          CD-ROMа, cетевых Ethernet карт, SCSI-устройств, Sound Blasterа,
          принтера и т.д. Причем в состав дистрибутива могут входить варианты
          драйверов для поддержки различных локальных шин (VESA, PCI) и
          аппаратных платформ. Кроме этого, дистрибутив имеет все необходимые
          программы, поддерживающие работу вычислительной системы в различных
          режимах работы, например, однопрограммном или многопрограммном,
          многопроцессорном, сетевом и поддержки различных сервисов (файловый,
          почтовый, удаленного терминала и т.п.).
        </p>
        <p>
          В реальных условиях эксплуатации, для нормального функционирования
          вычислительной системы, вся совокупность программ исходного ПО не
          нужна. Из всего их множества нужно выбрать некое подмножество
          программ, обеспечивающих работу вычислительной установки в
          установленных пользователем режимах и на имеющемся оборудовании.
          Процесс отбора из дистрибутива тех программных модулей, которые будут
          использоваться, называется генерацией операционной системы. Процесс
          генерации выполняется либо с использованием специального "языка
          генерации", либо с помощью организации диалога пользователя с
          системой, в результате которого определяются желания и требования
          пользователя к функционированию системы, а система в соответствии с
          этим определяет совокупность необходимых программ, поддерживающих эти
          требования.
        </p>
        <p>
          Место, где находится резиденция системы, называется " резидентным"
          томом, а сама система "резиденцией". Из всех программных модулей в
          резидентном томе, часть, используется по мере необходимости, а
          некоторые из них обеспечивающие базовое функционирование ВС составляют
          резидентные программы, постоянно находящиеся в системной области
          оперативной памяти. Совокупность программ, обеспечивающих
          функционирование ВС и находящихся в системной области оперативной
          памяти, составляет ядро супервизора.
        </p>
        <p>
          Некоторые программы, связанные с выполнением функций ОС, но не
          находящиеся постоянно в оперативной памяти называются транзитными. Эти
          программы вызываются в память по мере необходимости. Кроме этого,
          система позволяет пользователю по своему желанию определить некоторые
          программы как резидентные. Все остальные программы являются
          транзитами, вызываются динамически и могут занимать одно и то же место
          в оперативной памяти и затирать друг друга.
        </p>
        <p>
          При работе вычислительной системы пользователь может менять свои
          представления о режимах ее функционирования. Кроме этого может
          меняться и состав оборудования. Процесс локальной настройки ОС по
          желанию пользователя называется инсталляцией. Признаком, по которому
          можно отличить инсталляцию от генерации является то, что, если при
          настройке операционной системы не используется дистрибутив или он
          используется, но только для локальной добавления некоторых функций ?
          то это инсталляция. Если для изменения или добавления функций
          требуется дистрибутив и выполняется полная переустановка ОС ?
          генерация.
        </p>
        <p>
          При включении вычислительной системы выполняется загрузка ОС. Во время
          загрузки выполняется связывание и размещение всех частей, входящих в
          ядро супервизора в памяти ВС, т.е. размещение резидентных программ на
          своих местах, формирование специальных системных структур данных в
          области данных операционной системы, формирование постоянной области,
          активизацию задач для начала работы операционной системы. Этот процесс
          называется инициализацией операционной системы и выполняется в два
          этапа, сначала выполняется инициализация ядра, а затем инициализация
          системы.
        </p>
      </div>
      <div id="19">
        <h3>
          Робота з графічними об'єктами в середовищі текстового процесора.
          Вкорінення об'єктів з інших додатків. Приклади. Операційна система.
          Призначення.
        </h3>
        <p>
          До графічних об'єктів Word відносять малюнки, геометричні фігури,
          автофігури, а також фігурний текст. Ці об'єкти пропо­нують додаткові
          можливості з оформлення таких документів, як реферат, об'ява, листівка
          тощо.
        </p>
        <p>
          Малюнок, що вставляється в документ, може бути растровим (точковим) чи
          векторним.
        </p>
        <p>
          Растрові малюнки створюються за допомогою растрових графічних
          редакторів (Раіnt Рhotoshop та ін­ших), виконуються шляхом сканування
          фотографій чи зйомки на цифровий фотоапарат.
        </p>
        <p>
          Векторні малюнки створюються в програмах векторних графічних
          редакторів (СогеDraw, Illustrator та інших). Простий векторний
          редактор є й у Word.
        </p>
        <p>
          Для вставки малюнка поставте курсор у потрібне місце документа і
          виконайте команду Вставка — Рисунок — Картинки (вставка кліпу з
          колекції) або команду Вставка - Рисунок — С файла (вставка малюнка з
          файла). У наступних діалогах виберіть потрібний кліп чи файл.
        </p>
        <p>
          Вставлений малюнок потребує додаткового форматування. Так, щоб змінити
          розміри малюнка, клацніть мишею по ділянці малюнка і пересуньте один
          із граничних маркерів. Для задання обтікання малюнка текстом клацніть
          по малюнку правою кноп­кою миші й виберіть у контекстному меню команду
          Формат ри­сунки. У діалозі; що відкрився, перейдіть на вкладку
          Положення, визначте потрібну схему обтікання й клацніть по кнопці ОК.
        </p>
        <p>
          Графічні об'єкти(лінії, багатокутники, еліпси, зірки, стрілки тощо)
          створюються в документі Word за допомогою вмонтовано­го векторного
          редактора. Доступ до інструментів редактора від­кривається за
          допомогою панелі Рисование.
        </p>
        <p>
          За допомогою вбудованого засобу WordArtможна створювати художньо
          оформлений текст (нахилений, повернутий і розтягнутий текст, текст із
          тінню і текст, вписаний у певні фігури). Для створення тексту
          WordArtклацніть мишею в місці розміщення тексту і виберіть команду
          меню Вставка — Рисунок — Обьект WordArt або клацніть по кнопці
          Добавить абьект WordArt і на па­нелі інструментів Рисование. У
          наступних діалогах потрібно ви­брати варіант оформлення тексту і
          ввести сам текст, задавши гарнітуру і розмір шрифту.
        </p>
        <p>
          В документ Місгоsoft Word можна вставляти об'єкти, коли не­обхідно
          включити дані з файлів, які створені іншими програма­ми Місгоsoft
          Office або будь-якою програмою, яка підтримує зв'язані об'єкти і
          вкорінені об'єкти.
        </p>
        <p>
          Наприклад, щомісячний звіт про стан включає відомості, які містяться
          окремо, на аркуші Місгоsoft Ехсеl. У випадку створен­ня зв'язку звіту
          з аркушем дані у звіті будуть оновлюватися кожен раз при оновленні
          вихідного файла. У випадку вкорінення аркуша у звіт, звіт або кінцевий
          файл містять статистичну копію даних.
        </p>
        <p>
          Найзручніший спосіб помістити в документ Місгоsoft Word малюнки,
          діаграми чи яку-небудь іншу інформацію — внесення інформації у вигляді
          об'єкта. Внесений об'єкт можна перемішу­вати, масштабувати, копіювати
          чи видаляти як звичайний гра­фічний об'єкт Місгоsoft Word. Щоб
          викликати програму, за до­помогою якої був створений об'єкт, достатньо
          двічі натиснути на ньому мишкою.
        </p>
        <p>
          Такий додаток, як MS Graphдає змогу створювати в доку­ментах будь-які
          типи діаграм на основі введених до таблиці даних. Такі діаграми можна
          підписувати, змінювати їх розміри та міняти місце розташування.
          Дозволяється також редагувати та форматувати вбудовані до документу
          діаграми.
        </p>
        <p>
          Щоб вставити графіку чи діаграму в документ, необхідно спочатку
          помістити позицію введення до потрібного місця в до­кументі, потім
          вибрати вказівку Вставка/Обьект і в списку об'єктів вибрати Діаграма
          Місrocoft Graph, після чого ця програма запускається для роботи та на
          екран виводиться діаграма-заготовка і таблиця, за даними якої
          побудована така діаграма.
        </p>
        <p>
          Ще одним додатком, об'єкти якого використовуються при введенні до
          документу формул, є редактор формул Місrocoft Eguation 3.0 Вибравши
          вказівку Вставка/Об'єкт та зі списку об'єктів Місrocoft Eguation 3. на
          екран виводимо панель інструментів Формула.Тепер необхідно почати
          вводити формулу за допомогою від­ повідних кнопок цієї панелі.
        </p>
      </div>
      <div id="20">
        <h3>Завантаження операційної системи. Етапи. Поняття ініціалізації.</h3>
        <p>
          Після проведення самотестування спеціальна програма, що зберігається в
          BIOS, починає пошук завантажника операційної системи. Відбувається
          почергове звертання до наявних у комп'ютері дисків (гнучких, твердих,
          CD-ROM) і пошук на певному місці (у першому, так званому
          завантажувальному секторідиска) наявності спеціальної програми Master
          Boot (програми-завантажника операційної системи). Якщо диск системний
          і програма-завантажник виявляється на місці, то вона завантажується в
          оперативну пам'ять і їй передається керування роботою комп'ютера.
          Програма шукає файли операційної системи на системному диску й
          завантажує їх в оперативну пам'ять як програмні модулі. Якщо системні
          диски в комп'ютері відсутні, на екрані монітора з'являється
          повідомлення «Non system disk», і комп'ютер «зависає», тобто
          завантаження операційної системи припиняється й комп'ютер залишається
          непрацездатним. Після закінчення завантаження операційної системи
          керування передається командному процесору. У випадку використання
          інтерфейсу командного рядка на екрані з'являється запрошення системи
          до введення команд. Запрошення являє собою послідовність символів, що
          повідомляють про поточний диск і каталог. Наприклад, якщо завантаження
          операційної системи було зроблено з диска С:, а операційна система
          була встановлена в каталог WINDOWS, то з'явиться запрошення:
          C:\WINDOWS> Ініціалізація-це створення,активація,підготовка до
          роботи,визначення параметрів.Приведення програми або пристрою в стан
          готовності для використання.
        </p>
      </div>
      <div id="21">
        <h3>
          Поняття про бази даних та їх види: фактографічні та документальні.
          Інформаційно-пошукові системи та системи управління базами даних
          (СУБД), їх призначення та функції.
        </h3>
        <p>
          База даних (БД) — це сукупність однорідних, структурованих,
          взаємопов’язаних даних з конкретної предметної галузі, які
          зберігаються на комп’ютерних носіях.
        </p>
        <p>Класифікація баз даних:</p>
        <ul>
          <li>
            За технологією обробки данних(Централізована база даних та
            Розподілена база даних)
          </li>
          <li>
            За засобом доступу до данних(Локальні та Мережеві(файл-сервер,клієнт
            -сервер))
          </li>
        </ul>
        <p>Основні групи баз даних:</p>
        <ul>
          <li>
            Документальні.Ці бази даних створені сукупністю не структурованих
            текстових документів(статті,книги,реферати,тексти законів)та
            графічних об"єктів
          </li>
          <li>
            Фактографічні.Основна ідея таких баз даних є у тому,що усі відомості
            про дані мають свій формат.Інформація яка заноситься до бази даних
            має чітку структуру
          </li>
          <li>Документально-фактографічні(Змішані)</li>
        </ul>
        <p>
          Інформаційно –пошукові системи (ІПС) — це різновид автоматизованих
          інформаційних систем, в яких завершальна обробка даних не
          передбачається. Ці системи призначені для пошуку текстів (документів,
          їх частин, фактографічних записів) в сховищах (базах даних) за
          формальними характеристиками. Тому в роботі ІПС можна виділити два
          основних етапи: перший — збір і зберігання інформації, другий — пошук
          і видача інформації користувачам.
        </p>
        <p>
          Управляюча програма, яка призначена для зберігання, пошуку та обробки
          даних у базі, зветься системою управління базами даних (СУБД)
        </p>
        <p>Функції СУБД:</p>
        <ul>
          <li>
            можливість маніпулювання даними (ввід, вибір, вставка, оновлення,
            видалення, редагування таін.);
          </li>
          <li>можливість пошуку та формування запитів;</li>
          <li>оформлення звітів;</li>
          <li>забезпечення цілісності даних;</li>
          <li>забезпечення захисту даних;</li>
          <li>
            використання мови, яка дозволяє виконувати нестандартні алгоритми
            обробки даних;
          </li>
          <li>
            створення додатків користувача, які дозволяють об’єднувати
            різноманітні операції роботи з базою даних у єдиний технологічний
            процес.
          </li>
        </ul>
      </div>
      <div id="22">
        <h3>Принцип розташування операційної системи в оперативній пам’яті.</h3>
      </div>
      <div id="23">
        <h3>
          Основні об'єкти, з якими працює операційна система, та вказівки для
          роботи з ними. Стандартні імена зовнішніх запам'ятовуючих пристроїв
          комп'ютера. Поняття файла, його імені та розширення, каталогу (папки),
          шляху до файла. Особливості виконуваних файлів. Приклади.
        </h3>
        <p>
          Терміном "об'єкт" позначається будь-який елемент інтерфейсу
          користувача: значок/кнопка, меню, список, межа вікна, а також саме
          вікно тощо.
        </p>
        <p>
          Основними об'єктами в системі Windows є вікна, документи,папки,
          ярлики.
        </p>
        <p>
          Для збереження інформації на зовнішніх носіях система Windows
          організує інформацію у вигляді документів. Як правило документи
          створюються у конкретних прикладних програмах (додатках). Окремі
          документи складаються у папки, причому кожна папка може містити в собі
          як документи, так і вкладені папки.
        </p>
        <p>
          Ярлик — це невеликий файл (розміром до1 Кбайта), який є засобом
          швидкого доступу і містить лише шлях до відповідного об'єкта.
        </p>
        <p>Основні операції, що виконуються над об'єктами:</p>
        <ul>
          <li>Перейменування.</li>
          <li>Відкриття.</li>
          <li>Вставка.</li>
          <li>Створення нової папки.</li>
          <li>Копіювання.</li>
          <li>Переміщення.</li>
        </ul>
        <p>
          Операції над об'єктами можна здійснювати кількома спосо­бами: за
          допомогою контекстного меню об'єкта, віконного меню або кнопок'панелі
          інструментів, мишки або за допомогою кла­віатури, використовуючи певні
          комбінації клавіш.
        </p>
        <p>Стандартні імена зовнішніх запам'ятовуючих пристроїв комп'ютера</p>
        <p>
          Накопичувач(нагромаджувач)- пристрій зовнішньої пам’яті, на якому
          зберігаються файли. Накопичувачі прийнято позначати літерами
          англійського алфавіту з наступною двокрапкою. Жорсткий диск розбивають
          на декілька областей, які називаються логічними дисками: С:, D:, Е:,
          F: і т.д. Оптичний диск одержує букву , яка йде за останнім іменем
          логічного диску, наступні букви – флеш- пам’яті, картам пам’яті.
          Накопичувачі на ГМД позначаються А:, В:, причому головним є А:, В: -
          допоміжний.
        </p>
        <p>
          Файл — це окремий запис, що зберігається на носієві інформації та має
          ім'я. Ім'я файла складається з двох частин: власне ім'я файла і
          роз­ширення, що визначає його тип (програма, документ тощо). Власне
          ім'я файла дає користувач, а його тип зазвичай задається додатком
          автоматично. Приклади розширень:
        </p>
        <ul>
          <li>.SYS —файл операційної системи</li>
          <li>.ТХТ — текстовий файл</li>
          <li>.ЕХЕ— виконуваний файл</li>
          <li>.РОС —- файл-документ.</li>
        </ul>
        <p>
          Каталогом називається спеціальне місце на диску, в якому зберігаються
          імена і допоміжні відомості про кожний файл:
        </p>
        <ul>
          <li>дата і час останнього поновлення (запису) файла;</li>
          <li>атрибут файла, який вказує його тип;</li>
          <li>розмір файла в байтах;</li>
          <li>
            посилання на об­ласть диска, де записаний сам файл. Каталоги
            утворюють багаторівневу ієрархічну структуру, що має вигляд дерева.
            З початкового кореневого каталогу (наприк­лад, диска С) можна
            перейти в каталоги першого рівня, з них, у свою, чергу, в каталоги
            другого рівня і т. д. У каталогах усіх рівнів можуть зберігатися
            файли. Каталог, з яким у даний момент працює користувач,
            називає­ться поточним. Коли ви використовуєте файл не з поточного
            ка­талогу, необхідно вказати, у якому каталозі цей файл
            знаходить­ся. Це можна зробити за допомогою вказівки шляху до файла.
          </li>
        </ul>
        <p>
          Шлях — це послідовність, яка складається із імені диска та імен папок
          (каталогів), і веде до файла. Наприклад: .
        </p>
        <p>
          Виконувані файли — програми. Користувач безпосередньо працює лише з
          двома типами файлів: програмами і документами. Перші використовуються,
          щоб створювати другі.
        </p>
        <p>
          .ЕХЕ — означає виконуваний файл, який зберігає в собі про-граму.
          Наприклад, winword.ехе,
        </p>
      </div>
      <div id="24">
        <h3>
          Системи числення, що використовуються в обчислювальних системах. Види.
          Приклади. Арифметичні операції в двійковій системі.
        </h3>
        <p>
          • Скласти два числа (10110011101) + (00011101011) • Відняти два числа
          (1011011001)- (0101101110)
        </p>
        <p>
          Система числення – сукупність способів і засобів запису чисел для
          проведення підрахунків. Звичайною для нас і загальноприйнятою є
          позиційна десяткова система числення. Як умовні знаки для запису чисел
          вживаються цифри. Найпростішим способом запису натурального числа є
          зображення його за допомогою відповідної кількості паличок або
          рисочок. Таким способом можна користуватися для невеликих чисел.
        </p>
        <p>Розрізняють такі типи систем числення:</p>
        <ul>
          <li>непозиційні</li>
          <li>позиційні;</li>
          <li>змішані.</li>
        </ul>
        <p>
          Непозиційна система числення – система числення, в якій значення
          кожної цифри в довільному місці послідовності цифр, яка означає запис
          числа, не змінюється.
        </p>
        <p>
          Позиційна система числення – система числення, в якій значення кожної
          цифри залежить від місця в послідовності цифр у записі числа. Для
          позиційних систем числення характерні наочність зображення чисел і
          відносна простота виконання операцій.
        </p>
        <p>Також поширені системи числення з основами:</p>
        <ul>
          <li>
            2 – двійкова (у дискретній математиці, інформатиці, програмуванні)
          </li>
          <li>8 – вісімкова (у програмуванні)</li>
          <li>
            12 – дванадцятирічна (мала широке застосування у давнину, подекуди
            використовується і нині)
          </li>
          <li>
            16 – шістнадцятирічна (поширена у програмуванні, а також для
            кодування шрифтів)
          </li>
          <li>
            60 – шістдесяткова (для виміру кутів і, зокрема, довготи і широти)
          </li>
        </ul>
        <p>Двійкова система числення</p>
        <p>
          У двійковій системі числення числа виражаються тільки за допо­могою
          двох цифр 0 і 1. Не зважаючи на високу розряд­ність двійкових чисел
          саме двійкова система стала основою побудови обчис­лю­вальних машин,
          тому що електронні елементи, які застосо­ву­ються в комп’ютерній
          техніці, можуть перебувати в двох стійких станах. Сучасні комп’ютери
          можуть за один такт (в паралель) опрацьовувати до 64 бітів, тому
          висока розрядність двійкових чисел не є проблемою. Якщо під запис
          двійкового числа виділити n бітів, то кількість різних чисел, що
          записується за допомогою n бітів, дорівнює 2n.
        </p>
      </div>
      <div id="25">
        <h3>
          Основні поняття бази даних. Типи даних, що зберігаються в базі даних.
          Проектування бази даних і створення структури бази даних. Основні
          команди для роботи з таблицями.
        </h3>
        <p>
          База даних (англ. database) – сукупність даних, організованих
          відповідно до концепції, яка описує характеристику цих даних і
          взаємозв'язки між їх елементами; ця сукупність підтримує щонайменше
          одну з областей застосування (за стандартом ISO/IEC 2382:2015[1]). В
          загальному випадку база даних містить схеми, таблиці, подання,
          збережені процедури та інші об'єкти. Дані у базі організовують
          відповідно до моделі організації даних. Таким чином, сучасна база
          даних, крім саме даних, містить їх опис та може містити засоби для їх
          обробки.
        </p>
        <p>
          В загальному випадку базою даних можна вважати будь-який впорядкований
          набір даних. Наприклад, паперову картотеку з формулярами про
          працівників підприємства у відділі кадрів. Але дана стаття зосереджена
          на використанні баз даних в інформаційних системах. На даний час
          застосунки для роботи з базами даних є одними з найпоширеніших
          прикладних програм.
        </p>
        <p>Проектування бази даних.</p>
        <p>
          Перш ніж створити електронну базу даних, необхідно детально розробити
          її структуру. Цей процес включає наступні етапи:
        </p>
        <ul>
          <li>Визначення мети створення бази даних.</li>
          <li>Визначення таблиць, які повинна містити база даних.</li>
          <li>
            Визначення для кожної таблиці списку полів і призначення імен
            кожному полю.
          </li>
          <li>Визначення полів з унікальними значеннями у кожному записі.</li>
          <li>Визначення зв’язків між таблицями.</li>
          <li>Удосконалення структури бази даних.</li>
          <li>Введення даних і створення інших об’єктів бази даних.</li>
          <li>Використання засобів аналізу бази даних.</li>
        </ul>
        <p>
          База даних повинна задовольняти вимогам тих користувачів, які будуть з
          нею працювати. Тому на першому етапі необхідно визначити, які функції
          буде виконувати база даних, яка інформація буде міститись в її
          таблицях. Визначити, яку результативну інформацію необхідно отримувати
          у звітах. Після визначення мети створення бази даних, стане
          зрозумілим, які дані повинні міститися в її таблицях. Добре продумана
          структура таблиць є запорукою ефективної роботи з даними. Необхідно
          детально продумати структуру таблиць, враховуючи наступні вимоги:
        </p>
        <ul>
          <li>Інформація в таблиці не повинна повторюватись.</li>
          <li>Таблиці не повинні містити одну й ту ж інформацію.</li>
          <li>
            Кожна таблиця повинна містити інформацію лише на визначену тему. Щоб
            не відбувалось дублювання даних, необхідно розподілити різнорідні
            дані по окремих таблицях. Для кожного типу відомостей необхідно
            створювати окреме поле. Якщо таблиці містять значну кількість даних,
            можна використати майстер аналізу таблиць (меню
            Сервис/Анализ/Таблица), який допоможе розділити їх на зв’язані
            таблиці, тим самим підвищивши ефективність збереження даних.
          </li>
          <li>
            Для кожного поля таблиці необхідно задати тип даних і вибрати
            найменший розмір, який дозволяє зберігати потрібні дані. Для
            утворення зв’язків між таблицями необхідно визначити для кожної
            таблиці первинний ключ, який являє собою одне або декілька полів, що
            однозначно ідентифікують кожен запис таблиці. -Після даного етапу
            необхідно остаточно проаналізувати утворену структуру і зв’язки між
            таблицями і усунути існуючі недоліки. Для цього вводиться необхідний
            для перевірки структури набір даних і створюються запити, які
            показують чи вдається отримати необхідні відомості. Якщо структура
            таблиць відповідає поставленим вимогам, то вводяться дані і
            створюються всі інші об’єкти – форми, запити, макроси, модулі,
            звіти.
          </li>
        </ul>
      </div>
      <div id="26">
        <h3>
          Призначення віртуальної пам'яті в обчислювальних системах.
          Максимальний розмір програми при віртуальній організації пам'яті. Її
          розподілення між користувачем та ОС.
        </h3>
        <p>
          Віртуальна пам'ять - це сукупність програмно-апаратних засобів, що
          дозволяють користувачам писати програми, розмір яких перевершує наявну
          оперативну пам'ять.
        </p>
        <p>Віртуальна пам'ять виконує наступні завдання:</p>
        <ul>
          <li>
            розміщає дані в запам'ятовувальних пристроях різного типу,
            наприклад, частина програми в оперативній пам'яті, а частина на
            диску;
          </li>
          <li>
            вибір образів процесів або їхніх частин для переміщення з
            оперативної пам'яті на диск і назад;
          </li>
          <li>переміщення в міру необхідності даних між пам'яттю й дисків;</li>
          <li>перетворення віртуальних адрес у фізичні адреси</li>
        </ul>
      </div>
      <div id="27">
        <h3>
          Поняття про стиснення даних. Призначення та основні функції
          програм-архіваторів. Приклади.
        </h3>
        <p>
          Архівація даних - це злиття кількох файлів чи каталогів в єдиний файл
          - архів.
        </p>
        <p>
          Стиснення даних - це скорочення обсягу вихідних файлів шляхом усунення
          надлишкової інформації.
        </p>
        <p>
          Для виконання цих завдань існують програми-архіватори, які
          забезпечують як архівацію, так і стиснення даних. За допомогою
          спеціальних алгоритмів архіватори видаляють з файлів надлишкову
          інформацію, а при зворотній операції розпаковування вони відновлюють
          інформацію у первісному вигляді. При цьому стиснення та відновлення
          інформації відбувається без втрат.
        </p>
        <p>
          Стиснення без втрат актуальне при роботі з текстовими і програмними
          файлами, у задачах криптографії.
        </p>
        <p>
          Існують також методи стиснення із втратами. Вони видаляють з потоку
          інформацію, яка незначно впливає на дані або взагалі не сприймається
          людиною. Такі методи стиснення застосовуються для аудіо- та
          відеофайлів, деяких форматів графічних файлів.
        </p>
        <p>За допомогою архівації можна виконувати цілий комплекс завдань:</p>
        <ul>
          <li>
            меншення обсягу файлів. Це завдання виконується за допомогою методів
            стискання, що були розглянуті вище. Зменшення файлів актуальне не
            лише для економії вільного місця на дисках, а й для прискорення
            передачі файлів по мережі. Якщо дисковий простір можна "нарощувати"
            шляхом придбання сучасніших дисків більшої ємності, то швидкість
            передавання ще довго стримуватиме збільшення розміру файлів, що
            передаються.
          </li>
          <li>
            Резервне копіювання. У процесі експлуатації комп'ютера не виключені
            ситуації, що загрожують невідновною втратою інформації (несправність
            пристрою накопичувача або дефекти на поверхні жорсткого диска,
            неправильні операції з файлами або випадкове знищення файлів, чи
            руйнування інформації комп'ютерним вірусом). Для збереження важливої
            інформації застосовується резервне копіювання на зовнішні носії
            (магнітооптичні диски, диски CD-R і CD-RW, вінчестери). Резервне
            копіювання виконується за допомогою спеціальних утиліт, що
            забезпечують створення компактних архівів. Одна з таких утиліт,
            Microsoft Backup, входить до комплекту Windows.
          </li>
          <li>
            Архівація при шифруванні даних. Ця операція виконується з метою
            зменшення імовірності злому криптосистеми. Доведено, що чим менша
            кореляція (взаємозв'язок) між блоками вхідної інформації, тим нижча
            імовірність злому. Процедура архівації, знищуючи надмірну
            інформацію, ліквідує кореляції у вхідному потоці.
          </li>
        </ul>
        <p>
          Для роботи з архівами існують програми, що називаються архіваторами.
        </p>
        <p>
          Перші програми-архіватори з'явилися в середині 80-х років. Вони були
          зорієнтовані, насамперед, на роботу в MS-DOS і підтримували популярні
          архівні формати: ARC, ZIP, LZH, ARJ, RAR, ICE тощо. Тогочасні
          архіватори дозволяли створювати архівні файли та розкривати архіви,
          переглядати архіви, сортувати файли в архіві, виводити вміст архіву иа
          екран, знищувати файли в архіві. Існувала також група архіваторів
          (PKLITE, LZE,..), які запаковували дані у саморозпаковувані архіви -
          файли з розширеннями exe, com.
        </p>
        <p>
          В MS-DOS програми-архіватори викликаються командним рядком з
          чи-сленними параметрами. Параметри забезпечують великі можливості,
          хоча й створюють труднощі пересічному користувачеві у роботі з
          архіваторами.
        </p>
        <p>
          Значно зручнішою стала робота з архівами з появою ОС Windows 9.x і
          Windows-версій архіваторів.
        </p>
        <p>
          Розглянемо принципи роботи з архіваторами на прикладі програми WinRAR.
        </p>
        <p>
          WinRAR - потужний архіватор і менеджер архівів, який має зручну
          графічну оболонку й підтримує технологію Drag and Drop. Програма
          WinRAR дозволяє працювати з архівними файлами типу rar, zip, cab, arj.
        </p>
        <p>
          Запускається WinRAR будь-яким з можливих способів, передбачених у
          Windows. Якщо піктограми WinRAR немає на робочому столі або на панелі
          інструментів Windows, то найпростіше запустити WinRAR з головного меню
          (Пуск - Программы - WinRAR - WinRAR).
        </p>
        <p>Функції WinRAR:</p>
        <ul>
          <li>Перегляд і вилучення файлів з архіву.</li>
          <li>Архівація файлів.</li>
          <li>Додавання файлів до архіву.</li>
          <li>
            Створення багатотомних, саморозпаковувальних й неперервних архівів.
          </li>
        </ul>
      </div>
      <div id="27">
        <h3>Файл. Файлові системи з погляду користувача. Призначення.</h3>
        <p>
          Файл — це набір даних, до якого можна звертатися за іменем. Файли
          організовані у файлові системи. З погляду користувача файл є
          мінімальним обсягом даних файлової системи, з яким можна працювати
          незалежно. Наприклад, користувач не може зберегти дані на зовнішньому
          носії, не звернувшись при цьому до файлу. Розглянемо особливості
          використання файлів.
        </p>
        <ul>
          <li>
            Файли є найпоширенішим засобом зберігання інформації в
            енергонезалежній пам'яті. Така пам'ять надійніша, й інформація на
            ній може зберігатися так довго, як це необхідно. Зазначимо, що
            більшість збоїв у роботі ОС не руйнує інформації, що зберігається у
            файлах на диску. Для забезпечення збереження даних підвищеної
            цінності вживають додаткових заходів (гаряче резервування, резервне
            копіювання тощо).
          </li>
          <li>
            Файли забезпечують найпростіший варіант спільного використання даних
            різними застосуваннями. Це пов'язано з тим, що файли відокремлені
            від програм, які їх використовують: будь-яка програма, якій відоме
            ім'я файла, може отримати доступ до його вмісту. Якщо одна програма
            запише у файл, а інша його потім прочитає, то ці дві програми
            виконають обмін даними.
          </li>
        </ul>
        <p>Поняття файлової системи</p>
        <p>
          Файлова система - це підсистема ОС, що підтримує організований набір
          файлів, здебільшого у конкретній ділянці дискового простору (логічну
          структуру); низькорівневі структури даних, використовувані для
          організації цього простору у вигляді набору файлів (фізичну
          структуру); програмний інтерфейс файлової системи (набір системних
          викликів, що реалізують операції над файлами).
        </p>
        <p>
          Файлова система надає прикладним програмам абстракцію файла. Прикладні
          програми не мають інформації про те, як організовані дані файла, як
          знаходять відповідність між ім'ям файла і його даними, як пересилають
          дані із диска у пам'ять тощо - усі ці операції забезпечує файлова
          система.
        </p>
        <p>
          Важливо зазначити, що файлові системи можуть надавати інтерфейс
          доступу не тільки до диска, але й до інших пристроїв. Є навіть файлові
          системи, які не зберігають інформацію, а генерують її динамічно за
          запитом. Втім, для прикладних програм усі такі системи мають однаковий
          вигляд.
        </p>
        <p>
          До головних задач файлової системи можна віднести: організацію її
          логічної структури та її відображення на фізичну організацію
          розміщення даних на диску; підтримку програмного інтерфейсу файлової
          системи; забезпечення стійкості проти збоїв; забезпечення розподілу
          файлових ресурсів за умов багатозадачності та захисту даних від
          несанкціонованого доступу.
        </p>
      </div>
      <div id="29">
        <h3>
          Структура програмної складової інформаційної системи. Системне і
          прикладне програмне забезпечення.
        </h3>
        <p>
          Інформаційна система-це сукупність взаємопов"язаних елементів,що
          утворюють єдине ціле і призначені для реалізації інформаційних
          процесів. Інформаційна система має апаратну та програмні складові.
        </p>
        <p>Програмну складову ще називають програмним забезпеченням(ПЗ)</p>
        <p>
          Програмне забезпечення (ПЗ)-це комплекс програм,які забезпечують
          реалізацію інформаційних процесів пристроями інформаційної системи.
          Програмне забезпечення називають також "software"(у перекладі"м'який
          виріб").
        </p>
        <p>Програмне забезпечення ділиться на три групи:</p>
        <ul>
          <li>системне ПЗ</li>
          <li>прикладне ПЗ</li>
          <li>системне програмування</li>
        </ul>
        <p>
          Системне ПЗ-це сукупність програм для забезпечення роботи
          комп'ютера.Системне програмне забезпечення призначено для
          обслуговування власних потреб комп'ютера — забезпечення його
          працездатності і виконання його внутрішніх функцій, а також для
          створення передумов для виконання прикладного програмного
          забезпечення.Типовим прикладом системного програмного забезпечення є
          операційна система.
        </p>
        <p>
          Прикладне ПЗ-це сукупність програм,що використовуються безпосередньо
          для розв'я зування задач в різноманітних предметних галузях в ході
          людської діяльності.Прикладне програмне забезпечення, призначено для
          розв'язання задач користувача. Наприклад: редактори тексту, електронні
          таблиці, бази даних тощо.
        </p>
        <p>
          Програмне забезпечення можна розділити на корисне і шкідливе. Корисне
          програмне забезпечення створюється для виконання завдань, що
          відповідають побажанням користувача комп'ютера. Основна мета
          шкідливого програмного забезпечення — виконувати операції, які є
          небажаними для користувача, часто із завдаванням прихованої чи явної
          шкоди. Прикладом шкідливого програмного забезпечення є комп'ютерні
          віруси.
        </p>
      </div>
      <div id="30">
        <h3>
          Файлова система (FAT). Особливості роботи. Переваги та недоліки.
        </h3>
        <p>
          Фа́йлова систе́ма — спосіб організації даних, який використовуються
          операційною системою для збереження даних у вигляді файлів на
          електронних носіях. Також цим поняттям позначають сукупність файлів та
          директорій, які розміщуються на логічному або фізичному пристрої.
        </p>
        <p>
          FAT (File Allocation Table - таблиця розташування файлів) є
          найпростішою з підтримуваних у Windows NT файлових систем. Основою
          файлової системи FAT є таблиця розташування файлів, яка розміщена на
          початку тому. У випадку пошкодження на диску зберігаються дві копії
          цієї таблиці. Крім того, таблиця розташування файлів і кореневий
          каталог повинні зберігатися у визначеному місці на диску (для
          правильного визначення місця розташування файлів завантаження).
        </p>
        <p>
          Диск, відформатований у файловій системі FAT, ділиться на кластери,
          розмір яких залежить від розміру тому. Одночасно зі створенням файлу в
          каталозі створюється запис і встановлюється номер першого кластера, що
          містить дані. Такий запис в таблиці розміщення файлів сигналізує про
          те, що це останній кластер файлу, або вказує на наступний кластер.
          Оновлення таблиці розміщення файлів має велике значення і вимагає
          багато часу. Якщо таблиця розміщення файлів не оновлюється регулярно,
          це може призвести до втрати даних.
        </p>
        <p>
          Каталог FAT не має певної структури, і файли записуються в першому
          виявленому вільному місці на диску. Крім того, файлова система FAT
          підтримує тільки чотири файлових атрибути: «Системний», «Прихований»,
          «Тільки читання» і «Архівний».
        </p>
        <p>Переваги файлової системи FAT</p>
        <p>
          На комп'ютері під управлінням Windows NT у будь-який з підтримуваних
          файлових систем не можна скасувати видалення. Програма скасування
          видалення намагається напряму звернутися до обладнання, що неможливо
          при використанні Windows NT. Однак якщо файл знаходився в FAT-розділі,
          то, запустивши комп'ютер в режимі MS-DOS, видалення файлу можна
          скасувати. Файлова система FAT найкраще підходить для використання на
          дисках і розділах розміром до 200 Мб, тому що вона запускається з
          мінімальними накладними витратами.
        </p>
        <p>Недоліки файлової системи FAT</p>
        <p>
          Як правило, не варто використовувати файлову систему FAT для дисків і
          розділів, чий розмір більше 200 МБ. Це пояснюється тим, що в міру
          збільшення розміру тому продуктивність файлової системи FAT швидко
          падає. Для файлів, розташованих в розділах FAT, неможливо встановити
          дозволи. Розділи FAT мають обмеження за розміром: 4 ГБ під Windows NT
          і 2 ГБ під MS-DOS.
        </p>
        <p>
          Переваги FAT - низькі накладні витрати на зберігання даних і тотальна
          сумісність з величезною кількістю операційних систем і апаратних
          платформ. Цією файловою системою, як і раніше користуються для
          форматування дискет, де великий обсяг розділу, підтримуваний іншими
          файловими системами, не грає ролі, а низькі накладні витрати
          дозволяють економно використовувати малий обсяг дискети (NTFS вимагає
          для зберігання даних більше місця, що абсолютно не прийнятно для
          дискет ).
        </p>
      </div>
      <div id="31">
        <h3>
          Опрацювання даних за допомогою табличного процесора: редагування,
          копіювання, форматування, переміщення, захист від змін, зв'язування.
          Приклади.
        </h3>
        <p>Можна виділити такі режими роботи табличного процесора:</p>
        <ul>
          <li>формування електронної таблиці;</li>
          <li>управління обчисленнями; '</li>
          <li>графічний режим;</li>
          <li>
            робота з електронною таблицею як базою даних. Система команд
            табличного процесора тісно пов'язана з режимами роботи електронної
            таблиці. Як правило, команди реалізовуються через меню команд або
            через функціональні клавіші.
          </li>
        </ul>
        <p>
          Розглянемо детальніше режими роботи електронних таблиць і команди,
          пов'язані з ними.
        </p>
        <ol>
          <li>
            Режим формування електронних таблиць передбачає заповнення і
            редагування документа. Базові команди формування таблиць можна
            поділити на дві групи:
          </li>
        </ol>
        <ul>
          <li>
            команди, що змінюють вміст клітинок (очистити, редагувати,
            копіювати);
          </li>
          <li>
            команди, шо змінюють структуру таблиці (вилучити, вставити,
            перемістити). '
          </li>
        </ul>
        <ol>
          <li>
            Режим управління обчисленнями Всі обчислення починаються з клітинки,
            розташованої на перетині першого рядка і першого стовпчика
            електронної таблиці. Обчислення проводяться в природному порядку,
            тобто якщо в черговій клітинці знаходиться формула, що включає
            адресу ще не обчисленої клітинки, то обчислення за цією формулою
            відкладаються доти, поки значення в клітинці, від якої залежить
            формула, не буде визначене.
          </li>
        </ol>
        <p>
          Прй кожному введенні нового даного в клітинку електронна таблиця
          переобчислюється заново — реалізовується автоматичне переобчислення. У
          деяких табличних процесорах існує можливість установки ручного
          переобчислення, тобто таблиця переобчислюєтьея заново тільки при
          виборі спеціальної команди. ;
        </p>
        <ol>
          <li>
            Графічний режим дає змогу відображати числову інформацію в
            графічному вигляді, частіше за все у вигляді діаграм та графіків.
            Команди графічного режиму можна поділити на дві групи:команди опису
            діаграм (задають Дані, які будуть виведені в графічному поданні,
            задають тип діаграм);
          </li>
        </ol>
        <ul>
          <li>команди виведення, форматування діаграм та графіків.</li>
        </ul>
        <ol>
          <li>
            Робота в режимі баз даних реалізована в професійних ТП. Можливість
            шукати і вибирати із таблиці дає змогу використовувати електронну
            таблицю як нескладну базу даних. Прй роботі з базами даних
            доводиться мати справу з такими поняттями, як файл, запис, поле
            даних. У електронних таблицях файлом є сама таблиця, записами —
            рядки таблиці, полями — клітинки таблиці.
          </li>
        </ol>
        <p>
          Дані робочого листа можна редагувати двома способами: в рядку формул
          або безпосередньо в клітинці.
        </p>
        <p>
          Редагування існуючих записів клітинок. Для редагування спочатку
          оберіть клітинку, дані якої потрібно редагувати, і клацніть у рядку
          формул. Вміст клітинки з'явиться в рядку формул. Для редагування
          безпосередньо в клітинці клацніть на ній або натисніть клавішу F2.
        </p>
        <p>
          У редагуванні вмісту клітинки для переміщення курсору вводу можна
          використовувати мишу або клавіатуру.
        </p>
        <p>
          В ЕхсеІ пропонується кілька способів копіювання та переміщення даних
          робочого листа. Можна копіювати дані методом drag-and-dtop, за
          допомогою команд основного і контекстного меню, клавіатури,
          стандартної панелі інструментів, використовуючи Буфер обмена або
          копіювати дані в сусідні клітинки за допомогою Автозаполнителя.
        </p>
        <p>До форматування даних належать такі дії: .</p>
        <ul>
          <li>Настроювання параметрів перегляду таблиць ЕхсеІ;</li>
          <li>Вибір формату виведення числа; - Зміна ширини стовпця;</li>
          <li>Зміна висоти рядка;</li>
          <li>Вибір типу шрифту;</li>
          <li>Зміна розміру шрифту;</li>
          <li>Зміна стилю шрифту;</li>
          <li>Вирівнювання і орієнтація даних;</li>
          <li>Форматування сторінки;</li>
          <li>Зміна стилю;</li>
        </ul>
        <p>
          Захист клітинок використовується для закриття доступу до виділених
          клітинок. При створенні документів найчастіше захист встановлюється на
          заголовок, шапку документа, і на клітинки з формулами. Для
          встановлення захисту на клітинки таблиць виконайте такі дії:
        </p>
        <ul>
          <li>
            Виділіть клітинку або діапазон клітинок робочого листа, на які
            потрібно встановити захист, але які на даний момент мають бути
            відкритими для запису і редагування.
          </li>
          <li>Виберіть команду Формат/Ячейки та вкладку Защита.</li>
          <li>Зніміть, якщо потрібно, опцію Защищаемая ячейка.</li>
          <li>Виконайте команду' Сервис/Защита/Защитить лист.</li>
          <li>
            Введіть пароль та підтвердження паролю. Після чого виконайте перші
            два пункти, встановіть опцію Защищаемая ячейка.
          </li>
        </ul>
        <p>
          За необхідності внесення правок у захищені клітинки потрібно зняти
          захист із робочого листа командою Сервис/Защи-та/Снять защиту листа.
        </p>
      </div>
      <div id="32">
        <h3>Способи пошуку файлів в різних файлових системах .</h3>
        <p>
          Для того щоб легко знайти потрібні дані, їх необхідно впорядковано
          зберігати. Більшість користувачів намагається це робити. Зберігаючи
          дані на носіях, вони створюють панки з іменами, що відповідають змісту
          файлів, що в них містяться, розподіляють файли за часом їх створення,
          за видами документів тощо. Однак після перенесення даних з одного
          носія на інший, з одного комп’ютера на інший, внесення змін у перелік
          папок, значного збільшення кількості об’єктів користувач перестав
          пам’ятати місцезнаходження частини даних.
        </p>
        <p>
          Для пошуку потрібних об’єктів операційні системи мають засоби, які
          дають змогу знайти об’єкти за різними значеннями їх властивостей,
          наприклад за іменами, часом створення, типом тощо.
        </p>
        <p>
          В операційній системі Windows ХР для початку пошуку об’єктів потрібно
          виконати Пуск =&gt; Знайти. Відкриється вікно Провідника з панеллю
          Помічник із пошуку у лівій частині вікна.Відкрити цю панель для
          здійснення пошуку можна також вибором кнопки Пошук на панелі
          інструментів вікна Провідника. На панелі Помічник із пошуку розміщено
          список Що ви бажаєте знайти? У списку наведено команди для пошуку
          об’єктів на носіях даних комп’ютера або в мережі за певними значеннями
          властивостей:
        </p>
        <ul>
          <li>
            Малюнки, музику або відео - для пошуку файлів, що містять дані
            зазначених типів;
          </li>
          <li>
            Документи (текстові файли, електронні таблиці тощо) - для пошуку
            файлів, що створені в прикладних програмах, крім файлів малюнків,
            музичних і звукових. Наприклад, файли з розширеннями імен DOC, TXT,
            РРТ, DBF тощо.
          </li>
          <li>
            Усі файли й папки - для пошуку файлів будь-яких типів і папок;
          </li>
          <li>
            Комп’ютери або людей - для пошуку комп’ютерів у мережі або даних про
            певних людей, що зберігаються в спеціальних файлах — адресних
            книгах, які створює користувач.
          </li>
        </ul>
        <p>
          Після вибору однієї з названих команд на панелі Помічника із пошуку
          з’являються елементи керування для уточнення значень властивостей
          пошуку. Наприклад, після вибору команди Малюнки, музику або відео на
          панелі з’являться елементи керування. Установленням позначки
          відповідного прапорця можна вказати, файли яких типів будемо шукати.
          Якщо відомо ім’я файлу або частина імені, то їх можна ввести у
          відповідне поле, що значно пришвидшить пошук.
        </p>
        <p>
          Якщо ви на тижні створювали презентацію, але забули в якій папці її
          зберегли і точно не пам’ятаєте ім’я файлу цієї презентації, то для
          пошуку можна використати спеціальні символи - зірочку (*) чи знак
          питання (?). Зірочка позначає будь-яку кількість довільних символів, а
          знак питання - один довільний символ. Наприклад, за записом *.pptx
          будуть знайдені всі файли і палки, що мають розширення імені pptx, а
          за записом ?.pptx - тільки файли і палки, що мають розширення імені
          pptx і лише один довільний символ в імені.
        </p>
        <p>
          Зменшити час пошуку потрібного файлу можна, вибравши в списку Шукати
          в: відповідний носій даних або палку. Якщо ви знаєте терміни створення
          файлу, то можна встановити позначку перемикача в позиції, що
          відповідає часу створення (змінення) файлу (група перемикачів Коли
          були внесені останні зміни?).
        </p>
        <p>
          Для знаходження файлу з розширенням імені pptx, що містить слово
          «інформатика», може зберігатися на одному із жорстких локальних дисків
          комп’ютера, а дата його створення невідома, слід установити значення
          властивостей пошуку.
        </p>
        <p>
          Після завершення пошуку на панелі Помічника із пошуку буде виведено
          повідомлення про кількість знайдених об’єктів і запит про досягнення
          потрібних результатів пошуку.
        </p>
        <p>
          У результаті пошуку користувач у правій частині вікна отримує список
          імен об’єктів, які відповідають умовам пошуку. Для переходу до папки,
          що містить знайдений об’єкт, потрібно вибрати його в списку та
          виконати Файл =&gt; Відкрити папку, що містить об'єкт. Якщо ж потрібно
          відкрити вікно знайденого об’єкта, то об’єкт необхідно вибрати і
          натиснути клавішу Enter або двічі клацнути на ньому.
        </p>
        <p>
          Якщо пошук об’єктів не дав потрібного результату, то варто перевірити
          чи правильно вказані значення властивостей пошуку, можливо варто
          змінити носій даних чи папку, в списках яких відбувався пошук. А
          можливо варто розширити пошук, здійснивши пошук на всіх носіях даних
          комп'ютера, чи вказати більш загальні значення імені об’єкта.
        </p>
        <p>Для Windows 7</p>
        <p>
          Пошук об’єктів файлової системи в операційній системі Window» 7 можна
          здійснювати кількома способами. Після вибору кнопки Запустити в меню
          стає доступним поле Пошук програм та файлів. У це поле потрібно ввести
          слово або словосполучення для пошуку. Цим словом або словосполученням
          може бути ім’я або частина імені (шаблон) об’єкта.
        </p>
        <p>
          У міру введення символів у поле Пошук програм та файлів над полем
          відкривається панель, на якій відображаються результати пошуку в
          певних областях. Наприклад, на запит «по» було знайдено 5 програм, у
          назві яких є ці дві літери, та 2337 файлів, які або в імені, або у
          вмісті мають зазначені літери.
        </p>
        <p>
          Для запуску знайденої програми або відкриття файлу потрібно вибрати
          відповідне ім’я на панелі пошуку. Вибравши назву групи об’єктів або
          посилання Інші результати, буде відкрито вікно Результати пошуку, яке
          містить у Робочій області список знайдених об’єктів.
        </p>
        <p>
          У кінці списку об’єктів під заголовком Шукати знову в: розміщено
          кнопки для здійснення нового пошуку з уточненими місцями пошуку.
        </p>
        <p>
          Вид подання результатів пошуку можна змінити вибором відповідної
          команди в меню Вигляд або в списку кнопки Змінити подання
        </p>
      </div>
      <div id="33">
        <h3>
          Поняття про мову програмування. Класифікація мов програмування.
          Основні поняття мови: алфавіт, синтаксис і семантика. Основні елементи
          мови програмування: символи, слова, вирази і команди.
        </h3>
        <p>
          Мова програмування — це штучна мова для написання команд, що
          виконуються комп'ютером. Оскільки мова програмування обчислювальній
          машині не зрозуміла, то має існувати спеціальна програма, що
          перекладала б символи цієї мови у двійкові символи машинних вказівок.
          Така програма для перекладу символів, що називається транслятором,
          вперше була створена на початку 50-х років XX століття.
        </p>
        <p>
          Зазначимо, що мови, близькі до числового коду процесора, називають
          мовами низького рівня, а мови, зручні для людини, — мовами високого
          рівня. Мова найнижчого рівня — мова машинного кодування. Трохи вище
          лежить мова Ассемблера, в якій машинні команди замінюються
          мнемонічними скороченнями. Всі інші мови програмування є мовами більш
          високого рівня, ніж мова Ассемблера.
        </p>
        <p>
          Мови програмування поділяються також на процедурні (детальний опис
          розв'язування задачі і використання процедур) і непроцедурні
          (використання об'єктів і декларацій). Процедурні мови, у свою чергу,
          поділяються на операціональні (Ассемблер, Фортран, Бейсік, Сі та ін.)
          і структурні (Паскаль, Модула). Серед непроцедурних мов виділяють
          об'єктні мови (Сі++, Делфі, Смолток) і декларативні йоті (Пролог,
          Лісп).
        </p>
        <p>
          Кожна мова програмування характеризується трьома основними складовими:
          алфавіт, синтаксис і семантика.
        </p>
        <p>
          Алфавіт складається зазвичай з латинських букв, наприклад, у Бейсіку
          всі букви пишуться як великі (А, В,..., 2), а в Паскалі можливе
          використання як малих (а, Ь,.., z), так і великих букв. В алфавіт
          обов'язково входять цифри 0,1, ..., 9, знаки арифметичних операцій (+,
          — та ін.), знаки логічних операцій (поt, апd, ог та ін.), знаки
          операцій порівняння (=, &lt;, &gt; та ін.), а також спеціальні символи
          (дужки, роздільники тощо).
        </p>
        <p>
          Словник мови програмування складається з кінцевого; фіксованого
          набору, ключових слів, наприклад, іпіе^ег, У/пїіе, уаг тощо.
        </p>
        <p>
          Синтаксис (від грецького шпіахіг — «буДова») — це система правил, за
          якими із символів утворюються конструкції мови програмування: слова,
          оператори, команди. Наприклад, символи в слові не можна опускати чи
          міняти місцями. Якщо ви напишете службове слово Ье§іп як Ье§п чи Ьещп,
          це вважатиметься помилкою.
        </p>
        <p>
          Семантика (від грецького $етапііко5 — «що позначає») представлена
          системою правил однозначного тлумачення окремих мовних конструкцій.
          Мова програмування має у своєму розпорядженні набір зарезервованих
          слів, який можна використовувати тільки в значенні, визначеному самою
          мовою, і не можна застосовувати для позначення користувальницьких
          об'єктів (змінних, міток тощо).
        </p>
        <p>
          У будь-якій мові програмування можна виділити чотири типи елементів,
          що використовуються при побудові описів програм: символи, слова,
          вирази і команди (оператори).
        </p>
        <p>
          Символи мови — це основні нероздільні знаки, за допомогою яких
          описуються програми і дані.
        </p>
        <p>
          Слова мови — структури, які утворені із символів і є мінімальними
          одиницями, що мають деякий смисл. Слова — це імена (позначення,
          ідентифікатори) змінних величин, числа, службові слова, які входять в
          команди мови програмування, тощо.
        </p>
        <p>
          Вирази- це текст, який задає правило обчислення одного значення того
          чи іншого типу. Якщо одержуване значення числове, то вираз називають
          арифметичним. Якщо одержуване значення логічне, то вираз називають
          логічним або бульовим. Якщо одержуване значення -текст, то вираз
          називають літерним.
        </p>
        <p>
          Команда — це команда про виконання деякої дії. Скінченна послідовність
          виконуваних одна за іншою команд називається серією команд. Серія може
          складатися із однієї команди або бути порожньою (не містити жодної
          команди).
        </p>
        <p>В мовах програмування застосовуються команди трьох типів:</p>
        <ul>
          <li>
            Команди про безумовне виконання деякої дії чи набору дій:
            присвоювання, введення, виведення, виклику допоміжного алгоритму.
          </li>
          <li>Команди розгалуження.</li>
          <li>
            Команди повторення. . Команди першого типу називають простими,
            другого і третього- складеними.
          </li>
        </ul>
      </div>
      <div id="34">
        <h3>Способи пошуку файлів в різних файлових системах.</h3>
        Смотреть вопрос 32
      </div>
      <div id="35">
        <h3>
          Об'єкти в середовищі текстового процесора (символ, абзац, * документ)
          і правила роботи з ними. Робота з фрагментами тексту:, виділення,
          перенесення, копіювання, форматування, Пошук, заміна. Використання
          буфера обміну. Приклади.
        </h3>
        <p>
          У редакторі Word для створення документа використовуються три
          складовi, символи, абзаци і розділи. Документ складається з одного чи
          кількох розділів. Більшість документів містить тільки один розділ.
          Один або кілька абзаців утворюють розділ. Абзац складається з одного
          чи кількох символів.
        </p>
        <p>
          Для кожної із перелічених складових використовуються свої параметри
          форматування.
        </p>
        <p>
          Щоб переміщувати, форматувати, вилучати або вносити зміни до тексту,
          необхідно його виділити. Виділяти частину документа можна як за
          допомогою мишки, так і за допомогою клавіатури.
        </p>
        <p>
          Протяжка — один із способів виділення будь-якої частини тексту. В
          деяких випадках для виділення тексту використовується смуга виділення
          — це завжди присутня вузька область зліва від тексту.
        </p>
        <p>Для переміщення та копіювання фрагменту тексту слід:</p>
        <ul>
          <li>Виділити той фрагмент, який треба перемістити або скопіювати.</li>
          <li>
            Натиснути кнопку Вьірезать для переміщення або Копировать для
            копіювання.
          </li>
          <li>
            Встановити курсор у місце вставки та натиснути кнопку Вставить на
            панелі інструментів. .
          </li>
        </ul>
        <p>
          Для заміни виділеного тексту іншим слід виділити текст, який треба
          замінити, та набрати з клавіатури новий текст. Word пропонує такий
          засіб, як автозаміна.
        </p>
        <p>
          Автозаміна — автоматична заміна із підготовленого списку слів з
          типовими помилками, скороченнями на правильні або повні.
        </p>
        <p>
          Може виникнути потреба знайти у багато сторінковому документі якесь
          певне слово, групу слів або речення. Наприклад, у тексті кулінарних
          рецептів української кухні знайти «пироги з сиром». Для цього
          необхідно подати команду Правка/ Найти.
        </p>
        <p>
          Для знаходження потрібного фрагменту і заміни його на інший вибрати
          команду Правка/ Заменить.
        </p>
        <p>
          Кожен символ у документі несе в собі інформацію про форматування, яке
          виконується за допомогою встановлення відповідних значень параметрів
          опцій. у діалоговому вікні Формат/Шрифт.
        </p>
        <p>
          Основні параметри форматування символів, які можна задати та змінити:
        </p>
        <ul>
          <li>шрифт;</li>
          <li>інтервал;</li>
          <li>розмір;</li>
          <li>зміщсння;</li>
          <li>підкреслення;</li>
          <li>кернінг для символів;</li>
          <li>колір;</li>
          <li>анімація.</li>
          <li>ефекти;</li>
        </ul>
        <p>
          Найшвидшими способами форматування є кнопки панелі інструментів і
          передбачені комбінації клавіш. Наприклад, для зміни написання символів
          зручно користуватися такими комбінаціями клавіш: Ctrl+I - курсив, Ctrl
          +В — напівжирний,Ctrl +U — підкреслення.
        </p>
        <p>
          Абзац у документі Word- це сукупність символів, яка закінчується
          маркером абзацу, що створюється в результаті натискання клавіші Епtег.
          Цей знак є прихованим символом, що вводиться щоразу, коли користувач
          натискає клавішу Епtег. Параметри форматування абзацу зберігаються у
          маркері абзацу. Абзац може містити багато символів або не мати
          жодного.
        </p>
        <p>
          Щоб змінити форматування абзацу, необхідно спочатку виділити абзац, а
          потім застосувати потрібні параметри форматування. Для виділення
          абзацу достатньо встановити курсор на цьому абзаці, або виділити деяку
          його частину.
        </p>
        <p>
          Основні параметри форматування можна змінити за допомогою команди меню
          Формат/Абзац. У діалозі, що з'явився, ви можете встановити такі
          параметри:
        </p>
        <ul>
          <li>тип вирівнювання;</li>
          <li>абзацні відступи;</li>
          <li>міжрядковий інтервал;</li>
          <li>перший рядок;</li>
          <li>інтервали перед абзацом і після абзацу;</li>
          <li>заборона висячих рядків;</li>
          <li>не відривати від попереднього;</li>
          <li>з нової сторінки;</li>
          <li>заборонити нумерацію рядків;</li>
          <li>табуляція (Формат/Табуляция);</li>
          <li>межі та заливка (Формат/Границь» и заливка);</li>
          <li>список (Формат/Список).</li>
        </ul>
        <p>
          Під час оформлення різних списків зручно використовувати абзаци з
          маркерами (наприклад, у списку вище вставлені маркери а також
          пронумеровані абзаци. Для створення маркувальних нумерованих списків
          виділіть потрібні абзаци і натисніть кнопку Маркери на панелі
          інструментів або кнопку Нумерация. Проте точнішим засобом є
          Формат/Список.
        </p>
        <p>
          Коли необхідно, щоб певні частини документу мали різний вигляд, тоді
          документ треба поділити на розділи та відформатувати кожний розділ за
          своїми параметрами.
        </p>
        <p>До основних параметрив розділу відносять:</p>
        <ul>
          <li>параметри сторінки;</li>
          <li>номери сторінок;</li>
          <li>колонки;</li>
          <li>номери рядків;</li>
          <li>розміщення приміток;</li>
          <li>колонтитули;</li>
          <li>вставлення розривів.</li>
        </ul>
        <p>
          Буфер обміну — це спеціальна ділянка пам'яті, у якій можна розмістити
          виділений фрагмент тексту (вирізати або копіювати на старому місці)
          для того, щоб його вставити в інше місце того самого або іншого
          документа.
        </p>
        <p>
          Зазвичай буфер обміну може містити один об'єкт, але вже є багато
          програм, де буфер обміну є багатомісний.
        </p>
        <p>
          Для роботи з буфером обміну використовують команди Копіювати у буфер
          (Ctrl+С), Вставляти з буфера (Ctrl+Y). Вони є в меню команди
          Редагувати (Правка) чи в контекстних меню об'єктів, а також
          продубльовані кнопками на панелі інструментів.
        </p>
      </div>
      <div id="36">
        <h3>Дескриптор файлу. Призначення. Основні поля.</h3>
        <p>
          Дескриптор файла - это целое число без знака, с помощью которого
          процесс обращается к открытому файлу. Количество дескрипторов файлов,
          доступных процессу, ограничено параметром /OPEN_MAX, заданным в файле
          sys/limits.h. Кроме того, количество дескрипторов файлов можно задать
          с помощью флага -n команды ulimit. Дескрипторы файлов создаются при
          выполнении функций open, pipe, creat и fcntl. Обычно каждый процесс
          работает с уникальным набором дескрипторов. Однако эти же дескрипторы
          могут применяться и дочерними процессами, созданными с помощью функции
          fork. Кроме того, дескрипторы можно скопировать с помощью функций
          fontal, dup и dup2. Все открытые файлы ссылаются к ядру через так
          называемые файловые дескрипторы. Файловый дескриптор — это
          неотрицательное целое число. Когда мы открываем существующий файл и
          создаем новый файл, ядро возвращает процессу файловый дескриптор.
        </p>
        <p>
          Файловый дескриптор — это неотрицательное целое число. Когда создается
          новый поток ввода-вывода, ядро возвращает процессу, создавшему поток
          ввода-вывода, его файловый дескриптор. В операционной системе Windows
          для получения дескриптора файла его необходимо открыть функцией
          CreateFile. Затем полученный дескриптор (или handle) можно
          использовать для работы с этим файлом. Если это драйвер, то дескриптор
          будет использоваться в функции DeviceIoControl. По умолчанию
          Unix-оболочки связывают файловый дескриптор 0 с потоком стандартного
          ввода процесса (терминал), файловый дескриптор 1 — с потоком
          стандартного вывода (терминал), и файловый дескриптор 2 — с потоком
          диагностики (куда обычно выводятся сообщения об ошибках). Это
          соглашение соблюдается многими Unix-оболочками и многими приложениями
          — и ни в коем случае не является составной частью ядра. Стандарт
          POSIX.1 заменил «магические числа» 0, 1, 2 символическими константами
          STDIN_FILENO, STDOUT_FILENO и STDERR_FILENO соответственно. Файловые
          дескрипторы могут принимать значения от 0 до OPEN_MAX. Согласно
          POSIX.1, значение OPEN_MAX равно 19. В реальных ОС это значение может
          быть больше
        </p>
      </div>
      <div id="37">
        <h3>
          Комп'ютерні мережі. Види, основні характеристики і принципи
          використання комп'ютерних мереж. Сервер та робоча станція. Технологія
          клієнт-сервер.
        </h3>
        <p>
          Комп'ютерна мережа — це сукупність комп'ютерів і периферійного
          обладнання, об'єднаних між собою каналами передачі даних. Існують
          різні класифікації комп'ютерних мереж.
        </p>
        <p>Комп'ютерні мережі :</p>
        <ol>
          <li>За призначенням:</li>
        </ol>
        <ul>
          <li>Інформаційні</li>
          <li>Обчислювальні</li>
          <li>Інформаційно-обчислювальні</li>
        </ul>
        <ol>
          <li>За розміщенням даних:</li>
        </ol>
        <ul>
          <li>3 централізованим банком даних</li>
          <li>3 розподіленим банком даних</li>
        </ul>
        <ol>
          <li>За територіальним розподіленням:</li>
        </ol>
        <ul>
          <li>Локальні</li>
          <li>Корпоративні</li>
          <li>Регіональні</li>
          <li>Телекомунікаційні</li>
          <li>Глобальні</li>
        </ul>
        <ol>
          <li>За структурою:</li>
        </ol>
        <ul>
          <li>Однорідні</li>
          <li>Неоднорідні</li>
        </ul>
        <p>Розглянемо детальніше види мереж за територіальним розподіленням.</p>
        <ul>
          <li>
            <p>
              Локальні мережі— поєднують невелике число комп'ютерів (звичайно до
              100) й існують у межах однієї організації чи підприємства. Такі
              мережі часто створюються для організації інформаційної системи чи,
              як мінімум, для спільного використання ресурсів (дисководів,
              принтерів, сканерів та іншого обладнання).
            </p>
          </li>
          <li>
            <p>
              Корпоративні мережі створюються великими підприємствами
              (корпораціями), банками та їхніми філіями, страховими компаніями,
              засобами масової інформації. Корпоративні мережі використовують
              для обслуговування клієнтів у віддалених пунктах: філіях, готелях
              тощо. У таких мережах застосовуються спеціальні заходи для
              збереження таємниці й виключення несанкціонованого доступу до
              інформаційних ресурсів.
            </p>
          </li>
          <li>
            <p>
              Регіональна мережа - комп'ютери об'єднуються в мережу масштабу
              регіону країни. Лініями зв'язку для такої мережі можуть бути
              телефонні лінії чи безпровідний супутниковий зв'язок. Регіональні
              мережі націлені, як правило, на розв'язання завдань масштабу
              регіону ( роботи електроенергетики, транспорту, регіонального
              постачання, банківських розрахунків тощо).
            </p>
          </li>
        </ul>
        <p>
          Мережі, які охоплюють великі відстані і широке коло користувачів,
          називаються телекомунікаційними. Телекомунікаційна мережа — це мережа
          обміну і розподіленого опрацювання інформації, що утворюється безліччю
          взаємозалежних локальних мереж. Передача інформації здійснюється за
          допомогою телефонних, телевізійних і супутникових систем зв'язку.
        </p>
        <p>
          Мережі різного масштабу можуть бути з'єднані між собою,. Наприклад,
          локальна мережа підприємства по кабелю може бути підключена до
          регіональної мережі, а мережі різних регіонів можуть бути зв'язані
          телефонною лінією. Завдяки об'єднанню мереж різного масштабу можливе
          передавання повідомлень, між містами, країнами і континентами. В цьому
          разі ведуть мову про глобальні мережі.
        </p>
        <p>
          Сучасні глобальні мережі використовують телефонний зв'язок. Проте
          зв'язок між серверами глобальної мережі здійснюється не звичайними
          телефонними лініями, а виділеними лініями або спеціальними каналами
          зв'язку.
        </p>
        <p>
          Комп'ютер, з якого користувач Інтернету одержує послуги, називається
          сервером, а комп'ютер користувача — клієнтом чи робочою станцією.
        </p>
        <p>
          Взаємодія серверів і робочих станцій забезпечується мережним
          програмним забезпеченням. Призначення робочої станції — виконувати
          програми, отримані з мережі, а призначення серверу — доставляти ці
          програми до робочих станцій. Схему роботи, коли робочі станції
          виконують велику частину опрацювання, а файл-сервер надає файли для
          цього опрацювання, називають розподіленим опрацюванням. Схему
          опрацювання, за якою робота розподіляється між робочою станцією і
          файлом-сервером більш рівномірно, називається системою клієнт-сервер.
        </p>
      </div>
      <div id="38">
        <h3>Пристрої виведення інформації. Типи.</h3>
        <p>
          Пристрій виведення інформації (англ. output device) — периферійний
          пристрій для виведення інформації (результатів роботи обчислювальної
          машини) для людей і в зрозумілій для людей формі. Найчастіше пристрої
          виведення інформації виводять інформацію через звук і візуально.
        </p>
        <p>Пристрої для виведення інформації візуально</p>
        <p>Монітор</p>
        <p>
          На моніторі у вигляді текстової та графічної інформації відтворюються
          результати роботи комп'ютера. Крім того, на моніторі відображаються
          елементи керування, які користувач може вибрати за допомогою миші та
          активізувати у такий спосіб певну дію (ініціювати виконання команди,
          видалити фрагмент тексту тощо). Зображення на моніторі формується з
          пікселів. Донедавна поширеними були монітори на основі
          електронно-променевих трубок (ЕПТ-монітори), але тепер їх змінили
          РК-монітори, тобто — рідкокристалічні.
        </p>
        <p>
          Основною характеристикою монітора є розмір діагоналі його екрана та
          його дозвіл (чим більший дозвіл екрану, тим більш детальне
          промальовування).
        </p>
        <p>
          Для того щоб створити на екрані монітора зображення, потрібно
          перетворити на відеосигнали зображення, що міститься в пам'яті
          комп'ютера. Цю роботу виконує графічна плата, яка встановлюється у
          рознім на материнській платі. Сучасні графічні плати мають графічний
          процесор, який виконує обчислення, необхідні для отримання зображення.
          Крім того, на графічній платі розміщено відеопам'ять, у якій
          зберігається зображення, що генерується графічним процесором,
          відеоконтролер, що керує цим зображенням, а також інше.
        </p>
        <p>Проектор</p>
        <p>
          Проектор — електронно-оптичний прилад, що дає змогу виводити
          результати роботи комп'ютера шляхом проектування зображення на
          поверхню, розташовану поза приладом — екран.
        </p>
        <p>Принтер</p>
        <p>
          Принтер дає змогу вивести результати роботи комп'ютера на папір чи
          прозору плівку.
        </p>
        <p>
          Сьогодні найпоширенішими є принтери двох типів: струменеві (зазвичай,
          їх використовуються для кольорового друку) та лазерні (зазвичай,
          використовуються для чорно-білого друку).
        </p>
        <p>
          Струменевий принтер наносить зображення на папір у такий спосіб:
          уздовж аркуша паперу переміщується друкувальна голівка з
          мікроскопічними отворами, з яких викидаються крапельки чорнил. Ці
          крапельки такі малі, що їх не можна розгледіти неозброєним оком, і
          тому нанесене на папір зображення здається суцільним. Відбиток,
          отриманий за допомогою струменевого принтера, боїться вологи.
        </p>
        <p>
          У лазерному принтері є світлочутливий вал (фотобарабан), який
          заряджений від'ємним зарядом. Для формування зображення вал сканується
          лазерним променем, який активізується в тих місцях, де має бути
          зображення, та змінює заряд вала. До цих місць на наступному етапі
          притягується тонер (порошкоподібна фарба), який завдяки дії
          електростатики переноситься на папір, який в свою чергу згодом
          надходить у піч, де тонер закріплюється під дією високої температури і
          тиску. Зроблені в такий спосіб відбитки не бояться вологи, стійкі до
          стирання та вицвітання.
        </p>
        <p>Графопобудовник</p>
        <p>
          Графопобудовник — пристрій, призначений для виведення результатів
          роботи комп'ютера в графічній формі на папір. Найчастіше це
          широкоформатний, струменевий принтер, зорієнтований на друк аркушів
          формату А0, А1, А2, А3, А4 тощо різної товщини (від 80 г/м², ватманів,
          напівватманів тощо). Використовується для друку, як у чорно-білому так
          і в кольоровому варіантах, креслень, схем, карт, рекламних плакатів,
          цінників великого формату.
        </p>
        <p>Пристрої для виведення інформації через звук</p>
        <p>Акустична система</p>
        <p>
          Акустична система — пристрій або система пристроїв для відтворення
          звуку, що складається з однієї або кількох динамічних головок,
          розташованих у корпусі (акустичному оформленні). Акустична система
          перетворює електричні коливання у звукові. Окремих колонок в
          акустичній системі може бути від 2 до 8. Колонки бувають пасивні та
          активні. Пасивні колонки не мають власного підсилювача і підключаються
          до виходу підсилювача звукової карти, за допомогою якої комп'ютер
          відтворює інформацію у звуковому форматі. Активні колонки оснащено
          вбудованим підсилювачем, завдяки чому забезпечується краща якість
          звуку.
        </p>
        <p>Навушники</p>
        <p>
          Навушники — пристрій для відтворення звукової інформації персонально.
          За своєю будовою, навушники належать до класу електроакустичних
          перетворювачів. В переважній більшості навушників використовуються
          електродинамічні випромінювачі, які називаються динаміками, звідси й
          назва — динамічні навушники. Існують також навушники з
          електростатичними випромінювачами, але, попри деякі переваги (зокрема,
          в локалізації джерел), вони не користуються широким попитом внаслідок
          своєї дорожнечі.
        </p>
        <p>Вбудований динамік</p>
        <p>
          PC speaker — найпростіший пристрій для відтворення звуку, який
          застосовується у IBM PC-сумісних ПК. До появи спеціалізованих звукових
          карт був основним пристроєм відтворення звуку. У сьогодення PC speaker
          залишається штатним пристроєм IBM PC-сумісних комп'ютерів, і в
          основному використовується для подачі сигналів про помилки, зокрема
          при проведенні POST. Пристрій дозволяє відтворювати прості одноголосні
          звукові сигнали, що генеруються за допомогою програмувального таймера.
          За допомогою спеціальних програм також можливе відтворення
          низькоякісного оцифрованого звуку, шляхом істотного використання
          ресурсів процесора. Приблизно з початку 2000-х років, PC speaker являє
          собою мініатюрний динамік, розташований безпосередньо на материнській
          платі.
        </p>
        <p>Пристрої для виведення інформації через вібрацію</p>
        <p>Ігровий джойстик</p>
        <p>
          Джойстик — пристрій-держак для керування у відеоіграх: важіль на
          підставці, який можна відхиляти у двох площинах. На важелі можуть бути
          різного роду гашетки і перемикачі. Деякі сучасні джойстики мають
          вбудований вібратор. У відеоіграх при зіткненні з перешкодою він
          вібрує, таким чином інформація до людини доходить у вигляді вібрації.
        </p>
      </div>
      <div id="39">
        <h3>
          Виконання обчислень у середовищі табличного процесора. Використання
          математичних функцій і операцій для опрацювання даних, поданих в
          електронній таблиці. Приклади.
        </h3>
        <p>
          Електронні таблиці Ехсеl мають у своєму розпорядженні потужні
          інструменти для опрацювання даних, основним серед яких є формули.
          Формули в Ехсеl являють собою вирази, які описують обчислення в
          комірках.
        </p>
        <p>
          Запис формули починається зі знака рівності = або знака + чи — .
          Формула, що набирається, відображається в рядку формул. Завершується
          введення формули натисканням на клавішу Епter, переміщенням курсору в
          іншу комірку. Після цього запис формули в комірці зникає і з'являється
          результат її виконання або повідомлення про помилку.
        </p>
        <p>
          За допомогою формул можна порівнювати дані в комірках, множити
          значення комірок, знаходити середні значення тощо.
        </p>
        <p>
          У Ехсеl є чотири види операторів: арифметичні, текстові, оператори
          порівняння й оператори посилань (адресні оператори). Операції над
          числами виконуються за допомогою арифметичних операторів: + (сума), —
          (різниця), * (множення), / (ділення), ^(піднесення до степеня), %
          (обчислення відсотка). Під час роботи з текстом і числами
          застосовуються оператори порівняння: =,&lt;,&gt;,&lt;=,&gt;=,&lt;&gt;
          (не дорівнює).
        </p>
        <p>
          Формули, що вписуються в комірки електронних таблиць, можуть містити в
          собі вбудовані функції. Вбудовані функції широко використовуються в
          Ехсеl для обчислень, полегшуючи процес опрацювання даних. Крім того,
          застосування цих функцій позбавляє від довгих записів і знижує
          ймовірність помилок.
        </p>
        <p>
          При цьому аргументами функцій можуть бути самі дані, адреси об'єктів
          електронної таблиці, в яких зберігаються ці дані. Адреси, що
          використовуються в функціях і формулах, одержали назву посилань.
          Можливість використання в ЕТ посилань в формулах і/або функціях дає
          змогу автоматично виконувати обчислення при зміні значень даних
          елементів ЕТ, на які виконуються посилання.
        </p>
        <p>
          Функції в ЕТ реалізовані за допомогою стандартних програм, які можна
          заздалегідь викликати за відомими іменами. Кількість різних функцій,
          які можна використовувати, досить велика, для зручності їх пошуку вони
          всі поділені на категорії: математичні, статистичні, текстові,
          логічні, фінансові, функції дати і часу тощо.
        </p>
        <p>
          Використання всіх функцій та формул відбувається за однаковими
          правилами:
        </p>
        <ul>
          <li>кожна функція мас своє унікальне ім'я;</li>
          <li>
            при зверненні до функції після її імені в круглих дужках вказується
            список аргументів, відокремлених між собою крапкою з комою;
          </li>
          <li>введення до комірки формули слід починати із знака =.</li>
        </ul>
        <p>Приклади:</p>
        <ul>
          <li>=КОРІНЬ(А5)</li>
          <li>=МАКС(Д6:В10;В2:Е4;С$:І8)</li>
          <li>=СЕРЕДНЄ(АЦВ23)</li>
          <li>=СУМА(А1 :А9)*СУМ А(В 1: В9)</li>
        </ul>
        <p>
          Результат обчислення функції називається значенням, що повертається.
          Дужки, які обмежують список аргументів, завжди мають бути парними;
          пропуски перед дужками чи після них не припускаються. Окремі аргументи
          в списку мають бути розділені комами.
        </p>
        <p>
          Функція включається у формулу записом «вручну» або за допомогою
          майстра функцій, що спрощує введення функції. Викликається майстер
          через меню Вставка — Функция.
        </p>
        <p>
          Діалог Мастер функций містить два списки: Категория і Функция. У
          першому списку треба вибрати категорію, у якій знаходиться потрібна
          вам функція, а в другому — саму функцію. Після вибору функції
          необхідно зважати на вказівки Мастера до одержання результату.
        </p>
        <p>
          Перелічимо функції Ехсеl, призначені для роботи з математичними
          виразами.
        </p>
        <p>
          До таких функцій належать тригонометричні функції (СОS, SIN, ТАN);
          зворотні тригонометричні (АСОS? АSIN, АТАN); модуль числа (АВS)
          логарифмічні (LOG, LOG10, LN); арифметичні (СУМ, ПРОИЗВЕД, ЧАСТНОЕ,
          ОСТАТ); степінь числа (СТЕПЕНЬ); квадратний корінь (КОРЕНЬ); визначник
          матриці (МОПРЕД), число п (ПИ) та інші.
        </p>
      </div>
    </>
  );
};

export default Answers_1_39;
